Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: ru

source: When a client requests an image, the ``glance-api`` service accesses the appropriate store on the storage device over the storage network (``br-storage``) and pulls it into its cache. When the same image is requested again, it is given to the client directly from the cache.
ru: Когда клиент запрашивает образ, служба ``glance-api`` обращается к соответствующему хранилищу на устройстве хранения через сеть хранения (``br-storage``) и загружает его в свой кэш. Когда то же образ запрашивается снова, оно предоставляется клиенту напрямую из кэша.

source: When adding groups, keep the following in mind:
ru: При добавлении групп помните следующее:

source: When an instance is scheduled for creation on a Compute host, the ``nova-compute`` service requests the image from the ``glance-api`` service over the management network (``br-mgmt``).
ru: Когда на вычислительном хосте запланировано создание инстанса, служба ``nova-compute`` запрашивает образ у службы ``glance-api`` по сети управления (``br-mgmt``).

source: When does a patch to an OpenStack-Ansible role get into a release?
ru: Когда исправление роли OpenStack-Ansible попадает в релиз?

source: When including OpenStack-Ansible in a project, consider using a parallel directory structure as shown in the ``ansible.cfg`` files section.
ru: При включении OpenStack-Ansible в проект рассмотрите возможность использования параллельной структуры каталогов, как показано в разделе файлов ``ansible.cfg``.

source: When running an Ansible command (such as ``ansible``, ``ansible-playbook`` or ``openstack-ansible``) Ansible automatically executes the ``dynamic_inventory.py`` script and use its output as inventory.
ru: При запуске команды Ansible (например, ``ansible``, ``ansible-playbook`` или ``openstack-ansible``) Ansible автоматически выполняет скрипт ``dynamic_inventory.py`` и использует его вывод в качестве inventory.

source: When the File System store is used, the Image service has no mechanism of its own to replicate the image between Image service hosts. We recommend using a shared storage back end (via a file system mount) to ensure that all ``glance-api`` services have access to all images. Doing so prevents losing access to images when an infrastructure (control plane) host is lost.
ru: При использовании файлового хранилища служба образов не имеет собственного механизма для репликации образа между хостами службы образов. Мы рекомендуем использовать общий бекэнд хранилища (через монтирование файловой системы), чтобы гарантировать, что все службы ``glance-api`` имеют доступ ко всем образам. Это предотвращает потерю доступа к образам при потере хоста инфраструктуры (управляющей плоскости).

source: When the OpenStack-Ansible project was created, it was required to provide a system able to override any OpenStack upstream source code.
ru: Когда проект OpenStack-Ansible создавался, было необходимо дать возможность переопределить любой источник исходных кодов OpenStack.

source: When the dynamic inventory script creates a container name, the host on which the container resides is added to the ``lxc_hosts`` inventory group.
ru: Когда сценарий динамического inventory создает имя контейнера, хост, на котором находится контейнер, добавляется в группу inventory ``lxc_hosts``.

source: When the flavors in the Compute service are configured to provide instances with root or ephemeral disks, the ``nova-compute`` service manages these allocations using its ephemeral disk storage location.
ru: Когда типы инстансов в вычислительной службе настроены на предоставление инстансам корневых или временных дисков, служба ``nova-compute`` управляет этими распределениями, используя свое местоположение хранилища временных дисков.

source: While the pre-built packages in the repository-infrastructure are comprehensive, it may be needed to change the source locations and versions of packages to suit different deployment needs. Adding additional repositories as overrides is as simple as listing entries within the variable file of your choice. Any ``user_.*.yml`` file within the "/etc/openstack_deployment" directory will work to facilitate the addition of a new packages.
ru: Хотя предварительно созданные пакеты в инфраструктуре репозитория являются исчерпывающими, может потребоваться изменить исходные местоположения и версии пакетов для соответствия различным потребностям развертывания. Добавление дополнительных репозиториев в качестве переопределений так же просто, как перечисление записей в файле переменных по вашему выбору. Любой файл ``user_.*.yml`` в каталоге "/etc/openstack_deployment" будет работать для облегчения добавления новых пакетов.

source: Why choose OpenStack-Ansible?
ru: Почему стоит выбрать OpenStack-Ansible?

source: Within a ``physical_skel`` section, the OpenStack-Ansible dynamic inventory expects to find a pair of keys. The first key maps to items in the ``container_skel`` section, and the second key maps to the target host groups (described above) that are responsible for hosting the service component.
ru: В разделе ``physical_skel`` динамический inventory OpenStack-Ansible ожидает найти пару ключей. Первый ключ сопоставляется с элементами в разделе ``container_skel``, а второй ключ сопоставляется с целевыми группами хостов (описанными выше), которые отвечают за размещение компонента службы.

source: Writing debug logs
ru: Написание отладочных журналов

source: You can also apply overrides on a per-host basis with the following configuration in the ``/etc/openstack_deploy/openstack_user_config.yml`` file:
ru: Вы также можете применить переопределения для каждого хоста с помощью следующей конфигурации в файле ``/etc/openstack_deploy/openstack_user_config.yml``:

source: You can also run OpenStack-Ansible with non-root user by leveraging the `Ansible privilege escalation`_ method. For more details, please reffer to the :doc:`running as non-root </user/security/non-root>`.
ru: Вы также можете запустить OpenStack-Ansible с не-root пользователем, используя метод `Ansible privilege escalation`_. Для получения более подробной информации см. к :doc:`Запуск от имени пользователя без прав root </user/security/non-root>`.

source: You can also use the ``no_containers`` option to specify a host that will have all services deployed on metal inside of it.
ru: Вы также можете использовать опцию ``no_containers``, чтобы указать хост, на котором будут развернуты все службы.

source: You can create your own playbook, variable, and role structure while still including the OpenStack-Ansible roles and libraries by setting environment variables or by adjusting ``/usr/local/bin/openstack-ansible.rc``.
ru: Вы можете создать собственную структуру сценариев, переменных и ролей, одновременно включив роли и библиотеки OpenStack-Ansible, установив переменные среды или настроив ``/usr/local/bin/openstack-ansible.rc``.

source: You can override ``.yml`` file values by supplying replacement YAML content.
ru: Вы можете переопределить значения файла ``.yml``, указав заменяющее содержимое YAML.

source: You can override location of the ``user-collection-requirements.yml`` by setting ``USER_COLLECTION_FILE`` environment variable before running the ``bootstrap-ansible.sh`` script. Though it is expected to be relative to ``OSA_CONFIG_DIR`` (/etc/openstack_deploy) folder.
ru: Вы можете переопределить расположение ``user-collection-requirements.yml``, установив переменную среды ``USER_COLLECTION_FILE`` перед запуском скрипта ``bootstrap-ansible.sh``. Хотя ожидается, что она будет относительно папки ``OSA_CONFIG_DIR`` (/etc/openstack_deploy).

source: You can override the default path to ``user-ansible-venv-requirements.txt`` file with ``USER_ANSIBLE_REQUIREMENTS_FILE`` environment variable before running the ``bootstrap-ansible.sh`` script.
ru: Вы можете переопределить путь по умолчанию к файлу ``user-ansible-venv-requirements.txt`` с помощью переменной среды ``USER_ANSIBLE_REQUIREMENTS_FILE`` перед запуском скрипта ``bootstrap-ansible.sh``.

source: You can override the existing group vars (and host vars) by creating your own folder in ``/etc/openstack_deploy/group_vars`` (and ``/etc/openstack_deploy/host_vars`` respectively).
ru: Вы можете переопределить существующие групповые переменные (и переменные хоста), создав собственную папку в ``/etc/openstack_deploy/group_vars`` (и ``/etc/openstack_deploy/host_vars`` соответственно).

source: You define *container groups*, which can map from the service components to be deployed up to host groups, through files in the ``/etc/openstack_deploy/env.d/`` directory.
ru: Вы определяете *группы контейнеров*, которые могут сопоставлять компоненты служб, подлежащие развертыванию, с группами хостов с помощью файлов в каталоге ``/etc/openstack_deploy/env.d/``.

source: You define host groups, which gather the target hosts into *inventory groups*, through the ``/etc/openstack_deploy/openstack_user_config.yml`` file and the contents of the ``/etc/openstack_deploy/conf.d/`` directory.
ru: Группы хостов, которые объединяют целевые хосты в *группы inventory*, определяются с помощью файла ``/etc/openstack_deploy/openstack_user_config.yml`` и содержимого каталога ``/etc/openstack_deploy/conf.d/``.

source: You like to use reliable, proven technology. We try to run OpenStack with a minimum amount of packages that are not provided by distributions or the OpenStack community. Less dependencies and distribution tested software make the project more reliable.
ru: Вам нравится использовать надежную, проверенную технологию. Мы стараемся запускать OpenStack с минимальным количеством пакетов, которые не предоставляются дистрибутивами или сообществом OpenStack. Меньше зависимостей и проверенное дистрибутивом программное обеспечение делают проект более надежным.

source: You may find detailed example of `openstack_user_config.yml` configuration in section :ref:`openstack-user-config-reference`.
ru: Подробный пример конфигурации `openstack_user_config.yml` вы см. в разделе :ref:`openstack-user-config-reference`.

source: You want to be able to select how to deploy on your hardware: deploy partially on metal, fully on metal, or fully in machine containers.
ru: Вам необходимо иметь возможность выбрать способ развертывания на вашем оборудовании: частичное развертывание на 'голом' железе, полное развертывание на 'голом' железе или полное развертывание в контейнерах машин.

source: You want to deploy OpenStack services from distribution packages (deb or rpm). Whilst there is some support for this, coverage of the services is incomplete and a lot of operator flexibility is lost when using this approach.
ru: Вы хотите развернуть службы OpenStack из дистрибутивных пакетов (deb или rpm). Хотя для этого есть некоторая поддержка, покрытие служб неполное, и при использовании этого подхода теряется значительная часть гибкости оператора.

source: You want to deploy OpenStack with 100% application containers. We currently support LXC containers, if you want to go 100% Docker, there are other projects in the OpenStack community that can help you.
ru: Вы хотите развернуть OpenStack со 100% контейнерами приложений. В настоящее время мы поддерживаем контейнеры LXC, если вы хотите перейти на 100% Docker, в сообществе OpenStack есть другие проекты, которые могут вам помочь.

source: You would need to manually map physical interfaces to specific containers. This also assumes, that same interface name is present on all containers and it is consistent and present before LXC startup.
ru: Вам нужно будет вручную сопоставить физические интерфейсы с конкретными контейнерами. Это также предполагает, что одно и то же имя интерфейса присутствует во всех контейнерах и оно согласовано и присутствует до запуска LXC.

source: `Ansible Documentation <https://docs.ansible.com/ansible/latest/>`_
ru: `Документация Ansible <https://docs.ansible.com/ansible/latest/>`_

source: `Ansible tips and tricks <https://docs.ansible.com/ansible/latest/tips_tricks/index.html>`_
ru: `Советы и рекомендации по Ansible <https://docs.ansible.com/ansible/latest/tips_tricks/index.html>`_

source: `Ceph Documentation <https://docs.ceph.com/en/latest/>`_
ru: `Документация Ceph <https://docs.ceph.com/en/latest/>`_

source: `Configuring Ansible <https://docs.ansible.com/ansible/latest/installation_guide/intro_configuration.html>`_
ru: `Настройка Ansible <https://docs.ansible.com/ansible/latest/installation_guide/intro_configuration.html>`_

source: `OpenStack API Documentation <https://docs.openstack.org/api-quick-start>`_
ru: `Документация API OpenStack <https://docs.openstack.org/api-quick-start>`_

source: `OpenStack Documentation <https://docs.openstack.org>`_
ru: `Документация OpenStack <https://docs.openstack.org>`_

source: ``ANSIBLE_ROLE_FILE`` is an environment variable pointing to the location of a YAML file which ansible-galaxy can consume, specifying which roles to download and install. The default value for this is ``ansible-role-requirements.yml``.
ru: ``ANSIBLE_ROLE_FILE`` — это переменная среды, указывающая на местоположение файла YAML, который может использовать ansible-galaxy, определяя, какие роли следует загрузить и установить. Значение по умолчанию для этого — ``ansible-role-requirements.yml``.

source: ``all`` contains global network information such as the load balancer IPs and provider network metadata.
ru: ``all`` содержит глобальную сетевую информацию, такую ​​как IP-адреса балансировщика нагрузки и метаданные сети провайдера.

source: ``env.d`` (for environment customization)
ru: ``env.d`` (для настройки среды)

source: ``hosts`` contains a map of a host's name to its variable and group data.
ru: ``hosts`` содержит сопоставление имени хоста с его переменными и групповыми данными.

source: ``management_ip`` will be used as ``management_address`` for the node, while ``ip`` will be used as ``ansible_host`` for accessing node by SSH.
ru: ``management_ip`` будет использоваться как ``management_address`` для узла, в то время как ``ip`` будет использоваться как ``ansible_host`` для доступа к узлу по SSH.

source: ``user-collection-requirements`` will be merged with ``ansible-collection-requirements`` using collection ``name`` as a key. In case ``source`` is not defined in ``user-collection-requirements``, collection installation will be skipped. This way you can skip installation of unwanted collections.
ru: ``user-collection-requirements`` будет объединен с ``ansible-collection-requirements`` с использованием ``name`` коллекции в качестве ключа. В случае, если ``source`` не определен в ``user-collection-requirements``, установка коллекции будет пропущена. Таким образом, вы можете пропустить установку нежелательных коллекций.

source: ``user_*.yml`` files contain YAML variables which are applied as extra-vars when executing ``openstack-ansible`` to run playbooks. They will be sourced in alphanumeric order by ``openstack-ansible``. If duplicate variables occur in the ``user_*.yml`` files, the variable in the last file read will take precedence.
ru: Файлы ``user_*.yml`` содержат переменные YAML, которые применяются как extra-vars при выполнении ``openstack-ansible`` для запуска плейбуков. Они будут получены в алфавитно-цифровом порядке ``openstack-ansible``. Если в файлах ``user_*.yml`` встречаются дублирующиеся переменные, то приоритет будет иметь переменная в последнем прочитанном файле.

source: ``user_variables.yml`` and ``user_secrets.yml`` are used directly by OpenStack-Ansible. Adding custom variables used by your own roles and playbooks to these files is not recommended. Doing so will complicate your upgrade path by making comparison of your existing files with later versions of these files more arduous. Rather, recommended practice is to place your own variables in files named following the ``user_*.yml`` pattern so they will be sourced alongside those used exclusively by OpenStack-Ansible.
ru: ``user_variables.yml`` и ``user_secrets.yml`` используются непосредственно OpenStack-Ansible. Не рекомендуется добавлять в эти файлы пользовательские переменные, используемые вашими собственными ролями и сценариями. Это усложнит ваш путь обновления, сделав сравнение ваших существующих файлов с более поздними версиями этих файлов более трудным. Вместо этого рекомендуемая практика заключается в том, чтобы помещать ваши собственные переменные в файлы, названные по шаблону ``user_*.yml``, чтобы они были получены вместе с теми, которые используются исключительно OpenStack-Ansible.

source: config_template documentation
ru: Документация по config_template

source: openstack_user_config settings reference
ru: Справочник настроек openstack_user_config

source: user_*.yml files in more details
ru: Подробнее про файлы user_*.yml
