Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: ru

source: However, we do try to provide ``upgrade`` releases where we support both new and old Operating System versions, providing deployers the ability to properly upgrade their deployments to the new Operating System release.
ru: Однако, мы стараемся выпускать релизы ``обновления``, в которых мы поддерживаем как новые, так и старые версии операционной системы, предоставляя разработчикам возможность правильно обновить свои установки до новой версии операционной системы.

source: However, you may notice some issues with your application as clients may be trying to push messages to the un-responsive node. To remedy this, forget the node from the cluster by executing the following:
ru: Однако, вы можете заметить некоторые проблемы с вашим приложением, поскольку клиенты могут пытаться отправлять сообщения на недоступный узел. Чтобы исправить это, уберите узел из кластера, выполнив следующее:

source: IP address should be applied to ``br-mgmt``:
ru: IP-адрес должен быть применен к ``br-mgmt``:

source: IP address should be applied to ``br-vxlan``:
ru: IP-адрес должен быть присвоен ``br-vxlan``:

source: IP address should be applied to ``eth1`` inside the LXC container:
ru: IP-адрес должен быть применен к ``eth1`` внутри контейнера LXC:

source: IP addresses should be applied to physical interface, bond interface, tagged sub-interface, or in some cases the bridge interface:
ru: IP-адреса должны быть применены к физическому интерфейсу, бондовому интерфейсу, тегированному субинтерфейсу или, в некоторых случаях, интерфейсу моста:

source: Identify your 'primary' HAProxy/Galera/RabbitMQ/repo infrastructure host
ru: Определите 'основной' хост инфраструктуры HAProxy/Galera/RabbitMQ/repo

source: If Ceph has been deployed as part of an OpenStack-Ansible deployment using the roles maintained by the `Ceph-Ansible`_ project you will also need to upgrade the Ceph version. Each OpenStack-Ansible release is tested only with specific Ceph-Ansible release and Ceph upgrades are not checked in any Openstack-Ansible integration tests. So we do not test or guarantee an upgrade path for such deployments. In this case tests should be done in a lab environment before upgrading.
ru: Если Ceph был развернут как часть развертывания OpenStack-Ansible с использованием ролей, поддерживаемых проектом `Ceph-Ansible`_, вам также потребуется обновить версию Ceph. Каждый релиз OpenStack-Ansible тестируется только с определенным выпуском Ceph-Ansible, и обновление Ceph не проверяется ни в одном интеграционном тесте Openstack-Ansible. Поэтому мы не тестируем и не гарантируем путь обновления для таких развертываний. В этом случае перед обновлением следует провести тесты в лабораторном окружении.

source: If GlusterFS was running on this host (repo nodes)
ru: Если GlusterFS была запущена на этом узле (узлы репозитория)

source: If HAProxy was set into 'MAINT' mode, this can now be removed for services which have been restored.
ru: Если HAProxy был установлен в режим "MAINT", теперь его можно удалить для служб, которые были восстановлены.

source: If MariaDB fails to start on any of the failed nodes, run the ``mariadbd`` command and perform further analysis on the output. As a last resort, rebuild the container for the node.
ru: Если MariaDB не запускается на каком-либо из отказавших узлов, запустите команду ``mariadbd`` и выполните дальнейший анализ выходных данных. В крайнем случае пересоздайте контейнер для узла.

source: If MariaDB fails to start, run the ``mariadbd`` command and perform further analysis on the output. As a last resort, rebuild the container for the node.
ru: Если MariaDB не запускается, запустите команду ``mariadbd`` и выполните дальнейший анализ вывода. В крайнем случае, пересоздайте контейнер для узла.

source: If RabbitMQ was running on this host
ru: Если RabbitMQ запущен на этом хосте

source: If VLAN:
ru: Если VLAN:

source: If VXLAN:
ru: Если VXLAN:

source: If a Compute host needs to be shut down:
ru: Если вычислительный узел необходимо выключить:

source: If a LVM backed Block Storage host needs to be shut down:
ru: Если узел блочного хранилища LVM должен быть выключен:

source: If a failure does occur, follow these steps to restore the database from the Primary (failed) Region:
ru: Если произошел сбой, выполните следующие действия для восстановления базы данных из основного (сбойного) региона:

source: If a single node fails, the other nodes maintain quorum and continue to process SQL requests.
ru: В случае отказа одного узла остальные узлы сохраняют кворум и продолжают обрабатывать SQL-запросы.

source: If all cluster nodes stop in a simultaneous and uncontrolled manner, (for example, with a power cut) you can be left with a situation in which all nodes think that some other node stopped after them. In this case you can use the :command:`force_boot` command on one node to make it bootable again.
ru: Если все узлы кластера останавливаются одновременно и неконтролируемо (например, из-за отключения питания), вы можете оказаться в ситуации, когда все узлы думают, что какой-то другой узел остановился после них. В этом случае вы можете использовать команду :command:`force_boot` на одном узле, чтобы снова сделать его загружаемым.

source: If any single node has a positive ``seqno`` value, then that node can be used to restart the cluster. However, because there is no guarantee that each node has an identical copy of the data, we do not recommend to restart the cluster using the ``--wsrep-new-cluster`` command on one node.
ru: Если какой-либо один узел имеет положительное значение ``seqno``, то этот узел можно использовать для перезапуска кластера. Однако, поскольку нет гарантии, что каждый узел имеет идентичную копию данных, мы не рекомендуем перезапускать кластер с помощью команды ``--wsrep-new-cluster`` на одном узле.

source: If creating multiple instances with this configuration, enter an integer up to the number permitted by the quota, which is ``10`` by default.
ru: При создании нескольких инстансов с этой конфигурацией введите целое число до числа, разрешенного квотой, которое по умолчанию равно ``10``.

source: If it IS a 'primary', do these steps
ru: Если он является 'основным', выполните следующие действия

source: If it is NOT a 'primary', install everything on the new host
ru: Если он НЕ является 'основным', установите все на новый хост.

source: If multicast, make sure the physical switches are properly allowing and distributing multicast traffic.
ru: В случае multicast, убедитесь, что физические коммутаторы правильно разрешают и распределяют multicast трафик.

source: If necessary, also modify the ``used_ips`` stanza.
ru: При необходимости также измените ``used_ips``.

source: If rows are found, detach and re-attach the volumes using the values listed in the previous query:
ru: Если строки найдены, отсоедините и снова присоедините диски, используя значения, указанные в предыдущем запросе:

source: If shared storage is not used, data can be copied from the ``/var/lib/nova/instances`` directory on the failed Compute node ``${FAILED_NODE}`` to another node ``${RECEIVING_NODE}``\ before performing the following procedure. Please note this method is not supported.
ru: Если общее хранилище не используется, перед выполнением следующей процедуры можно скопировать данные из каталога ``/var/lib/nova/instances`` на отказавшем вычислительном узле ``${FAILED_NODE}`` на другой узел ``${RECEIVING_NODE}``\. Обратите внимание, что этот метод не поддерживается.

source: If the cluster is healthy, repeat steps 1-6 for the rest instances, including the “bootstrap” one.
ru: Если кластер в рабочем состоянии, повторите шаги 1-6 для остальных инстансов, включая "загрузочный.

source: If the cluster is utilizing Telemetry/Metering (ceilometer), edit the ``/etc/openstack_deploy/conf.d/ceilometer.yml`` file and add the host to the ``metering-compute_hosts`` stanza.
ru: Если кластер использует службу телеметрии/измерения (ceilometer), отредактируйте файл ``/etc/openstack_deploy/conf.d/ceilometer.yml`` и добавьте хост в ``metering-compute_hosts``.

source: If the container does not respond, it can be restarted from the physical network host:
ru: Если контейнер не отвечает, его можно перезапустить с физического сетевого хоста:

source: If the host DOES have to be brought down for the hardware replacement, how should the resources on that host be handled?
ru: Если хост действительно придется отключить для замены оборудования, как следует обращаться с ресурсами на этом хосте?

source: If the host still shows as part of the cluster, but it is not running, execute:
ru: Если хост по-прежнему отображается как часть кластера, но не запущен, выполните:

source: If the last node to go offline cannot be brought back up, it can be removed from the cluster using the :command:`forget_cluster_node` command.
ru: Если последний отключившийся узел не может быть восстановлен, его можно удалить из кластера с помощью команды :command:`forget_cluster_node`.

source: If there have been any OpenStack-Ansible variable name changes or environment/inventory changes, there is a playbook to handle those changes to ensure service continuity in the environment when the new playbooks run. The playbook is tagged to ensure that any part of it can be executed on its own or skipped. Please review the contents of the playbook for more information.
ru: Если в OpenStack-Ansible были внесены изменения в имена переменных или в окружение/inventory, есть плейбук для обработки этих изменений, чтобы обеспечить непрерывность обслуживания в окружении при запуске новых playbook. Плейбук содержит теги, чтобы любая его часть могла быть выполнена самостоятельно или пропущена. Для получения дополнительной информации ознакомьтесь с содержанием плейбука.

source: If this order is adapted, it will be necessary to restore some files to the 'repo' host from a backup part-way through the process. This will be necessary if no 'repo' hosts remain which run the older operating system version, which prevents older packages from being built.
ru: Если приспособить этот порядок, то на середине процесса потребуется восстановить некоторые файлы на хосте "репозитория" из резервной копии. Это будет необходимо, если не останется хостов "репозитория", на которых работает старая версия операционной системы, что не позволяет собирать старые пакеты.

source: If you have a Compute (nova) host that has a disk failure on a RAID-10, you can swap the failed disk without powering the host down. On the other hand, if the RAM has failed, you would have to power the host down. Having a plan in place for how you will manage these types of events is a vital part of maintaining your OpenStack environment.
ru: Если на вычислительном хосте (nova) произошел сбой диска в RAID-10, можно заменить сбойный диск, не отключая питание хоста. С другой стороны, если отказала оперативная память, придется отключить питание хоста. Наличие плана по управлению подобными событиями является важной частью поддержки окружения OpenStack.

source: If you have a multi-architecture deployment, then at least one 'repo' host of each architecture will need to be upgraded before upgrading any other hosts which use that architecture.
ru: Если у вас развертывание с несколькими архитектурами, то перед обновлением всех остальных узлов, использующих эту архитектуру, необходимо обновить как минимум один узел репозитория каждой архитектуры.

source: If you need to run a particular command against a subset of a group, you could use the limit flag ``-l``. For example, if a ``compute_hosts`` group contained ``compute1``, ``compute2``, ``compute3``, and ``compute4``, and you only needed to execute a command on ``compute1`` and ``compute4`` you could limit the command as follows:
ru: Если вам нужно выполнить определенную команду для подмножества группы, вы можете использовать флаг ограничения ``-l``. Например, если группа ``compute_hosts`` содержит ``compute1``, ``compute2``, ``compute3`` и ``compute4``, и вам нужно выполнить команду только для ``compute1`` и ``compute4``, вы можете ограничить команду следующим образом:

source: If you prefer not to run an ARA server, you can still generate local reports:
ru: Если вы предпочитаете не использовать сервер ARA, вы все равно можете создавать локальные отчеты:

source: If you remove the containers and data for the entire galera_server container group you will lose all your databases! Also, if you destroy the first container in many host groups you will lose other important items like certificates, keys, etc. Be sure that you understand what you're doing when using this tool.
ru: Если вы удалите контейнеры и данные для всей группы контейнеров galera_server, вы потеряете все свои базы данных! Кроме того, если удалить первый контейнер в большом количестве групп хостов, вы потеряете другие важные элементы, такие как сертификаты, ключи и т. д. Убедитесь, что вы понимаете, что делаете, когда используете этот инструмент.

source: If you start the nodes out of order, you could run into an issue where it thinks the current `master` should not be the master and drops the messages to ensure that no new messages are queued while the real master is down.
ru: Если вы запустите узлы в неправильном порядке, вы можете столкнуться с проблемой, когда узел посчитает, что текущий `главный` узел не должен быть главным, и сбросит сообщения, чтобы гарантировать, что новые сообщения не будут поставлены в очередь, пока настоящий главный узел не работает.

source: If you wish to minimise error states in HAProxy, services on hosts which are being reinstalled can be set in maintenance mode (MAINT).
ru: Если вы хотите минимизировать количество ошибок в HAProxy, службы на хостах, которые переустанавливаются, могут быть переведены в режим обслуживания (MAINT).

source: Image service
ru: Служба образов

source: Implement changes to OpenStack-Ansible configuration
ru: Внесите изменения в конфигурацию OpenStack-Ansible

source: In Ansible, a tag is a label you can assign to tasks, allowing you to run only the tasks you need instead of the whole playbook. This is especially handy in large playbooks — for example, if you have 20–30 tasks but just need to restart a service or make some changes in configuration, you can tag those tasks and run them individually.
ru: В Ansible тег — это метка, которую можно назначать задачам, позволяя запускать только нужные задачи, а не весь плейбук. Это особенно удобно в больших плейбуках — например, если у вас 20–30 задач, но вам нужно просто перезапустить службу или внести изменения в конфигурацию, вы можете пометить эти задачи тегами и запускать их по отдельности.

source: In CI we test upgrades between releases only for ``source`` deployments. This also includes CI testing of upgrade path between SLURP releases.
ru: В CI мы тестируем обновления между релизами только для ``исходных`` развертываний. Это также включает CI-тестирование пути обновления между релизами SLURP.

source: In ``/etc/openstack_deploy/user_variables.yml`` define extra service for MariaDB:
ru: В ``/etc/openstack_deploy/user_variables.yml`` определите дополнительную службу для MariaDB:

source: In a simple 3 infrastructure hosts setup, these services/containers usually end up being all on the the same host.
ru: При простой настройке с 3 хостами инфраструктуры эти службы/контейнеры обычно располагаются на одном хосте.

source: In all cases, secondary or backup instances should be upgraded first
ru: В любом случае сначала следует обновить вторичные или резервные инстансы

source: In case node is not getting synced you might need to restart the mariadb.service and verify everything is in order.
ru: Если узел не синхронизируется, возможно, вам нужно перезапустить службу mariadb.service и проверить, все ли в порядке.

source: In case you are the owner of quite modest hardware specs for controllers, you might pay more attention to option two (:ref:`scaling-osa-one`). This way you can offload your controllers by moving heavy applications, like MariaDB/RabbitMQ, to some other hardware that can also have relatively modest specs.
ru: Если у вас довольно скромные аппаратные характеристики управляющих (control) узлов, вам стоит обратить больше внимания на второй вариант (:ref:`scaling-osa-one`). Таким образом, вы сможете разгрузить управляющие (control) узлы, перенеся тяжелые приложения, такие как MariaDB/RabbitMQ, на другое оборудование, которое также может иметь относительно скромные характеристики.

source: In case you're relying on ``/etc/hosts`` content, you should also update it for all hosts:
ru: Если вы используете содержимое ``/etc/hosts``, вам также следует обновить его для всех хостов:

source: In case your deployment has grown to a point where RabbitMQ/MariaDB clusters can’t simply deal with the load these clusters create regardless of the hardware beneath them – you should use option one (:ref:`scaling-osa-one`) and make independent clusters per service.
ru: Если ваше развертывание выросло до такой степени, что кластеры RabbitMQ/MariaDB не могут просто справиться с нагрузкой, которую создают эти кластеры, независимо от аппаратного обеспечения, на котором они работают, вам следует использовать первый вариант (:ref:`scaling-osa-one`) и создать независимые кластеры для каждой службы.

source: In cases where the live migration fails, both the source and destination compute nodes need to be checked for errors. Usually it is sufficient to search for the instance UUID only to find errors related to the live migration.
ru: В случаях, когда живая миграция не удалась, необходимо проверить на наличие ошибок исходные и целевые вычислительные узлы. Обычно достаточно поискать только UUID инстанса, чтобы найти ошибки, связанные с живой миграцией.

source: In each of the role's respective documentatione you can find the default variables for the ports used within the scope of the role. Reviewing the documentation allow you to find the variable names if you want to use a different port.
ru: В документации каждой роли вы можете найти переменные по умолчанию для портов, используемых в рамках роли. Просмотр документации позволит вам найти имена переменных, если вы хотите использовать другой порт.

source: In file ``/etc/openstack_deploy/group_vars/galera.yml``:
ru: В файле ``/etc/openstack_deploy/group_vars/galera.yml``:

source: In file ``/etc/openstack_deploy/group_vars/neutron_galera.yml``:
ru: В файле ``/etc/openstack_deploy/group_vars/neutron_galera.yml``:

source: In file ``/etc/openstack_deploy/group_vars/neutron_rabbitmq.yml``:
ru: В файле ``/etc/openstack_deploy/group_vars/neutron_rabbitmq.yml``:

source: In file ``/etc/openstack_deploy/group_vars/rabbitmq.yml``
ru: В файле ``/etc/openstack_deploy/group_vars/rabbitmq.yml``

source: In larger deployments, it may take some time for the MariaDB daemon to start in the new container. It will be synchronizing data from the other MariaDB servers during this time. You can monitor the status during this process by tailing the ``journalctl -f -u mariadb`` log file.
ru: В более крупных развертываниях запуск демона MariaDB в новом контейнере может занять некоторое время. В это время он будет синхронизировать данные с других серверов MariaDB. Вы можете отслеживать состояние в ходе этого процесса, отслеживая файл журнала ``journalctl -f -u mariadb``.

source: In multi-region Object Storage utilizing separate database backends, objects are retrievable from an alternate location if the ``default_project_id`` for a user in the keystone database is the same across each database backend.
ru: В мультирегиональном объектном хранилище, использующем отдельные бэкенды баз данных, объекты можно получить из другого места, если ``default_project_id`` для пользователя в базе данных keystone одинаков в каждом бекенде.

source: In order to add an image using the Dashboard, prepare an image binary file, which must be accessible over HTTP using a valid and direct URL. Images can be compressed using ``.zip`` or ``.tar.gz``.
ru: Чтобы добавить образ с помощью панели управления, подготовьте бинарный файл образа, который должен быть доступен по HTTP с использованием действительного и прямого URL. Образы можно сжимать с помощью ``.zip`` или ``.tar.gz``.

source: In order to prevent role from making your primary Galera as UP in HAProxy, create an empty file ``/var/tmp/clustercheck.disabled`` . You can do this with ad-hoc:
ru: Чтобы предотвратить назначение основного сервера Galera в качестве включенного в HAProxy, создайте пустой файл ``/var/tmp/clustercheck.disabled``. Это можно сделать с помощью ad-hoc:

source: In order to speed up the migration, the following playbooks can be run to migrate either to or from Quorum Queues, whilst skipping package install and other configuration tasks. These tasks are available from the 2024.1 release onwards.
ru: Чтобы ускорить миграцию, можно запустить следующие плейбуки для миграции в или из Quorum Queues, пропуская установку пакетов и другие задачи конфигурации. Эти задачи доступны с релиза 2024.1 и далее.

source: In order to take advantage of these steps, we suggest setting `oslomsg_rabbit_quorum_queues` to ``false`` before upgrading to 2024.1. Then, once you have upgraded, set `oslomsg_rabbit_quorum_queues` back to the default of ``true`` and run the playbooks above.
ru: Чтобы воспользоваться этими шагами, мы рекомендуем установить `oslomsg_rabbit_quorum_queues` в значение ``false`` перед обновлением до версии 2024.1. Затем, после обновления, установите `oslomsg_rabbit_quorum_queues` обратно в значение по умолчанию ``true`` и запустите вышеуказанные плейбуки.

source: In order to upgrade Ceph in the deployment you will need to run:
ru: Чтобы обновить Ceph в развертывании, вам нужно выполнить команду:

source: In the 2024.1 (Caracal) release OpenStack-Ansible switches to use RabbitMQ Quorum Queues by default, rather than the legacy High Availability classic queues. Migration to Quorum Queues can be performed at upgrade time, but may result in extended control plane downtime as this requires all OpenStack services to be restarted with their new configuration.
ru: В релизе 2024.1 (Caracal) OpenStack-Ansible переходит на использование RabbitMQ Quorum Queues по умолчанию вместо устаревших классических очередей High Availability. Миграция на Quorum Queues может быть выполнена во время обновления, но может привести к длительному простою плоскости управления, поскольку это требует перезапуска всех служб OpenStack с новой конфигурацией.

source: In the :guilabel:`Launch Instance` dialog, click the :guilabel:`Flavor` tab and select the prefered flavor for you instance.
ru: В диалоговом окне :guilabel:`Запуск инстанса` перейдите во вкладку :guilabel:`Шаблон конфигурации` и выберите предпочтительный вариант для вашего инстанса.

source: In the Secondary Region, update the references to the ``project_id`` to match the ID from the Primary Region:
ru: Во вторичном регионе обновите ссылки на ``project_id``, чтобы они соответствовали ID из основного региона:

source: In the default configuration, Nova determines the correct transport URL for how to transfer the data from one host to the other. Depending on the ``nova_virt_type`` override the following configurations are used:
ru: В конфигурации по умолчанию Nova определяет правильный URL-адрес транспорта для передачи данных с одного хоста на другой. В зависимости от переопределения ``nova_virt_type`` используются следующие конфигурации:

source: In the example above we de-couple each service that is part of the `shared-infra_hosts` and define them separately, along with providing MariaDB its new destination host.
ru: В приведенном выше примере мы разделяем каждую службу, входящую в состав `shared-infra_hosts`, и определяем их отдельно, а также указываем MariaDB новый хост назначения.
