Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: ru

source: **Open vSwitch/OVN Example**:
ru: **Пример Open vSwitch/OVN**:

source: A Git repository that contains a copy of the source code that is used to prepare the packages for all OpenStack services
ru: Репозиторий Git, содержащий копию исходного кода, который используется для подготовки пакетов для всех служб OpenStack

source: A firewall must be used to restrict access to the network.
ru: Для ограничения доступа к сети необходимо использовать брандмауэр.

source: A git submodule pointed to a released tag.
ru: Подмодуль git указывающий на выпущенную метку.

source: A good example of how ``is_nest`` property can be used is describing Availability Zones. As when operating multiple AZs it's handy to define AZ-specific variables, like AZ name, for all hosts in this AZ. And leveraging ``group_vars`` is best way of ensuring that all hosts that belong to same AZ have same configuration applied.
ru: Хорошим примером использования свойства ``is_nest`` является описание зон доступности. Так как при работе с несколькими AZ удобно определять переменные, специфичные для AZ, например имя AZ, для всех хостов в этой AZ. А использование ``group_vars`` — лучший способ гарантировать, что все хосты, принадлежащие к одной AZ, будут иметь одну и ту же конфигурацию.

source: A group can contain child groups
ru: Группа может содержать дочерние группы.

source: A group can contain hosts
ru: Группа может содержать хосты

source: A host can be removed with the ``--remove-item/-r`` parameter.
ru: Хост можно удалить с помощью параметра ``--remove-item/-r``.

source: A host group can be removed with the ``--remove-group/-d`` parameter.
ru: Группу хостов можно удалить с помощью параметра ``--remove-group/-d``.

source: A list of all hosts can be seen with the ``--list-host/-l`` argument
ru: Список всех хостов можно просмотреть с помощью аргумента ``--list-host/-l``

source: A patch merged into a role is immediately tested by other role tests, ensuring that any major breaking change is caught. Once a minor/patch release is requested, the integrated build receives a 'SHA bump' patch to update the integrated build to using the latest available roles including that new patch. This new set is available for testing to anyone wanting to use the head of the stable branch, and is tested in periodic tests until the next release. In total, that means that the cycle time for a patch from merge to release is anywhere from two weeks to one month.
ru: Патч, объединенный с ролью, немедленно тестируется другими тестами ролей, гарантируя, что любые серьезные критические изменения будут обнаружены. После запроса на выпуск второстепенного/патч-релиза интегрированная сборка получает патч `SHA ​​bump` для обновления интегрированной сборки с использованием последних доступных ролей, включая этот новый патч. Этот новый набор доступен для тестирования всем, кто хочет использовать главу стабильной ветки, и тестируется в периодических тестах до следующего релиза. В общей сложности это означает, что время цикла для патча от слияния до релиза составляет от двух недель до одного месяца.

source: A script to automatically perform a git checkout of OpenStack-Ansible.
ru: Скрипт для автоматического выполнения проверки git OpenStack-Ansible.

source: A source based deployment, for Python-built parts of OpenStack, makes sense when dealing with scale and wanting consistency over long periods of time. A deployer should have the ability to deploy the same OpenStack release on every node throughout the life cycle of the cloud, even when some components are end of life. By providing a repository of the sources, the deployment can be re-created even years after the initial deployment, assuming the underlying operating systems and packages stay the same.
ru: Установка из исходных кодов для Python частей OpenStack имеет смысл при определенных масштабах, когда необходима согласованность на протяжении долгого времени. Оператор должен иметь возможность развернуть одну и ту же версию OpenStack на каждую ноду на протяжении всего жизненного цикла облака, даже когда некоторые компоненты достигли конца жизненного цикла. При помощи репозитория с исходным кодом, развертывание может быть воспроизведено даже спустя годы с момента начального развертывания, предполагая что операционные системы и пакеты останутся теми же.

source: A volume is created by the assigned ``cinder-volume`` service using the appropriate `cinder driver`_. The volume is created by using an API that is presented to the management network.
ru: Диск создается службой ``cinder-volume`` с использованием соответствующего `cinder driver`_. Диск создается с использованием API, который предоставляется в сети управления.

source: About OpenStack-Ansible
ru: Об OpenStack-Ansible

source: Add this network in ``cidr_networks``:
ru: Добавьте эту сеть в ``cidr_networks``:

source: Adding extra network to container
ru: Добавление дополнительной сети в контейнер

source: Adding extra python software
ru: Добавление дополнительного программного обеспечения Python

source: Adding gateway key will create default route inside container through it
ru: Добавление ключа шлюза создаст маршрут по умолчанию внутри контейнера через него

source: Adding new or overriding collections in your OpenStack-Ansible installation
ru: Добавление новых или переопределение коллекций в вашей установке OpenStack-Ansible

source: Adding new or overriding roles in your OpenStack-Ansible installation
ru: Добавление новых или переопределение ролей в вашей установке OpenStack-Ansible

source: Adding virtual nest groups
ru: Добавление вложенных виртуальных групп

source: Additional Resources
ru: Дополнительные ресурсы

source: Additional group mappings are located within files in the ``/etc/openstack_deploy/env.d/`` directory. These groups are treated as virtual mappings from the host groups (described above) onto the container groups, that define where each service deploys. By reviewing files within the ``env.d/`` directory, you can begin to see the nesting of groups represented in the default layout.
ru: Дополнительные сопоставления групп находятся в файлах в каталоге ``/etc/openstack_deploy/env.d/``. Эти группы рассматриваются как виртуальные сопоставления из групп хостов (описанных выше) на группы контейнеров, которые определяют, где развертывается каждая служба. Просматривая файлы в каталоге ``env.d/``, вы можете начать видеть вложенность групп, представленных в макете по умолчанию.

source: Additional lists of python packages can also be overridden using a ``user_.*.yml`` variable file.
ru: Дополнительные списки пакетов Python также можно переопределить с помощью файла переменных ``user_.*.yml``.

source: Additional services should be defined with a YAML file in ``/etc/openstack_deploy/conf.d``, in order to manage file size.
ru: Дополнительные службы следует определить с помощью файла YAML в ``/etc/openstack_deploy/conf.d``, чтобы управлять размером файла.

source: Additionally, the configuration or environment could be spread between two additional sub-directories:
ru: Кроме того, конфигурация или среда могут быть распределены между двумя дополнительными подкаталогами:

source: Adjust the :ref:`affinity` to 0 for the host group. Similar to the second option listed here, Unless you specify the component to run directly on a host by using the ``is_metal`` property, a container is created for this component.
ru: Измените :ref:`affinity` на 0 для группы хостов. Подобно второму варианту, указанному здесь, если вы не указали компонент для непосредственного запуска на хосте с помощью свойства ``is_metal``, для этого компонента создается контейнер.

source: Advanced configuration
ru: Расширенная конфигурация

source: Advanced inventory topics
ru: Расширенные параметры inventory

source: After the hypervisor is connected to the volume, it presents the volume as a local hardware device to the instance.
ru: После подключения гипервизора к диску он представляет диск как локальное аппаратное устройство для инстанса.

source: After the image is retrieved, the ``nova-compute`` service stores the image in its own image cache. When another instance is created with the same image, the image is retrieved from the local base image cache.
ru: После извлечения образа служба ``nova-compute`` сохраняет образ в своем собственном кэше образов. Когда создается другой инстанс с тем же образом, образ извлекается из локального базового кэша образов.

source: After the volume is created, the ``nova-compute`` service connects the Compute host hypervisor to the volume via the storage network.
ru: После создания диска служба ``nova-compute`` подключает гипервизор вычислительного узла к диску через сеть хранения данных.

source: Alike to roles, collections for installation are stored in `ansible-collection-requirements`_ file. Path to this file can be overriden through ``ANSIBLE_COLLECTION_FILE`` environmental variable.
ru: Подобно ролям, коллекции для установки хранятся в файле `ansible-collection-requirements`_. Путь к этому файлу можно переопределить через переменную окружения ``ANSIBLE_COLLECTION_FILE``.

source: All OpenStack services require an underlying database. MariaDB with Galera implements a multimaster database configuration, which simplifies its use as a highly available database with a simple failover model.
ru: Все службы OpenStack требуют наличия основной базы данных. MariaDB с Galera реализует конфигурацию базы данных с несколькими мастерами, что упрощает ее использование в качестве высокодоступной базы данных с простой моделью отказоустойчивости.

source: All default YAML file content is completely overwritten by the overrides, so the entire YAML source (both the existing content and your changes) must be provided.
ru: Все содержимое файла YAML по умолчанию полностью перезаписывается переопределениями, поэтому необходимо предоставить весь исходный файл YAML (как существующее содержимое, так и ваши изменения).

source: All of the services that use YAML, JSON, or INI for configuration can receive overrides through the use of a Ansible action plugin named ``config_template``. The configuration template engine allows a deployer to use a simple dictionary to modify or add items into configuration files at run time that may not have a preset template option. All OpenStack-Ansible roles allow for this functionality where applicable. Files available to receive overrides can be seen in the ``defaults/main.yml`` file as standard empty dictionaries (hashes).
ru: Все службы, использующие YAML, JSON или INI для конфигурации, могут получать переопределения с помощью плагина действия Ansible с именем ``config_template``. Механизм шаблонов конфигурации позволяет операторы использовать простой словарь для изменения или добавления элементов в файлы конфигурации во время выполнения, которые могут не иметь предустановленного шаблона. Все роли OpenStack-Ansible допускают эту функциональность, где это применимо. Файлы, доступные для получения переопределений, можно увидеть в файле ``defaults/main.yml`` как стандартные пустые словари (хэши).

source: All of these options can be specified in any way that suits your deployment. In terms of ease of use and flexibility it's recommended that you define your overrides in a user variable file such as ``/etc/openstack_deploy/user_variables.yml``.
ru: Все эти параметры можно указать любым способом, который подходит для вашего развертывания. С точки зрения простоты использования и гибкости рекомендуется назначать переопределения в файле пользовательских переменных, например ``/etc/openstack_deploy/user_variables.yml``.

source: All roles are built as Galaxy compatible roles even when the given role is not intended for standalone use. While the project will offer a lot of built-in roles the deployer will be able to pull down or override roles with external ones using the built-in Ansible capabilities. This allows extreme flexibility for deployers.
ru: Все роли построены как совместимые роли с Galaxy, даже если их отдельное использование не предусмотрено. В то время как проект предлагает множество встроенных ролей, оператор может добавить или переопределить роли внешними при помощи встроенных в Ansible возможностей. Это дает дополнительную гибкость для операторов.

source: All the design considerations (the container architecture, the ability to override any code, the network considerations, etc.) of this project are listed in our :ref:`architecture` reference.
ru: Все архитектурные соображения (архитектура контейнера, возможность переопределения любого кода, сетевые соображения и т. д.) этого проекта перечислены в нашем справочнике :ref:`architecture`.

source: All the userspace configurations are expected to be in ``/etc/openstack_deploy/``.
ru: Ожидается, что все конфигурации пользовательского пространства будут находиться в ``/etc/openstack_deploy/``.

source: Allows for network monitoring and alerting
ru: Позволяет осуществлять сетевой мониторинг и оповещение

source: Also note that copying files into directories such as ``env.d`` or ``conf.d`` should be handled via some sort of script within the extension project.
ru: Также обратите внимание, что копирование файлов в такие каталоги, как ``env.d`` или ``conf.d``, должно осуществляться с помощью какого-либо скрипта в проекте расширения.

source: An apt/yum proxy cache that is used to cache distribution packages installed in the environment
ru: Кэш-прокси apt/yum, который используется для кэширования пакетов дистрибутивов, установленных в среде

source: And here is the template file:
ru: А вот файл шаблона:

source: Ansible Resources
ru: Ресурсы Ansible

source: Ansible Usage
ru: Использование Ansible

source: Ansible configuration
ru: Конфигурация Ansible

source: Ansible is a simple yet powerful orchestration tool that is ideally equipped for deploying OpenStack-powered clouds. The declarative nature of Ansible allows the deployer to turn an entire deployment into a rather simple set of instructions.
ru: Ansible — это простой, но мощный инструмент оркестровки, который идеально подходит для развертывания облаков на базе OpenStack. Декларативная природа Ansible позволяет оператору превратить все развертывание в довольно простой набор инструкций.

source: Ansible provides an automation platform to simplify system and application deployment. Ansible manages systems by using Secure Shell (SSH) instead of unique protocols that require remote daemons or agents.
ru: Ansible предоставляет платформу автоматизации для упрощения развертывания систем и приложений. Ansible управляет системами, используя secure shell (SSH) вместо уникальных протоколов, требующих удаленных демонов или агентов.

source: Ansible roles
ru: Роли Ansible

source: Ansible roles fetching
ru: Извлечение ролей Ansible

source: Ansible uses playbooks written in the YAML language for orchestration. For more information, see `Ansible - Intro to Playbooks <https://docs.ansible.com/ansible/latest/user_guide/playbooks_intro.html>`_.
ru: Ansible использует плейбуки, написанные на языке YAML, для оркестровки. Для получения дополнительной информации см. `Ansible - Intro to Playbooks <https://docs.ansible.com/ansible/latest/user_guide/playbooks_intro.html>`_.

source: Any OpenStack cloud has sensitive information transmitted between services, including user credentials, service credentials or information about resources being created. Encrypting this traffic is critical in environments where the network cannot be trusted. (For more information about securing the network, see the :ref:`least-access-openstack-services` section.)
ru: Любое облако OpenStack имеет конфиденциальную информацию, передаваемую между службами, включая учетные данные пользователя, учетные данные службы или информацию о создаваемых ресурсах. Шифрование этого трафика имеет решающее значение в средах, где сеть не может быть доверенной. (Дополнительную информацию о защите сети см. в разделе :ref:`least-access-openstack-services`.)

source: Any changes to the containers must also be reflected in the deployment's load balancer.
ru: Любые изменения в контейнерах также должны быть отражены в балансировщике нагрузки развертывания.

source: Any roles defined in ``openstack-ansible/ansible-role-requirements.yml`` will be installed by the ``openstack-ansible/scripts/bootstrap-ansible.sh`` script, and fetched into the ansible roles folder.
ru: Все роли, определенные в ``openstack-ansible/ansible-role-requirements.yml``, будут установлены скриптом ``openstack-ansible/scripts/bootstrap-ansible.sh`` и загружены в папку ролей ansible.

source: Apply nondisruptively to a production OpenStack environment
ru: Применять без прерывания работы в рабочем окружении OpenStack

source: Architecture
ru: Архитектура

source: As a result you will get your openstack_user_config.json updated. You can use this method also to verify validity of the inventory.
ru: В результате вы получите обновленный openstack_user_config.json. Вы также можете использовать этот метод для проверки действительности inventory.

source: As an example, consider the following excerpt from ``openstack_user_config.yml``:
ru: В качестве примера рассмотрим следующий отрывок из ``openstack_user_config.yml``:

source: As part of the initial configuration, each target host appears either in the ``/etc/openstack_deploy/openstack_user_config.yml`` file or in files within the ``/etc/openstack_deploy/conf.d/`` directory. The format used for files in the ``conf.d/`` directory is identical to the syntax used in the ``openstack_user_config.yml`` file.
ru: В рамках начальной конфигурации каждый целевой хост появляется либо в файле ``/etc/openstack_deploy/openstack_user_config.yml``, либо в файлах в каталоге ``/etc/openstack_deploy/conf.d/``. Формат, используемый для файлов в каталоге ``conf.d/``, идентичен синтаксису, используемому в файле ``openstack_user_config.yml``.

source: Assign the ``db_containers`` container group (from the preceding step) to a host group by providing a ``physical_skel`` section for the host group in a new or existing file, such as ``env.d/galera.yml``. For example:
ru: Назначьте группу контейнеров ``db_containers`` (из предыдущего шага) группе хостов, предоставив раздел ``physical_skel`` для группы хостов в новом или существующем файле, например ``env.d/galera.yml``. Например:

source: Assigns containers to physical hosts
ru: Назначает контейнеры физическим хостам

source: At least one load balancer is required for a deployment. OpenStack-Ansible provides a deployment of `HAProxy`_, but we recommend using a physical load balancing appliance for production environments.
ru: Для развертывания требуется по крайней мере один балансировщик нагрузки. OpenStack-Ansible предоставляет развертывание `HAProxy`_, но мы рекомендуем использовать физическое устройство балансировки нагрузки для рабочих окружений.

source: Attach to a container:
ru: Присоединится к контейнеру:

source: Balance security with OpenStack performance and functionality
ru: Балансирование безопасности с производительностью и функциональностью OpenStack

source: Because of a `limitation with container iSCSI connectivity`_, you must deploy the ``cinder-volume`` service directly on a physical host (not into a container) when using storage back ends that connect via iSCSI. This includes the `LVMVolumeDriver`_ and many of the drivers for commercial storage devices.
ru: Из-за `ограничения с подключением контейнера iSCSI`_, необходимо развернуть службу ``cinder-volume`` непосредственно на физическом хосте (не в контейнере) при использовании бекэндов хранения, подключаемых через iSCSI. Сюда входит `LVMVolumeDriver`_ и многие драйверы для коммерческих устройств хранения.

source: Below as an example we will try using IB interfaces for storage network and pass them inside containers that require storage connectivity. For that you need describe connections in ``provider_networks`` inside `openstack_user_config.yml` configuration:
ru: Ниже в качестве примера мы попробуем использовать интерфейсы IB ​​для сети хранения данных и передать их внутрь контейнеров, которым требуется подключение к хранилищу. Для этого вам нужно описать соединения в ``provider_networks`` внутри конфигурации `openstack_user_config.yml`:

source: Block Storage (cinder)
ru: Блочное хранилище (cinder)

source: Bridges provide layer 2 connectivity (similar to physical switches) among physical, logical, and virtual network interfaces within a host. After a bridge/switch is created, the network interfaces are virtually plugged in to it.
ru: Мосты обеспечивают связь L2 (аналогично физическим коммутаторам) между физическими, логическими и виртуальными сетевыми интерфейсами в хосте. После создания моста/коммутатора сетевые интерфейсы виртуально подключаются к нему.

source: Bridges provide layer 2 connectivity (similar to switches) among physical, logical, and virtual network interfaces within a host. After a bridge/switch is created, the network interfaces are virtually plugged in to it.
ru: Мосты обеспечивают связь уровня L2 (аналогично коммутаторам) между физическими, логическими и виртуальными сетевыми интерфейсами в хосте. После создания моста/коммутатора сетевые интерфейсы виртуально подключаются к нему.

source: By default OpenStack-Ansible uses its `ansible-role-requirements`_ file to fetch the roles it requires for the installation process.
ru: По умолчанию OpenStack-Ansible использует свой файл `ansible-role-requirements`_ для получения ролей, необходимых для процесса установки.

source: By default, OpenStack-Ansible automatically applies the ansible-hardening role to all deployments. The role has been carefully designed to perform as follows:
ru: По умолчанию OpenStack-Ansible автоматически применяет роль ansible-hardening ко всем развертываниям. Роль была тщательно разработана для выполнения следующих действий:

source: By default, OpenStack-Ansible provides isolation by default between the containers that run the OpenStack infrastructure (control plane) services and also between the virtual machines that end users spawn within the deployment. This isolation is critical because it can prevent container or virtual machine breakouts, or at least reduce the damage that breakouts might cause.
ru: По умолчанию OpenStack-Ansible обеспечивает изоляцию по умолчанию между контейнерами, которые запускают службы инфраструктуры OpenStack (плоскость управления (control plane)), а также между виртуальными машинами, которые конечные пользователи создают в рамках развертывания. Эта изоляция имеет решающее значение, поскольку она может предотвратить утечки контейнеров или виртуальных машин или, по крайней мере, уменьшить ущерб, который могут нанести утечки.

source: Calling extra playbooks during the deployment
ru: Вызов дополнительных сценариев во время развертывания

source: Ceph Resources
ru: Ресурсы Ceph

source: Changing the base environment directory
ru: Изменение базового каталога среды

source: Checking inventory configuration for errors
ru: Проверка конфигурации inventory на наличие ошибок

source: Clearing existing container IP addresses
ru: Очистка существующих IP-адресов контейнеров

source: Command Line Reference
ru: Справочник по командной строке

source: Common OpenStack services and their configuration are defined by OpenStack-Ansible in the ``/etc/openstack_deploy/openstack_user_config.yml`` settings file.
ru: Общие службы OpenStack и их конфигурация определяются OpenStack-Ansible в файле настроек ``/etc/openstack_deploy/openstack_user_config.yml``.
