Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: ru

source: The services are further isolated via the use of LXC containers, but these are optional and a bare-metal-based installation is also possible.
ru: Службы дополнительно изолированы с помощью контейнеров LXC, но это необязательно, и возможна также установка на 'голое железо'.

source: The shared filesystem service (manila) can be configured to provide file systems on a variety of storage back ends as supported by the `manila_store drivers`_.
ru: Службу общей файловой системы (manila) можно настроить для предоставления файловых систем на различных внутренних хранилищах, поддерживаемых `manila_store drivers`_.

source: The simple nature of machine containers allows the deployer to treat containers as physical machines. The same concepts apply for machine containers and physical machines: This will allow deployers to use existing operational tool sets to troubleshoot issues within a deployment and the ability to revert an application or service within inventory to a known working state without having to re-kick a physical host.
ru: Простая природа контейнеров позволяет оператору расценивать контейнеры как виртуальные машины. Тот же концепт применим и к контейнерам и к виртуальным машинам: использование операторами существующего набора утилит для исследования проблем с развертыванием и возможность откатить приложение или сервис, находящийся в inventory, в рабочее состояние без необходимости переустановки физического хоста.

source: The system will allow you to install and build any package that is a python installable. The repository infrastructure will look for and create any git based or PyPi installable package. When the package is built the repo-build role will create the sources as Python wheels to extend the base system and requirements.
ru: Система позволит вам установить и собрать любой пакет, который является устанавливаемым на Python. Инфраструктура репозитория будет искать и создавать любой устанавливаемый пакет на основе git или PyPi. Когда пакет будет собран, роль repo-build создаст исходники как Python wheels для расширения базовой системы и требований.

source: The use of ``container_vars`` and mapping from container groups to host groups is the same for a service deployed directly onto the host.
ru: Использование ``container_vars`` и сопоставление групп контейнеров с группами хостов осуществляется одинаково для службы, развернутой непосредственно на хосте.

source: The use of containers allows for additional abstractions of entire application stacks to be run all within the same physical host machines.
ru: Использование контейнеров позволяет, благодаря дополнительной абстракции, использование целых стеков приложений на одном физическом хосте.

source: Then you can run a command to generate inventory using tox:
ru: Затем вы можете выполнить команду для создания inventory с помощью tox:

source: There is no ``ansible.cfg`` provided with OpenStack-Ansible. Environment variables are used to alter the default Ansible behavior if necessary.
ru: В OpenStack-Ansible не предусмотрен ``ansible.cfg``. Переменные среды используются для изменения поведения Ansible по умолчанию, если это необходимо.

source: These are the options available as found within the virtual module documentation section.
ru: Это доступные параметры, описанные в разделе документации виртуального модуля.

source: These policies are applied and governed at the kernel level. Any process that violates a policy is denied access to the resource. All denials are logged in ``auditd`` and are available at ``/var/log/audit/audit.log``.
ru: Эти политики применяются и управляются на уровне ядра. Любому процессу, нарушающему политику, отказывается в доступе к ресурсу. Все отказы регистрируются в ``auditd`` и доступны в ``/var/log/audit/audit.log``.

source: These services *must* be offered on a highly restricted network that is available only to administrative users.
ru: Эти службы *должны* предоставляться в строго ограниченной сети, доступной только административным пользователям.

source: These services include Compute (nova), Object Storage (swift), Networking (neutron), and Image (glance).
ru: К этим службам относятся вычислительная служба (nova), объектное хранилище (swift), сетевая служба (neutron) и служба образов (glance).

source: These services include MariaDB, Memcached, RabbitMQ, and the admin API endpoint for the Identity (keystone) service.
ru: К этим службам относятся MariaDB, Memcached, RabbitMQ и точка доступа API администратора для службы идентификации (keystone).

source: These services should be offered on a sufficiently restricted network that still allows all end users to access the services.
ru: Эти службы должны предоставляться в достаточно ограниченной сети, которая по-прежнему позволяет всем конечным пользователям получать к ним доступ.

source: These variables are typically internal to the role and are not designed to be overridden. However, deployers may choose to override them using extra-vars by placing the overrides into the user variables file.
ru: Эти переменные обычно являются внутренними для роли и не предназначены для переопределения. Однако разработчики могут переопределить их с помощью extra-vars, поместив переопределения в файл пользовательских переменных.

source: They can be overridden at multiple levels.
ru: Их можно переопределить на нескольких уровнях.

source: This JSON output has two top-level keys: ``hosts`` and ``all``.
ru: Этот вывод JSON имеет два ключа верхнего уровня: ``hosts`` и ``all``.

source: This also allows developers to point to their own code for their work.
ru: Это также позволяет операторам указать на их собственный код для своей работы.

source: This appendix describes how the interfaces are connected and how traffic flows.
ru: В этом приложении описывается, как подключены интерфейсы и как проходит трафик.

source: This chapter contains all the additional reference information needed to deploy, configure, or upgrade an OpenStack-Ansible cloud.
ru: В этой главе содержится вся дополнительная справочная информация, необходимая для развертывания, настройки или обновления облака OpenStack-Ansible.

source: This check does not do YAML syntax validation, though it will fail if there are unparseable errors.
ru: Эта проверка не выполняет проверку синтаксиса YAML, хотя и завершится неудачей в случае обнаружения не поддающихся анализу ошибок.

source: This configuration deploys a Memcached container and a database container on each host, but no RabbitMQ containers.
ru: В этой конфигурации на каждом хосте развертываются контейнер Memcached и контейнер базы данных, но не контейнеры RabbitMQ.

source: This does mean that a stable OpenStack-Ansible deployment will include a version of a service (e.g.: nova-17.0.3dev4) which does not match a tag exactly as you may expect (e.g.: nova-17.0.3).
ru: Это означает, что стабильное развертывание OpenStack-Ansible будет включать версию сервиса (например, nova-17.0.3dev4), которая не соответствует тегу в точности так, как вы могли бы ожидать (например, nova-17.0.3).

source: This file is in the same format as ``ansible-role-requirements.yml`` and can be used to add new roles or selectively override existing ones. New roles listed in ``user-role-requirements.yml`` will be merged with those in ``ansible-role-requirements.yml``, and roles with matching ``name`` key will override those in ``ansible-role-requirements.yml``. In case when ``src`` key is not defined bootstrap script will skip cloning such roles.
ru: Этот файл имеет тот же формат, что и ``ansible-role-requirements.yml``, и может использоваться для добавления новых ролей или выборочного переопределения существующих. Новые роли, перечисленные в ``user-role-requirements.yml``, будут объединены с ролями в ``ansible-role-requirements.yml``, а роли с соответствующим ключом ``name`` переопределят роли в ``ansible-role-requirements.yml``. В случае, если ключ ``src`` не определен, скрипт начальной загрузки пропустит клонирование таких ролей.

source: This flexibility enables deployers to choose how to deploy OpenStack in the appropriate way for the specific use case.
ru: OpenStack-Ansible имеет гибкую модель конфигурации развертывания, которая позволяет развертывать все службы в отдельных контейнерах машин или на назначенных хостах без использования контейнеров, а весь сетевой трафик — либо на одном сетевом интерфейсе, либо на нескольких сетевых интерфейсах.

source: This invocation is useful when testing changes to the dynamic inventory script.
ru: Этот вызов полезен при тестировании изменений в скрипте динамического inventory.

source: This means that OpenStack services and their python dependencies are built and installed from source code as found within the OpenStack Git repositories by default, but allow deployers to point to their own repositories.
ru: Это означает, что сервисы OpenStack и их python зависимости построены и установлены из исходных кодов, которые найдены в Git репозиториях OpenStack по умолчанию, но операторы также могут указать и собственные репозитории.

source: This means that there will never be a time where OpenStack specific packages, as provided by the distributions, are being used for OpenStack services. Third party repositories like *CloudArchive* and or *RDO* may still be required within a given deployment but only as a means to meet application dependencies.
ru: Это означает, что специфичные пакеты OpenStack, предоставляемые дистрибутивами, никогда не будут использоваться для сервисов OpenStack. Сторонние репозитории, такие как *CloudArchive* или *RDO* могут по прежнему быть необходимы для развертывания, но только для удовлетворения зависимостей приложений.

source: This module was not accepted into Ansible Core (see `PR1`_ and `PR2`_), and will never be.
ru: Этот модуль не был принят в Ansible Core (см. `PR1`_ и `PR2`_) и никогда не будет принят.

source: This project does **not** PXE boot hosts. Host setup and lifecycle management is left to the deployer. This project also requires that bridges are setup within the hosts to allow the containers to attach to a local bridge for network access. See also the :ref:`container-networking`.
ru: Этот проект **не** загружает хосты по PXE. Настройка хоста и управление жизненным циклом оставлены оператору. Этот проект также требует, чтобы мосты были настроены внутри хостов, чтобы позволить контейнерам подключаться к локальному мосту для сетевого доступа. См. также :ref:`container-networking`.

source: This project introduces containers as a means to abstract services from one another.
ru: Этот проект представляет контейнеры как средство абстракции сервисов друг от друга.

source: This project will be a **Batteries included** project. Which means deployer can expect that deploying from any of the named feature branches or tags should provide an OpenStack cloud built for production which will be available at the successful completion of the deployment.
ru: Этот проект будет проектом **Battery included**. Это означает, что оператор может ожидать, что развертывание из любой из названных функциональных ветвей или меток должно предоставить облако OpenStack, созданное для рабочего окружения, которое будет доступно после успешного завершения развертывания.

source: This section explains how ansible runs the inventory, and how you can run it manually to see its behavior.
ru: В этом разделе объясняется, как Ansible выполняет inventory и как можно запустить ее вручную, чтобы увидеть ее поведение.

source: This variable should point to ``/etc/ansible/plugins/library``. Doing so allows roles and playbooks to access OpenStack-Ansible's included Ansible modules.
ru: Эта переменная должна указывать на ``/etc/ansible/plugins/library``. Это позволяет ролям и плейбукам получать доступ к включенным в OpenStack-Ansible модулям Ansible.

source: This variable should point to ``/etc/ansible/roles`` by default. This allows Ansible to properly look up any OpenStack-Ansible roles that extension roles may reference.
ru: Эта переменная должна указывать на ``/etc/ansible/roles`` по умолчанию. Это позволяет Ansible правильно искать любые роли OpenStack-Ansible, на которые могут ссылаться роли расширения.

source: This variable should point to ``openstack-ansible/inventory/dynamic_inventory.py``. With this setting, extensions have access to the same dynamic inventory that OpenStack-Ansible uses.
ru: Эта переменная должна указывать на ``openstack-ansible/inventory/dynamic_inventory.py``. С этой настройкой расширения имеют доступ к тому же динамическому inventory, который использует OpenStack-Ansible.

source: This will *not* change the LXC configuration until the associated playbooks are run and the containers restarted, which will result in API downtime.
ru: Это *не* изменит конфигурацию LXC, пока не будут запущены соответствующие сценарии и перезапущены контейнеры, что приведет к простою API.

source: Three hosts are assigned to the ``shared-infra_hosts`` group, OpenStack-Ansible ensures that each host runs a single database container, a single Memcached container, and a single RabbitMQ container. Each host has an affinity of 1 by default, which means that each host runs one of each container type.
ru: Три хоста назначаются в группу ``shared-infra_hosts``, OpenStack-Ansible гарантирует, что каждый хост запускает один контейнер базы данных, один контейнер Memcached и один контейнер RabbitMQ. Каждый хост имеет значение affinity 1 по умолчанию, что означает, что каждый хост запускает один контейнер каждого типа.

source: Throughout the documentation we talk a lot about different environment variables that control behaviour of OpenStack-Ansible and Ansible iteself.
ru: В документации мы много говорим о различных переменных среды, которые управляют поведением OpenStack-Ansible и самого Ansible.

source: To add new interface with that network into dessignate containers, we need to do several actions in ``openstack_user_config.yml``.
ru: Чтобы добавить новый интерфейс с этой сетью в назначенные контейнеры, нам необходимо выполнить несколько действий в ``openstack_user_config.yml``.

source: To assist you in finding the appropriate variable name to use for overrides, the general format for the variable name is ``<service>_policy_overrides``.
ru: Чтобы помочь вам найти подходящее имя переменной для переопределений, общий формат имени переменной ``<service>_policy_overrides``.

source: To avoid extra configuration, a series of conventions are set into code.
ru: Чтобы избежать дополнительной настройки, в коде заложен ряд соглашений.

source: To completely override the ``ansible-role-requirement.yml`` file you can define the environment variable ``ANSIBLE_ROLE_FILE`` before running the ``bootstrap-ansible.sh`` script. With this approach it is now the responsibility of the deployer to maintain appropriate versions pins of the Ansible roles if an upgrade is required.
ru: Чтобы полностью переопределить файл ``ansible-role-requirement.yml``, вы можете определить переменную окружения ``ANSIBLE_ROLE_FILE`` перед запуском скрипта ``bootstrap-ansible.sh``. При таком подходе теперь ответственность за поддержку соответствующих версий ролей Ansible лежит на операторе, если требуется обновление.

source: To continue the example, the ``memcache.yml`` file defines the ``memcache_container`` container group. This group is a subset of the ``shared-infra_containers`` group, which is itself a subset of the ``all_containers`` inventory group.
ru: Продолжая пример, файл ``memcache.yml`` определяет группу контейнеров ``memcache_container``. Эта группа является подмножеством группы ``shared-infra_containers``, которая сама является подмножеством группы inventory ``all_containers``.

source: To customize the layout of the components for your deployment, modify the host groups and container groups appropriately before running the installation playbooks.
ru: Чтобы настроить компоновку компонентов для вашего развертывания, измените группы хостов и группы контейнеров соответствующим образом перед запуском установочных плейбуков.

source: To deploy a component directly on the host instead of within a container, set the ``is_metal`` property to ``true`` for the container group in the ``container_skel`` section in the appropriate file.
ru: Чтобы развернуть компонент непосредственно на хосте, а не в контейнере, установите свойство ``is_metal`` в значение ``true`` для группы контейнеров в разделе ``container_skel`` в соответствующем файле.

source: To deploy within containers on these dedicated hosts, omit the ``is_metal: true`` property.
ru: Для развертывания в контейнерах на этих выделенных хостах уберите свойство ``is_metal: true``.

source: To do this, you use the following configuration entry in the ``/etc/openstack_deploy/user_variables.yml`` file:
ru: Для этого используйте следующую запись конфигурации в файле ``/etc/openstack_deploy/user_variables.yml``:

source: To implement access controls that are different from the ones in a standard OpenStack environment, you can adjust the default policies applied by services. Policy files are in a ``JSON`` format.
ru: Для реализации контроля доступа, отличающегося от стандартного в среде OpenStack, можно настроить политики по умолчанию, применяемые службами. Файлы политик находятся в формате ``JSON``.

source: To learn more about how to customize the deployment of encrypted communications, see :ref:`Securing services with SSL certificates <security_settings>`.
ru: Дополнительную информацию о настройке развертывания зашифрованных соединений см. в разделе: :ref:`Защита служб с помощью SSL-сертификатов <security_settings>`.

source: To manage file size, we recommend that you define new inventory groups, particularly for new services, by using a new file in the ``conf.d/`` directory.
ru: Для управления размером файла мы рекомендуем вам определять новые группы inventory, особенно для новых служб, используя новый файл в каталоге ``conf.d/``.

source: To omit a component from a deployment, you can use one of several options:
ru: Чтобы исключить компонент из развертывания, можно воспользоваться одним из нескольких вариантов:

source: To override the upper constraints for a deployment, clone the OpenStack requirements git repository, either storing it as a fork at a URL of your choice, or within the local filesystem of the host you are using to deploy OpenStack Ansible from. Once cloned, switch to the branch which matches the name of your deployed OpenStack version, and modify the upper constraints as required.
ru: Чтобы переопределить ограничения версий пакетов для развертывания, клонируйте репозиторий git требований OpenStack, либо сохранив его как форк по URL-адресу по вашему выбору, либо в локальной файловой системе хоста, который вы используете для развертывания OpenStack Ansible. После клонирования переключитесь на ветку, которая соответствует имени вашей развернутой версии OpenStack, и измените ограничения по мере необходимости.

source: To see a listing of hosts and containers by their group, use ``--list-groups/-g``.
ru: Чтобы просмотреть список хостов и контейнеров по их группам, используйте ``--list-groups/-g``.

source: To see all of the containers, use ``--list-containers/-G``.
ru: Чтобы увидеть все контейнеры, используйте ``--list-containers/-G``.

source: To understand how the dynamic inventory works, see :ref:`inventory-in-depth`.
ru: Чтобы понять, как работает динамический inventory, см. :ref:`inventory-in-depth`.

source: Unbound DNS container
ru: Контейнер Unbound DNS

source: Understanding container groups (env.d structure)
ru: Понимание групп контейнеров (структура env.d)

source: Understanding host groups (conf.d structure)
ru: Понимание групп хостов (структура conf.d)

source: Understanding the inventory
ru: Понимание inventory

source: Use the groups's name as an argument. You can repeat argument multiple times to remove several groups at once.
ru: Используйте имя группы как аргумент. Вы можете повторить аргумент несколько раз, чтобы удалить несколько групп одновременно.

source: Use the host's name as an argument.
ru: Используйте имя хоста в качестве аргумента.

source: Use this method for any files with the ``INI`` format for in OpenStack projects deployed in OpenStack-Ansible.
ru: Используйте этот метод для любых файлов формата ``INI`` в проектах OpenStack, развернутых в OpenStack-Ansible.

source: Use this method for any files with the ``JSON`` format in OpenStack projects deployed in OpenStack-Ansible.
ru: Используйте этот метод для любых файлов формата ``JSON`` в проектах OpenStack, развернутых в OpenStack-Ansible.

source: User variables
ru: Пользовательские переменные

source: Userspace configurations
ru: Конфигурации пользовательского пространства

source: Uses OpenStack defaults for each of the project roles, and provides extra wiring and optimized configuration when combining projects together.
ru: Использует значения OpenStack по умолчанию для каждой роли проекта и обеспечивает дополнительную соединение и оптимизированную конфигурацию при объединении проектов.

source: Using SR-IOV interfaces in containers
ru: Использование интерфейсов SR-IOV в контейнерах

source: Using ``shared-infra_hosts`` as an example, consider this ``openstack_user_config.yml`` configuration:
ru: Используя ``shared-infra_hosts`` в качестве примера, рассмотрим следующую конфигурацию ``openstack_user_config.yml``:

source: Using the ``--check`` flag when running ``openstack-ansible-inventory`` will run the inventory build process and look for known errors, but not write any files to disk.
ru: Использование флага ``--check`` при запуске ``openstack-ansible-inventory`` запустит процесс создания inventory и выполнит поиск известных ошибок, но не запишет какие-либо файлы на диск.

source: Using these extension points, deployers can provide a more 'opinionated' installation of OpenStack that may include their own software.
ru: Используя эти точки расширения, операторы могут обеспечить более 'персонализированную' установку OpenStack, которая может включать их собственное программное обеспечение.

source: Using this name for a group in the configuration will result in a runtime error.
ru: Использование этого имени для группы в конфигурации приведет к ошибке выполнения.

source: Utility container
ru: Контейнер утилит

source: Variable precedence
ru: Переменный приоритет

source: Viewing the inventory
ru: Просмотр inventory

source: We believe that this approach brings a balance of both reasonable stability, while still being able to do pro-active backports.
ru: Мы считаем, что такой подход обеспечивает баланс между разумной стабильностью и возможностью выполнения упреждающих бэкпортов.

source: What is the OpenStack-Ansible release model?
ru: Какова модель выпуска OpenStack-Ansible?

source: What version of OpenStack is deployed by OpenStack-Ansible?
ru: Какую версию OpenStack использует OpenStack-Ansible?

source: When **not** to choose OpenStack-Ansible?
ru: Когда **не** следует выбирать OpenStack-Ansible?

source: When OpenStack-Ansible generates its dynamic inventory, the affinity setting determines how many containers of a similar type are deployed on a single physical host.
ru: Когда OpenStack-Ansible генерирует свой динамический inventory, настройка соответствия определяет, сколько контейнеров аналогичного типа развернуто на одном физическом хосте.
