Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: ru

source: To add the third RabbitMQ node to the cluster, repeat the above process by stopping the RabbitMQ application on the third node.
ru: Чтобы добавить третий узел RabbitMQ в кластер, повторите описанный выше процесс, остановив приложение RabbitMQ на третьем узле.

source: To allow live migration of Nova instances, this forced provisioning of the config (CD-ROM) drive needs to either be turned off, or the format of the configuration drive needs to be changed to a disk format like vfat, a format which both Linux and Windows instances can access.
ru: Чтобы разрешить живую миграцию инстансов Nova, необходимо либо отключить принудительное включение привода (CD-ROM), либо изменить формат привода на формат диска, например vfat, к которому могут получить доступ как инстансы Linux, так и Windows.

source: To avoid issues and simplify troubleshooting during the upgrade, disable the security hardening role by setting the ``apply_security_hardening`` variable to ``False`` in the :file:`user_variables.yml` file, and backup your OpenStack-Ansible installation.
ru: Чтобы избежать проблем и упростить поиск неисправностей во время обновления, отключите роль усиления безопасности, установив переменную ``apply_security_hardening`` в значение ``False`` в файле :file:`user_variables.yml`, и создайте резервную копию вашей установки OpenStack-Ansible.

source: To change the path, override it in the deployment configuration file:
ru: Чтобы изменить путь, переопределите его в файле конфигурации развертывания:

source: To check on the status of your Galera cluster:
ru: Чтобы проверить состояние вашего кластера Galera:

source: To check that the instance was created successfully, issue the **openstack server list** command:
ru: Чтобы проверить, что инстанс был успешно создан, выполните команду **openstack server list**:

source: To check that verify MariaDB cluster status by executing from host running primary MariaDB following command:
ru: Чтобы проверить состояние кластера MariaDB, выполните с хоста, на котором запущена основная MariaDB, следующую команду:

source: To clear facts for a single host, find its file within ``/etc/openstack_deploy/ansible_facts/`` and remove it. Each host has a JSON file that is named after its hostname. The facts for that host will be regenerated on the next playbook run.
ru: Чтобы очистить факты для отдельного хоста, найдите его файл в файле ``/etc/openstack_deploy/ansible_facts/`` и удалите его. Каждый хост имеет JSON-файл, названный по имени хоста. Факты для этого хоста будут восстановлены при следующем запуске плейбука.

source: To configure such a layout and migrate Neutron using it with OpenStack-Ansible you need to follow these steps:
ru: Чтобы настроить такую конфигурацию и перенести Neutron с ее использованием с помощью OpenStack-Ansible, необходимо выполнить следующие действия:

source: To create the containers again, execute the following:
ru: Чтобы снова создать контейнеры, выполните следующее:

source: To destroy a container, execute the following:
ru: Чтобы удалить контейнер, выполните следующие действия:

source: To dump traffic on the ``br-mgmt`` bridge, use ``tcpdump`` to see all communications between the various containers. To narrow the focus, run ``tcpdump`` only on the desired network interface of the containers.
ru: Чтобы просмотреть трафик на мосту ``br-mgmt``, используйте ``tcpdump``, чтобы увидеть все соединения между различными контейнерами. Чтобы сузить фокус, запустите ``tcpdump`` только на нужном сетевом интерфейсе контейнеров.

source: To ensure that there is no currently set ANSIBLE_INVENTORY to override the default inventory location, we unset the environment variable.
ru: Чтобы убедиться, что в данный момент нет установленной ANSIBLE_INVENTORY, которая бы переопределяла местоположение inventory по умолчанию, мы отменяем настройку переменной окружения.

source: To filter the list, the options ``--host`` or ``--status`` can be used:
ru: Для фильтрации списка можно использовать параметры ``--host`` или ``--status``:

source: To form a RabbitMQ Cluster, you start by taking independent RabbitMQ brokers and re-configuring these nodes into a cluster configuration.
ru: Чтобы сформировать кластер RabbitMQ, вы начинаете с того, что берете независимых брокеров RabbitMQ и перенастраиваете эти узлы в конфигурацию кластера.

source: To improve performance, particularly in large deployments, you can cache host facts and information.
ru: Для повышения производительности, особенно в больших развертываниях, можно кэшировать факты и информацию о хосте.

source: To prepare new hosts and deploy containers on them run ``setup-hosts.yml``: playbook with the ``limit`` argument.
ru: Чтобы подготовить новые хосты и развернуть на них контейнеры, запустите плейбук ``setup-hosts.yml``: с аргументом ``limit``.

source: To prune the inventory archive selectively, first identify the files you wish to remove by listing them out.
ru: Чтобы выборочно очистить архив inventory, сначала определите файлы, которые вы хотите удалить, перечислив их.

source: To restore the ``/etc/openstack_deploy/`` directory, copy the backup of the directory to your cloud environment.
ru: Чтобы восстановить каталог ``/etc/openstack_deploy/``, скопируйте резервную копию каталога в свое облачное окружение.

source: To see which hosts a playbook runs against, and to see which tasks are performed, run the following commands (for example):
ru: Чтобы узнать, на каких хостах запускается плейбук и какие задачи выполняются, выполните следующие команды (например):

source: To see which hosts belong to which groups, use the ``openstack-ansible-inventory-manage`` script to show all groups and their hosts. For example:
ru: Чтобы увидеть, какие хосты принадлежат к тем или иным группам, используйте скрипт ``openstack-ansible-inventory-manage``, чтобы показать все группы и их хосты. Например:

source: To stop and start the cluster, keep in mind the order in which you shut the nodes down. The last node you stop, needs to be the first node you start. This node is the `master`.
ru: Чтобы остановить и запустить кластер, помните о порядке, в котором вы отключаете узлы. Последний узел, который вы останавливаете, должен быть первым узлом, который вы запускаете. Этот узел является `master`.

source: To troubleshoot problems or errors with the Image service, refer to :file:`/var/log/glance-api.log` inside the glance api container.
ru: Чтобы устранить проблемы или ошибки в работе службы образов, обратитесь к :file:`/var/log/glance-api.log` внутри контейнера glance api.

source: To turn off the forced provisioning of and change the format of the configuration drive to a hard disk style format, add the following override to the ``/etc/openstack_deploy/user_variables.yml`` file:
ru: Чтобы отключить принудительное включение и изменить формат привода на формат жесткого диска, добавьте следующее переопределение в файл ``/etc/openstack_deploy/user_variables.yml``:

source: To update only a single Compute host, run the following command:
ru: Чтобы обновить только один вычислительный узел, выполните следующую команду:

source: To upgrade from |previous_release_formal_name| |previous_slurp_name| to |current_release_formal_name| by using the upgrade script, perform the following steps in the ``openstack-ansible`` directory:
ru: Для обновления с |previous_release_formal_name| |previous_slurp_name| до |current_release_formal_name| с помощью скрипта обновления выполните следующие действия в каталоге ``openstack-ansible``:

source: To view the locations of important RabbitMQ files, see `File Locations <https://www.rabbitmq.com/relocate.html>`_.
ru: Чтобы просмотреть расположение важных файлов RabbitMQ, см. раздел `Расположение файлов <https://www.rabbitmq.com/relocate.html>`_.

source: Troubleshooting
ru: Устранение неполадок

source: Troubleshooting host-to-host traffic on CONTAINER_NET
ru: Устранение проблем с трафиком между хостами на CONTAINER_NET

source: Troubleshooting host-to-host traffic on HOST_NET
ru: Устранение проблем с трафиком между хостами в HOST_NET

source: Troubleshooting host-to-host traffic on OVERLAY_NET
ru: Устранение проблем с трафиком между хостами в OVERLAY_NET

source: Troubleshooting instance connectivity issues
ru: Устранение проблем с подключением инстансов

source: Tunneling versus direct transport
ru: Туннелирование и прямое соединение

source: Ubuntu kernel packages newer than version 3.13 contain a change in module naming from ``nf_conntrack`` to ``br_netfilter``. After upgrading the kernel, run the ``openstack-hosts-setup.yml`` playbook against those hosts. For more information, see `OSA bug 157996 <https://bugs.launchpad.net/openstack-ansible/+bug/1579963>`_.
ru: Пакеты ядра Ubuntu новее версии 3.13 содержат изменение в названии модуля с ``nf_conntrack`` на ``br_netfilter``. После обновления ядра запустите плейбук ``openstack-hosts-setup.yml`` на этих хостах. Дополнительную информацию см. в статье `Ошибка OSA 157996 <https://bugs.launchpad.net/openstack-ansible/+bug/1579963>`_.

source: Unassign all Neutron floating IPs:
ru: Отвяжите все плавающие IP-адреса Neutron:

source: Under some circumstances, configuration or temporary issues, one specific or all neutron agents container need to be restarted.
ru: При некоторых обстоятельствах, проблемах с конфигурацией или временных проблемах может потребоваться перезапуск одного или всех контейнеров с агентами neutron.

source: Unless overridden, the first host in the group is considered as a “bootstrap” one. This bootstrap host should be migrated last to avoid unnecessary failovers, so it is recommended to start the migration of hosts to the new hardware from the last one to the first one in the output.
ru: Если не указано иное, первый хост в группе считается "загрузочным". Этот загрузочный хост следует переносить последним, чтобы избежать ненужных переключений, поэтому рекомендуется начинать перенос хостов на новое оборудование с последнего по списку в выводе.

source: Update all OpenStack services:
ru: Обновите все службы OpenStack:

source: Update all the dependent roles to the latest version:
ru: Обновите все зависимые роли до последней версии:

source: Update the container number listed under the ``affinity`` configuration to the desired number. The above example has ``galera_container`` set at one and ``rabbit_mq_container`` at two, which scales RabbitMQ services, but leaves Galera services fixed.
ru: Обновите номер контейнера, указанный в конфигурации ``affinity``, до желаемого числа. В приведенном выше примере ``galera_container`` установлен на один, а ``rabbit_mq_container`` на два, что масштабирует службы RabbitMQ, но оставляет службы Galera в текущем состоянии.

source: Update the hosts:
ru: Обновите хосты:

source: Update the infrastructure:
ru: Обновите инфраструктуру:

source: Updating the node with the new configuration
ru: Обновление узла с новой конфигурацией

source: Upgrade Ceph
ru: Обновление Ceph

source: Upgrade OpenStack
ru: Обновление OpenStack

source: Upgrade hosts
ru: Обновление хостов

source: Upgrade infrastructure
ru: Обновление инфраструктуры

source: Upgrade specific components
ru: Обновление определенных компонентов

source: Upgrades between minor versions of OpenStack-Ansible require updating the repository clone to the latest minor release tag, updating the Ansible roles, and then running playbooks against the target hosts. This section provides instructions for those tasks.
ru: Обновление OpenStack-Ansible между младшими версиями требует обновления клона репозитория до последней версии, обновления ролей Ansible, а затем запуска плейбука на целевых узлах. В этом разделе приведены инструкции по выполнению этих задач.

source: Upgrades should be performed in the order specified in this guide to minimise the risk of service interruptions. Upgrades must also be carried out by performing a fresh installation of the target system's operating system, before running OpenStack-Ansible to install services on this host.
ru: Обновления следует выполнять в порядке, указанном в данном руководстве, чтобы свести к минимуму риск прерывания обслуживания. Обновления также должны выполняться путем свежей установки операционной системы целевой системы, прежде чем запускать OpenStack-Ansible для установки служб на этот хост.

source: Upgrading a specific component within the same OpenStack-Ansible version
ru: Обновление определенного компонента в пределах одной версии OpenStack-Ansible

source: Upgrading by using a script
ru: Обновление с помощью скрипта

source: Upgrading manually
ru: Обновление вручную

source: Upload an image to test whether the image is registering and writing to the image store.
ru: Загрузите образ, чтобы проверить, регистрируется ли он и записывается ли в хранилище образов.

source: Uploading images using the Dashboard will be available to users with administrator privileges. Operators can set user access privileges.
ru: Загрузка образов с помощью панели управления будет доступна пользователям с правами администратора. Операторы могут устанавливать права доступа пользователей.

source: Usage of non-trusted certificates for RabbitMQ is not possible due to requirements of newer ``amqp`` versions.
ru: Использование недоверенных сертификатов для RabbitMQ невозможно из-за требований более новых версий ``amqp``.

source: Use SSH to connect to the Compute host.
ru: Используйте SSH для подключения к вычислительному узлу.

source: Use the OpenStack client within the utility container to manage all glance images. `See the OpenStack client official documentation on managing images <https://docs.openstack.org/image-guide/create-images-manually.html>`_.
ru: Используйте клиент OpenStack в контейнере утилит для управления всеми образами glance. `См. официальную документацию клиента OpenStack по управлению образами <https://docs.openstack.org/image-guide/create-images-manually.html>`_.

source: Use the command line clients
ru: Использование консольных клиентов

source: Use the following procedure to add a compute host to an operational cluster.
ru: Для добавления вычислительного узла в рабочий кластер используйте следующую процедуру.

source: Useful network utilities and commands:
ru: Полезные сетевые утилиты и команды:

source: Using Ansible tags
ru: Использование тегов Ansible

source: Using a 3 node example, you would be telling nodes 2 and 3 to join the cluster of the first node.
ru: Используя пример с тремя узлами, вы сообщаете узлам 2 и 3 о необходимости присоединиться к кластеру первого узла.

source: Using an image, create a new instance via the Dashboard options.
ru: Используя образ, создайте новый инстанс с помощью возможностей панели управления.

source: Using tags
ru: Использование тегов

source: Verify OpenStack-Ansible cloud
ru: Проверка облака OpenStack-Ansible

source: Verify cluster status
ru: Проверка статуса кластера

source: Verify the instances are shutdown:
ru: Убедитесь, что инстансы выключены:

source: Verify the services on the host are reconnected to the environment:
ru: Убедитесь, что службы на хосте снова подключены к окружению:

source: View the instance console log
ru: Просмотреть лог консоли инстанса

source: Volumes attach to instances, enabling persistent storage. Volume storage provides a source of memory for instances. Administrators can attach volumes to a running instance, or move a volume from one instance to another.
ru: Диски присоединяются к инстансам, ​​обеспечивая постоянное хранение. Хранилище дисков обеспечивает источник памяти для инстансов. Администраторы могут присоединять диски к работающему инстансу или перемещать диск от одного инстанса к другому.

source: Warnings
ru: Предупреждения

source: Watch out when you restart the node, it will still think it is part of the cluster and will require you to reset the node. After resetting, you should be able to rejoin it to other nodes as needed.
ru: Будьте осторожны, когда вы перезапускаете узел, он все еще будет считать себя частью кластера и потребует от вас сброса узла. После сброса вы сможете при необходимости снова присоединить его к другим узлам.

source: We can move on to RabbitMQ primary
ru: Мы можем перейти к основному RabbitMQ

source: We can now go ahead with the upgrade of all the OpenStack components.
ru: Теперь мы можем приступить к обновлению всех компонентов OpenStack.

source: We can now go ahead with the upgrade of all the infrastructure components. To ensure that RabbitMQ and MariaDB are upgraded, we pass the appropriate flags.
ru: Теперь мы можем приступить к обновлению всех компонентов инфраструктуры. Чтобы убедиться, что RabbitMQ и MariaDB будут обновлены, мы передадим соответствующие флаги.

source: We can verify the version of the service before and after the upgrade (don't forget to load required environment variables):
ru: Мы можем проверить версию службы до и после обновления (не забудьте загрузить необходимые переменные среды):

source: We forget it by running these commands on another RabbitMQ host.
ru: Мы забудем об этом, выполнив эти команды на другом хосте RabbitMQ.

source: We forget it by running these commands on another repo host. Note that we have to tell Gluster we are intentionally reducing the number of replicas. 'N' should be set to the number of repo servers minus 1. Existing gluster peer names can be found using the 'gluster peer status' command.
ru: Мы забываем об этом, выполняя эти команды на другом хосте репозитория. Обратите внимание, что нам нужно сообщить Gluster, что мы намеренно уменьшаем количество реплик. 'N' должно быть равно количеству серверов "репозитория" минус 1. Имена существующих пиров Gluster можно узнать с помощью команды 'gluster peer status'.

source: We run it as follows:
ru: Мы запускаем его следующим образом:

source: What is the destination address of the traffic?
ru: Каков адрес назначения трафика?

source: What is the project network type?
ru: Какой тип сети проекта?

source: What is the source address of the traffic?
ru: Каков адрес источника трафика?

source: What type of node am I replacing hardware on?
ru: На каком типе узла я заменяю оборудование?

source: When a module is being used as an ad-hoc command, there are a few parameters that are not required. For example, for the ``chdir`` command, there is no need to :command:`chdir=/home/user ls` when running Ansible from the CLI:
ru: Когда модуль используется как команда ad-hoc, есть несколько параметров, которые не требуются. Например, для команды ``chdir`` нет необходимости в :command:`chdir=/home/user ls` при запуске Ansible из CLI:

source: When all but one node fails, the remaining node cannot achieve quorum and stops processing SQL requests. In this situation, failed nodes that recover cannot join the cluster because it no longer exists.
ru: Когда все узлы, кроме одного, выходят из строя, оставшийся узел не может достичь кворума и прекращает обработку SQL-запросов. В этой ситуации отказавшие узлы, которые восстанавливаются, не могут присоединиться к кластеру, поскольку он больше не существует.

source: When increasing the number of Ansible forks in, particularly beyond 10, SSH connection issues can arise due to the default sshd setting MaxStartups 10:30:100. This setting limits the number of simultaneous unauthenticated SSH connections to 10, after which new connection attempts start getting dropped probabilistically — with a 30% chance initially, increasing linearly up to 100% as the number of connections approaches 100.
ru: При увеличении количества форков Ansible, особенно свыше 10, могут возникнуть проблемы с подключением SSH из-за sshd параметра по умолчанию MaxStartups 10:30:100. Эта настройка ограничивает количество одновременных неаутентифицированных подключений SSH до 10, после чего новые попытки подключения начинают сбрасываться — с вероятностью 30% изначально, линейно увеличиваясь до 100% по мере приближения количества подключений к 100.

source: When taking down 'memcached' instances for upgrades you may encounter performance issues with the APIs.
ru: Когда инстансы 'memcached' будут выключены для обновления, вы можете столкнуться с проблемами производительности API.

source: When the entire cluster is brought down, the last node to go down must be the first node to be brought online. If this does not happen, the nodes will wait 30 seconds for the last disc node to come back online, and fail afterwards.
ru: Когда весь кластер выведен из строя, последний вышедший из строя узел должен быть первым узлом, который будет включен в сеть. Если этого не произойдет, узлы будут ждать 30 секунд, пока последний дисковый узел не вернется в сеть, и затем выйдут из строя.

source: Where <service> is a service name, like neutron, nova, cinder, etc. Another way around would be to fire up setup-openstack.yml but it will take quite some time to execute.
ru: Где <service> — это название службы, например, neutron, nova, cinder и т. д.. Другой способ — запустить файл setup-openstack.yml, но его выполнение займет довольно много времени.

source: Which compute node is hosting the VM in question?
ru: На каком вычислительном узле находится рассматриваемая ВМ?

source: Which interface is used for VXLAN overlay?
ru: Какой интерфейс используется для VXLAN?

source: Which interface is used for provider network traffic?
ru: Какой интерфейс используется для сетевого трафика провайдера?

source: Which network node (container) is the router hosted?
ru: На каком сетевом узле (контейнере) размещен маршрутизатор?

source: While it’s quite straightforward to establish the architecture above from the very beginning of the deployment, flawless migration of the existing deployment to such a setup is more tricky, as you need to migrate running clusters to the new hardware. Since we will be performing moves one-by-one, to preserve at least two active cluster members, the steps below should be repeated for the other two members.
ru: Хотя создать вышеуказанную архитектуру с самого начала развертывания довольно просто, безупречная миграция существующего развертывания на такую конфигурацию является более сложной задачей, поскольку необходимо перенести работающие кластеры на новое оборудование. Поскольку мы будем выполнять перенос по одному, чтобы сохранить как минимум два активных участника кластера, приведенные ниже шаги необходимо повторить для двух других участников.

source: While it’s relatively easy to start using the new RabbitMQ cluster for the service, migration of the database is slightly tricky and will include some downtime.
ru: Хотя использовать новый кластер RabbitMQ для службы относительно просто, миграция базы данных является более сложной задачей и потребует некоторого времени простоя.

source: While three infrastructure hosts are recommended, if further hosts are needed in an environment, it is possible to create additional nodes.
ru: Хотя рекомендуется использовать три хоста инфраструктуры, если в среде потребуется больше хостов, можно создать дополнительные узлы.

source: While troubleshooting, if you notice one node is refusing to join the cluster, it is definitely worth checking if the erlang cookie matches the other nodes. When the cookie is misconfigured (for example, not identical), RabbitMQ will log errors such as "Connection attempt from disallowed node" and "Could not auto-cluster". See `clustering <https://www.rabbitmq.com/clustering.html>`_ for more information.
ru: Если при устранении неполадок вы заметили, что один узел отказывается присоединяться к кластеру, определенно стоит проверить, соответствует ли куки-файл erlang другим узлам. Если куки-файл настроен неправильно (например, не идентичен), RabbitMQ будет регистрировать ошибки, такие как "Попытка подключения с запрещенного узла" и "Не удалось выполнить автокластеризацию". Подробнее см. в разделе `кластеризация <https://www.rabbitmq.com/clustering.html>`_.
