Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: ru

source: With Ansible, the OpenStack installation process is entirely automated using playbooks written in YAML. After installation, the settings configured by the playbooks can be changed and modified. Services and containers can shift to accommodate certain environment requirements. Scaling services are achieved by adjusting services within containers, or adding new deployment groups. It is also possible to destroy containers, if needed, after changes and modifications are complete.
ru: С Ansible процесс установки OpenStack полностью автоматизирован с использованием плейбуков, написанных на YAML. После завершения установки, настройки, сделанные плейбуками, можно изменять и модифицировать. Службы и контейнеры могут изменяться для соответствия определенным требованиям среды. Масштабирование сервисов достигается путем настройки сервисов в контейнерах или добавления новых групп развертывания. Также можно удалять контейнеры, если это необходимо, после завершения изменений и модификаций.

source: With a web browser, access the Dashboard using the external load balancer domain name or IP address. This is defined by the ``external_lb_vip_address`` option in the ``/etc/openstack_deploy/openstack_user_config.yml`` file. The dashboard uses HTTPS on port 443.
ru: С помощью веб-браузера войдите в панель управления, используя доменное имя или IP-адрес внешнего балансировщика нагрузки. Это определяется параметром ``external_lb_vip_address`` в файле ``/etc/openstack_deploy/openstack_user_config.yml``. Панель управления использует HTTPS на порту 443.

source: With each OpenStack-Ansible version we define default Ceph client version that will be installed on Glance/Cinder/Nova hosts and used by these services. If you want to preserve the previous version of the ceph client during an OpenStack-Ansible upgrade, you will need to override a variable ``ceph_stable_release`` in your user_variables.yml
ru: В каждой версии OpenStack-Ansible мы определяем версию клиента Ceph по умолчанию, которая будет установлена на хостах Glance/Cinder/Nova и использоваться этими службами. Если вы хотите сохранить предыдущую версию клиента Сeph при обновлении OpenStack-Ansible, вам нужно переопределить переменную ``ceph_stable_release`` в файле ``user_variables.yml``

source: With this approach, you might provide the most loaded services, like Nova or Neutron, their standalone MariaDB and RabbitMQ clusters. These new clusters might reside on a separate hardware.
ru: При таком подходе вы можете предоставить наиболее загруженным службам, таким как Nova или Neutron, отдельные кластеры MariaDB и RabbitMQ. Эти новые кластеры могут находиться на отдельном оборудовании.

source: With this complete, we can now restart the MariaDB containers one at a time, ensuring that each is started, responding, and synchronized with the other nodes in the cluster before moving on to the next steps. This step allows the LXC container configuration that you applied earlier to take effect, ensuring that the containers are restarted in a controlled fashion.
ru: Теперь мы можем перезапустить контейнеры MariaDB по одному, убедившись, что каждый из них запущен, отвечает и синхронизирован с другими узлами кластера, прежде чем переходить к следующим шагам. Этот шаг позволит вступить в силу конфигурации контейнеров LXC, которые вы применили ранее, обеспечивая контролируемый перезапуск контейнеров.

source: With upgrade to 2024.2 (Dalmatian) release and beyond, usage of RabbitMQ Quorum Queues is mandatory to ensure high availability of queues. If you had previously set ``oslomsg_rabbit_quorum_queues: false``, please consider migrating before continuing with this upgrade which uses RabbitMQ 4.x.
ru: С обновлением до релиза 2024.2 (Dalmatian) и выше использование RabbitMQ Quorum Queues является обязательным для обеспечения высокой доступности очередей. Если ранее вы установили ``oslomsg_rabbit_quorum_queues: false``, пожалуйста, рассмотрите возможность миграции перед продолжением этого обновления, которое использует RabbitMQ 4.x.

source: Within OpenStack-Ansible, all data and states required for operation of the RabbitMQ cluster is replicated across all nodes including the message queues providing high availability. RabbitMQ nodes address each other using domain names. The hostnames of all cluster members must be resolvable from all cluster nodes, as well as any machines where CLI tools related to RabbitMQ might be used. There are alternatives that may work in more restrictive environments. For more details on that setup, see `Inet Configuration <https://www.erlang.org/doc/apps/erts/inet_cfg.html>`_.
ru: В OpenStack-Ansible все данные и состояния, необходимые для работы кластера RabbitMQ, реплицируются на все узлы, включая очереди сообщений, обеспечивая высокую доступность. Узлы RabbitMQ обращаются друг к другу с помощью доменных имен. Имена хостов всех участников кластера должны быть доступны со всех узлов кластера, а также с любых машин, на которых могут использоваться инструменты CLI, связанные с RabbitMQ. Существуют альтернативы, которые могут работать в более строгих окружениях. Более подробную информацию об этой настройке см. в разделе `Конфигурация Inet <https://www.erlang.org/doc/apps/erts/inet_cfg.html>`_.

source: Yes:
ru: Да:

source: You can additionally define a different bootstrap node through ``galera_server_bootstrap_node`` variable, in case current bootstrap node is in desynced/broken state. You can check what node is currently selected for bootstrap using this ad-hoc:
ru: Вы можете дополнительно определить другой bootstrap узел через переменную ``galera_server_bootstrap_node``, в случае, если текущий bootstrap узел находится в рассинхронизированном/сломанном состоянии. Вы можете проверить, какой узел в данный момент выбран для bootstrap, используя этот ad-hoc:

source: You can also check out our ELK role from `OPS repository <https://opendev.org/openstack/openstack-ansible-ops/src/branch/master/elk_metrics_7x>`_ for a ready-to-use ELK stack deployment and metrics collection.
ru: Вы также можете ознакомиться с нашей ролью ELK из `репозитория OPS <https://opendev.org/openstack/openstack-ansible-ops/src/branch/master/elk_metrics_7x>`_ для готового к использованию развертывания стека ELK и сбора метрик.

source: You can also conduct the following activities which may generate logs to help identity problems:
ru: Вы также можете выполнять следующие действия, которые могут генерировать журналы для идентификации проблем:

source: You can also use a playbook for this:
ru: Для этого вы также можете воспользоваться следующим плейбуком:

source: You can check the status of an OpenStack service by accessing every controller node and running the :command:`service <SERVICE_NAME> status`.
ru: Вы можете проверить статус службы OpenStack, обратившись к каждому узлу контроллера и выполнив команду :command:`service <SERVICE_NAME> status`.

source: You can limit upgrades to specific OpenStack components by running each of the component playbooks against groups.
ru: Вы можете ограничить обновления для определенных компонентов OpenStack, запустив каждый из плейбуков компонентов в зависимости от групп.

source: You can limit upgrades to specific OpenStack components. See the following section for details.
ru: Вы можете ограничить обновления для определенных компонентов OpenStack. Подробности см. в следующем разделе.

source: You can provide this script with extra tasks that will be executed before or right after OpenStack-Ansible roles. To do so you should set environment variables ``PRE_OSA_TASKS`` or ``POST_OSA_TASKS`` with plays to run devided with semicolon:
ru: Вы можете дополнить этот скрипт дополнительными задачами, которые будут выполняться до или сразу после ролей OpenStack-Ansible. Для этого необходимо задать переменные окружения ``PRE_OSA_TASKS`` или ``POST_OSA_TASKS`` с именами запускаемых плейбуков, разделенных точкой с запятой:

source: You can reference the following documentation for a deeper understanding of how env.d and conf.d files should be constructed: :ref:`inventory-in-depth`
ru: Для более глубокого понимания того, как должны быть построены файлы env.d и conf.d, вы можете обратиться к следующей документации: :ref:`inventory-in-depth`

source: You can supply arbitrary journald configuration options by defining a mapping in ``openstack_hosts_journald_config`` in your ``user_variables.yml``. For example:
ru: Вы можете указать произвольные параметры конфигурации journald, определив соответствие в ``openstack_hosts_journald_config`` в файле ``user_variables.yml``. Например:

source: You can take the cluster node name to remove from the output at step two.
ru: Вы можете взять имя узла кластера, которое необходимо удалить, из вывода на втором этапе.

source: You can upgrade between sequential releases or between releases marked as `SLURP`_.
ru: Вы можете обновляться между последовательными релизами или между релизами, помеченными как `SLURP`_.

source: You can use the playbook to re-enable all backends from the host:
ru: Вы можете использовать следующий плейбук для повторного включения всех бэкэндов с хоста:

source: You will be asked two questions:
ru: Вам будет задано два вопроса:

source: You will see ``rabbit1`` and ``rabbit2`` are both running as before.
ru: Вы увидите, что ``rabbit1`` и ``rabbit2`` оба работают, как и прежде.

source: You'll now have MariaDB running, and it should be synced with non-primaries.
ru: Теперь у вас будет запущена MariaDB, и она должна быть синхронизирована с вторичными.

source: `Block Storage service <https://docs.openstack.org/cinder/latest/install/cinder-verify.html>`_
ru: `Служба блочного хранилища <https://docs.openstack.org/cinder/latest/install/cinder-verify.html>`_

source: `Compute (nova) CLI command cheat sheet <https://docs.openstack.org/python-novaclient/latest/cli/nova.html>`__
ru: `Шпаргалка по командам CLI Compute (nova) <https://docs.openstack.org/python-novaclient/latest/cli/nova.html>`__

source: `Compute (nova) CLI commands <https://docs.openstack.org/nova/latest/cli/index.html>`__
ru: `Команды CLI вычислительной службы (nova) <https://docs.openstack.org/nova/latest/cli/index.html>`__

source: `Compute service (nova) <https://docs.openstack.org/nova/latest/install/verify.html>`_
ru: `Вычислительная служба (nova) <https://docs.openstack.org/nova/latest/install/verify.html>`_

source: `HAProxy <https://opendev.org/openstack/openstack-ansible/src/commit/6520d0bb2c689ed7caa5df581be6a966133cdce0/inventory/group_vars/haproxy/haproxy.yml>`_ can be configured with OpenStack-Ansible. The automatically generated ``/etc/haproxy/haproxy.cfg`` file have enough information on the ports to open for your environment.
ru: `HAProxy <https://opendev.org/openstack/openstack-ansible/src/commit/6520d0bb2c689ed7caa5df581be6a966133cdce0/inventory/group_vars/haproxy/haproxy.yml>`_ можно настроить с помощью OpenStack-Ansible. Автоматически сгенерированный файл ``/etc/haproxy/haproxy.cfg`` содержит достаточно информации о портах, которые нужно открыть для вашего окружения.

source: `Identity service (keystone) <https://docs.openstack.org/keystone/latest/install/keystone-verify-ubuntu.html>`_
ru: `Служба идентификации (keystone) <https://docs.openstack.org/keystone/latest/install/keystone-verify-ubuntu.html>`_

source: `Image service (glance) <https://docs.openstack.org/glance/latest/install/verify.html>`_
ru: `Сервис образов (glance) <https://docs.openstack.org/glance/latest/install/verify.html>`_

source: `Networking service (neutron) <https://docs.openstack.org/neutron/latest/install/verify.html>`_
ru: `Сетевая служба (neutron) <https://docs.openstack.org/neutron/latest/install/verify.html>`_

source: `Object Storage service (swift) <https://docs.openstack.org/swift/latest/install/verify.html>`_
ru: `Служба объектного хранилища (swift) <https://docs.openstack.org/swift/latest/install/verify.html>`_

source: `OpenStack API Quick Start <https://docs.openstack.org/api-quick-start/index.html>`__
ru: `Быстрый старт API OpenStack <https://docs.openstack.org/api-quick-start/index.html>`__

source: `OpenStackClient commands <https://docs.openstack.org/python-openstackclient/latest/>`__
ru: `Команды OpenStackClient <https://docs.openstack.org/python-openstackclient/latest/>`__

source: ``CONTAINER_NET`` (LXC container network used OpenStack Services)
ru: ``CONTAINER_NET`` (сеть контейнеров LXC, используемая службами OpenStack)

source: ``HOST_NET`` (Physical Host Management and Access to Internet)
ru: ``HOST_NET`` (управление физическими хостами и доступом в Интернет)

source: ``OVERLAY_NET`` (VXLAN overlay network)
ru: ``OVERLAY_NET`` (оверлейная сеть VXLAN)

source: ``br-mgmt`` should contain veth-pair ends from all containers and a physical interface or tagged-subinterface:
ru: ``br-mgmt`` должен содержать концы veth-пары из всех контейнеров и физический интерфейс или тегированный субинтерфейс:

source: ``systemd-journald`` integrates well with a wide range of log collectors and forwarders, including ``rsyslog``. However, while ``rsyslog`` stores data as plain text (making it harder to index and search efficiently), journald uses a structured format that allows logs to be queried and processed much more efficiently by modern log analysis tools.
ru: ``systemd-journald`` хорошо интегрируется с широким спектром сборщиков и пересылателей логов, включая ``rsyslog``. Однако, в то время как ``rsyslog`` хранит данные в виде обычного текста (что затрудняет индексацию и эффективный поиск), journald использует структурированный формат, позволяющий гораздо эффективнее запрашивать и обрабатывать журналы с помощью современных инструментов анализа журналов.

source: `eth0` in the container connects to `lxcbr0` on the host
ru: `eth0` в контейнере подключается к `lxcbr0` на хосте

source: `eth1` in the container connects to `br-mgmt` on the host
ru: `eth1` в контейнере подключается к `br-mgmt` на хосте

source: and can visit https://admin:password@external_lb_vip_address:1936/ and read 'Statistics Report for pid # on infrastructure_host'
ru: и можете зайти на https://admin:password@external_lb_vip_address:1936/ и прочитать 'Отчет по статистике для pid # на инфраструктурном узле'

source: etc.
ru: и т. д.

source: for each API or service instance you wish to disable.
ru: для каждого API или инстанса службы, которые вы хотите отключить.

source: kvm defaults to ``qemu+tcp://%s/system``
ru: в kvm по умолчанию ``qemu+tcp://%s/system``

source: qemu defaults to ``qemu+tcp://%s/system``
ru: по умолчанию в qemu ``qemu+tcp://%s/system``

source: specific dependencies
ru: специфические зависимости

source: |upgrade_warning| Test this on a development environment first.
ru: |upgrade_warning| Сначала протестируйте это в окружении разработчиков.
