Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: ru

source: Common reference drivers, including ML2/OVS, and ML2/OVN, and their respective agents, are responsible for managing the virtual networking infrastructure on each node. OpenStack-Ansible refers to Neutron traffic as "data plane" traffic, and can consist of flat, VLAN, or overlay technologies such as VXLAN and Geneve.
ru: Общие стандартные драйверы, включая ML2/OVS и ML2/OVN, а также их соответствующие агенты, отвечают за управление виртуальной сетевой инфраструктурой на каждом узле. OpenStack-Ansible называет трафик Neutron трафиком "плоскости данных" (data plane) и может состоять из плоских, VLAN или оверлейных технологий, таких как VXLAN и Geneve.

source: Compute Node
ru: Вычислительный узел

source: Configuration constraints
ru: Ограничения конфигурации

source: Configuring the inventory
ru: Настройка inventory

source: Consider this directory structure:
ru: Рассмотрим следующую структуру каталога:

source: Container networking
ru: Сетевая архитектура контейнеров

source: Containerized deployments
ru: Развертывания с контейнеризацией

source: Containers running an `Unbound DNS`_ caching service can optionally be deployed to cache DNS lookups and to handle internal DNS name resolution. We recommend using this service for large-scale production environments because the deployment will be significantly faster. If this service is not used, OpenStack-Ansible modifies ``/etc/hosts`` entries for all hosts in the environment.
ru: Контейнеры, с кэширующей службой `Unbound DNS`_ , могут быть дополнительно развернуты для кэширования DNS-поиска и обработки внутреннего разрешения имен DNS. Мы рекомендуем использовать эту службу для крупномасштабных рабочих окружений, поскольку развертывание будет значительно быстрее. Если эта служба не используется, OpenStack-Ansible изменяет записи ``/etc/hosts`` для всех хостов в среде.

source: Contents of this directory are populated into the environment *before* the ``env.d`` found in the directory specified by ``--config``.
ru: Содержимое этого каталога заполняется в среде *до* того, как ``env.d`` будет найден в каталоге, указанном ``--config``.

source: Conventions
ru: Условные обозначения

source: Create ``env.d/az.yml`` file that will leverage ``is_nest`` property and allow all infra containers to be part of the AZ group as well
ru: Создайте файл ``env.d/az.yml``, который будет использовать свойство ``is_nest`` и позволит всем инфраструктурным контейнерам быть частью группы AZ

source: Creates container and IP address mappings
ru: Создает сопоставления контейнеров и IP-адресов

source: Default folders locations
ru: Расположение папок по умолчанию

source: Define host groups in ``conf.d`` or ``openstack_user_config.yml`` to assign hosts accordingly to their Availability Zones:
ru: Определите группы хостов в ``conf.d`` или ``openstack_user_config.yml``, чтобы назначить хосты в соответствии с их зонами доступности:

source: Define override for containers
ru: Назначьте переопределение для контейнеров

source: Define the host group (``db_hosts``) in a ``conf.d/`` file (such as ``galera.yml``). For example:
ru: Определите группу хостов (``db_hosts``) в файле ``conf.d/`` (например, ``galera.yml``). Например:

source: Defining environment variables for deployment
ru: Определение переменных среды для развертывания

source: Deploying directly on hosts
ru: Развертывание непосредственно на хостах

source: Deploying with no component type per host (or more than one)
ru: Развертывание без указания типа компонента на хост (или более одного)

source: Describe network in ``provider_networks``:
ru: Опишите сеть в ``provider_networks``:

source: Discovering available overrides
ru: Обнаружение доступных переопределений

source: Do not run the playbook that installs the component. Unless you specify the component to run directly on a host by using the ``is_metal`` property, a container is created for this component.
ru: Не запускайте плейбук, который устанавливает компонент. Если вы не укажете компонент для запуска непосредственно на хосте с помощью свойства ``is_metal``, для этого компонента будет создан контейнер.

source: Does not implement its own DSL, and uses wherever possible Ansible directly. All the experience acquired using Ansible can be used in OpenStack-Ansible, and the other way around.
ru: Не реализует свой собственный DSL, а использует Ansible напрямую везде, где это возможно. Весь опыт, полученный с помощью Ansible, может быть использован в OpenStack-Ansible, и наоборот.

source: Dynamic Inventory API documentation
ru: Документация API динамического inventory

source: Dynamic inventory script is also installed inside virtualenv as a script. So alternatively you can run following:
ru: Скрипт динамического inventory также устанавливается внутри virtualenv как скрипт. Так что в качестве альтернативы вы можете запустить следующее:

source: Each OpenStack release uses an ``upper-constraints.txt`` file to define the maximum permitted version of each Python package. In some cases it may be necessary to override this file, for example when your local deployment needs to take advantage of a bug fix. Care should be taken when modifying this file as OpenStack services may not have been tested against more recent package versions.
ru: Каждый релиз OpenStack использует файл ``upper-constraints.txt`` для определения максимально допустимой версии каждого пакета Python. В некоторых случаях может потребоваться переопределить этот файл, например, когда локальное развертывание должно воспользоваться исправлением ошибки. При изменении этого файла следует соблюдать осторожность, поскольку службы OpenStack могли не быть протестированы с более поздними версиями пакетов.

source: Each container has a namespace that connects to the host namespace with one or more ``veth`` pairs. Unless specified, the system generates random names for ``veth`` pairs.
ru: Каждый контейнер имеет пространство имен, которое соединяется с пространством имен хоста одной или более ``veth`` парой. Система генерирует случайные имена для `` veth`` пар, если не задано иначе.

source: Each of the custom group names in this example (``db_containers`` and ``db_hosts``) are arbitrary. Choose your own group names, but ensure the references are consistent among all relevant files.
ru: Каждое из имен пользовательских групп в этом примере (``db_containers`` и ``db_hosts``) является произвольным. Выберите собственные имена групп, но убедитесь, что ссылки согласованы во всех соответствующих файлах.

source: Encrypted communication
ru: Шифрованное соединение

source: Ephemeral storage (nova)
ru: Временное хранение (nova)

source: Every deployer has different security requirements. The `OpenStack Security Guide`_ has instructions and advice on how to operate and consume an OpenStack cloud by using the most secure methods.
ru: У каждого оператора свои требования к безопасности. В `Руководстве по безопасности OpenStack`_ содержатся инструкции и советы о том, как эксплуатировать и использовать облако OpenStack, используя наиболее безопасные методы.

source: Every role has a file, ``defaults/main.yml`` which holds the usual variables overridable by a deployer, like a regular Ansible role. This defaults are the closest possible to OpenStack standards.
ru: У каждой роли есть файл ``defaults/main.yml``, который содержит обычные переменные, которые может переопределять оператор, как и обычная роль Ansible. Эти значения по умолчанию максимально приближены к стандартам OpenStack.

source: Every role makes use of additional variables in ``vars/`` which take precedence over group vars.
ru: Каждая роль использует дополнительные переменные в ``vars/``, которые имеют приоритет над групповыми переменными.

source: Example of un-containerized services:
ru: Пример неконтейнеризованных служб:

source: Example task using the config_template module
ru: Пример задачи с использованием модуля config_template

source: Example:
ru: Пример:

source: Example: Defining Availability Zones
ru: Пример: определение зон доступности

source: Example: Running Galera on dedicated hosts
ru: Пример: запуск Galera на выделенных хостах

source: Example: Running all controllers on metal
ru: Пример: запуск всех контроллеров без контейнеров

source: Executing the dynamic_inventory.py script manually
ru: Выполнение скрипта dynamic_inventory.py вручную

source: Exporting host information
ru: Экспорт информации о хосте

source: Extending OpenStack-Ansible with additional Ansible content
ru: Расширение OpenStack-Ansible дополнительным контентом Ansible

source: Files in ``/etc/openstack_deploy`` beginning with ``user_`` will be automatically sourced in any ``openstack-ansible`` command. Alternatively, the files can be sourced with the ``-e`` parameter of the ``ansible-playbook`` command.
ru: Файлы в ``/etc/openstack_deploy``, начинающиеся с ``user_``, будут автоматически получены в любой команде ``openstack-ansible``. В качестве альтернативы файлы могут быть получены с помощью параметра ``-e`` команды ``ansible-playbook``.

source: Finally, run the ``repo-install.yml`` playbook to upload these modified constraints to your repo host(s).
ru: Наконец, запустите сценарий ``repo-install.yml``, чтобы загрузить эти измененные ограничения на хост(ы) вашего репозитория.

source: For details on the configuration of networking for your environment, please have a look at :ref:`openstack-user-config-reference`.
ru: Для деталей по настройке сетей для вашего окружения, см. :ref:`openstack-user-config-reference`.

source: For each OpenStack-Ansible release, the Ansible roles that form that release are set to a specific `git SHA-1 hash`_ (SHA). These are updated after every OpenStack-Ansible release.
ru: Для каждого выпуска OpenStack-Ansible роли Ansible, которые формируют этот выпуск, устанавливаются на определенный `git SHA-1 hash`_ (SHA). Они обновляются после каждого выпуска OpenStack-Ansible.

source: For each OpenStack-Ansible release, the OpenStack version that is deployed is set to a specific OpenStack `git SHA-1 hash`_ (SHA). These are updated after every OpenStack-Ansible release. The intent is to ensure that OpenStack-Ansible users are able to enjoy an updated OpenStack environment with smaller increments of change than the typical upstream service releases allow for as they are usually very infrequent.
ru: Для каждого выпуска OpenStack-Ansible развертываемая версия OpenStack устанавливается на определенный OpenStack `git SHA-1 hash`_ (SHA). Они обновляются после каждого выпуска OpenStack-Ansible. Цель состоит в том, чтобы гарантировать, что пользователи OpenStack-Ansible смогут пользоваться обновленной средой OpenStack с меньшим количеством изменений, чем позволяют типичные выпуски вышестоящих служб, поскольку они обычно очень редки.

source: For example, if you'd like to run all your controllers on metal, you would have the following inside your ``openstack_user_config.yml``.
ru: Например, если вы хотите запустить все свои контроллеры на bare metal, вам нужно будет добавить в файл ``openstack_user_config.yml`` следующее.

source: For example, the ``shared-infra.yml`` file defines a container group, ``shared-infra_containers``, as a subset of the ``all_containers`` inventory group. The ``shared- infra_containers`` container group is mapped to the ``shared-infra_hosts`` host group. All of the service components in the ``shared-infra_containers`` container group are deployed to each target host in the ``shared-infra_hosts host`` group.
ru: Например, файл ``shared-infra.yml`` определяет группу контейнеров ``shared-infra_containers`` как подмножество группы inventory ``all_containers``. Группа контейнеров ``shared-infra_containers`` сопоставляется с группой хостов ``shared-infra_hosts``. Все компоненты служб в группе контейнеров ``shared-infra_containers`` развертываются на каждом целевом хосте в группе хостов ``shared-infra_hosts``.

source: For example, to run Galera directly on dedicated hosts, you would perform the following steps:
ru: Например, чтобы запустить Galera непосредственно на выделенных хостах, вам необходимо выполнить следующие шаги:

source: For example, you might want to add the following parameters to the ``nova.conf`` file:
ru: Например, вы можете добавить следующие параметры в файл ``nova.conf``:

source: For example, you might want to add the following policy in the ``policy.json`` file for the Identity service (keystone):
ru: Например, вы можете добавить следующую политику в файл ``policy.json`` для службы идентификации (keystone):

source: For example, you might want to define a meter exclusion for all hardware items in the default content of the ``pipeline.yml`` file for the Telemetry service (ceilometer):
ru: Например, вы можете захотеть определить исключение счетчика для всех элементов оборудования в содержимом по умолчанию файла ``pipeline.yml`` для службы телеметрии (ceilometer):

source: For information on how to contribute, extend or develop OpenStack-Ansible, see the :dev_docs:`Developer Documentation <contributors/index.html>`.
ru: Информацию о том, как внести свой вклад, расширять или развивать OpenStack-Ansible, см. в :dev_docs:`Документации для разработчиков <contributors/index.html>`.

source: For information on how to deploy your OpenStack-Ansible cloud, refer to the :deploy_guide:`Deployment Guide <index.html>` for step-by-step instructions on how to deploy the OpenStack packages and dependencies on your cloud using OpenStack-Ansible.
ru: Информацию о том, как развернуть облако OpenStack-Ansible, см. в :deploy_guide:`Руководстве по развертыванию <index.html>`, где приведены пошаговые инструкции по развертыванию пакетов OpenStack и зависимостей в вашем облаке с помощью OpenStack-Ansible.

source: For information on how to manage and operate OpenStack-Ansible, see the see the :ref:`operations-guide`.
ru: Информацию об управлении и эксплуатации OpenStack-Ansible см. в :ref:`Руководство по эксплуатации`.

source: For isolation and ease of maintenance, all OpenStack services are installed by default from source code into python virtual environments.
ru: Для изоляции и простоты обслуживания все службы OpenStack по умолчанию устанавливаются из исходного кода в виртуальные среды Python.

source: For more details, see :ref:`configuring-inventory`.
ru: Более подробную информацию см. в разделе :ref:`configuring-inventory`.

source: For more information about how the OpenStack Networking service (Neutron) uses the interfaces for instance traffic, please see the `OpenStack Networking Guide`_.
ru: Дополнительную информацию о том, как служба OpenStack Networking (Neutron) использует интерфейсы для трафика инстансов, см. в `Руководстве по сетевому взаимодействию OpenStack`_.

source: For more information about recommended network policies for OpenStack clouds, see the `API endpoint process isolation and policy`_ section of the `OpenStack Security Guide`_
ru: Дополнительную информацию о рекомендуемых сетевых политиках для облаков OpenStack см. в разделе `Изоляция и политика процесса точки доступа API`_ в `Руководстве по безопасности OpenStack`_.

source: For more information about the security configurations, see the `security hardening role`_ documentation.
ru: Дополнительную информацию о конфигурациях безопасности см. в документации `роль усиления безопасности`_.

source: For some deployments it might be required to passthrough devices directly to containers, for example, when SR-IOV is used or devices can't be bridged (ie with `IPoIB <https://www.kernel.org/doc/html/latest/infiniband/ipoib.html>`)
ru: Для некоторых развертываний может потребоваться проброс устройств напрямую в контейнеры, например, когда используется SR-IOV или устройства не могут быть объединены мостом (например, с помощью `IPoIB <https://www.kernel.org/doc/html/latest/infiniband/ipoib.html>`)

source: For user guides, see the :ref:`user-guide`.
ru: Руководства пользователя см. в :ref:`user-guide`.

source: Generates the names of each container that runs a service
ru: Генерирует имена каждого контейнера, который запускает службу

source: Generating the Inventory
ru: Формирование inventory

source: Group memberships
ru: Членство в группах

source: Group vars and host vars
ru: Групповые переменные и переменные хоста

source: Having SSH network different from OpenStack Management network
ru: Наличие сети SSH, отличной от сети управления OpenStack

source: Here is an example override dictionary (hash):
ru: Вот пример переопределения словаря (хеша):

source: Host security hardening
ru: Усиление безопасности хоста

source: Host security hardening is required by several compliance and regulatory programs, such as the `Payment Card Industry Data Security Standard`_ (PCI DSS) (Requirement 2.2).
ru: Усиление безопасности хоста требуется несколькими программами соответствия и регулирования, такими как `Стандарт безопасности данных индустрии платежных карт`_ (PCI DSS) (Требование 2.2).

source: Hosts with services running in containers
ru: Хосты с сервисами, запущенными в контейнерах

source: Hosts with services running on metal
ru: Хосты со службами, работающими на физических серверах

source: How are release tags decided?
ru: Как определяются метки релиза?

source: How frequently does OpenStack-Ansible release?
ru: Как часто выходят версии OpenStack-Ansible?

source: However, groups cannot contain child groups and hosts.
ru: Однако, группы не могут содержать дочерние группы и хосты.

source: However, some of the services within an OpenStack cloud are accessible to all end users, while others are accessible only to administrators or operators on a secured network.
ru: Однако, некоторые службы в облаке OpenStack доступны всем конечным пользователям, в то время как другие доступны только администраторам или операторам защищенной сети.

source: However, this project solely focuses on the deployment of OpenStack and its requirements.
ru: Не смотря на это, проект исключительно фокусируется на развертывании OpenStack и его требованиях.

source: If a tool or object does not require a dedicated container, or if it is impractical to create a new container for a single tool or object, it is installed in the utility container. The utility container is also used when tools cannot be installed directly on a host. The utility container is prepared with the appropriate credentials and clients to administer the OpenStack environment. It is set to automatically use the internal service endpoints.
ru: Если инструмент или объект не требует выделенного контейнера или если нецелесообразно создавать новый контейнер для одного инструмента или объекта, он устанавливается в контейнер утилит. Контейнер утилит также используется, когда инструменты не могут быть установлены непосредственно на хосте. Контейнер утилит подготовлен с соответствующими учетными данными и клиентами для администрирования среды OpenStack. Он настроен на автоматическое использование внутренних точек доступа сервиса.

source: If any groups defined in the ``openstack_user_config.yml`` or ``conf.d`` files are not found in the environment, a warning will be raised.
ru: Если в среде не найдены какие-либо группы, определенные в файлах ``openstack_user_config.yml`` или ``conf.d``, будет выдано предупреждение.

source: If there is a requirement to rush a role patch into the next release, then anyone may propose a change to the ``ansible-role-requirements.yml`` file in the ``openstack/openstack-ansible`` repository with the appropriate justification.
ru: Если необходимо ускорить внедрение исправления роли в следующий релиз, то любой может предложить внести изменения в файл ``ansible-role-requirements.yml`` в репозитории ``openstack/openstack-ansible`` с соответствующим обоснованием.

source: If you are deploying a stand-alone Object Storage (swift) environment, you can skip the deployment of RabbitMQ. If you use this configuration, your ``openstack_user_config.yml`` file would look as follows:
ru: Если вы развертываете автономное объектное хранилище (swift), вы можете пропустить развертывание RabbitMQ. Если вы используете эту конфигурацию, ваш файл ``openstack_user_config.yml`` будет выглядеть следующим образом:

source: If you install some additional deployment functionality as either a collection or a git repository on the deploy host, it is possible to automatically include extra playbooks at certain points during the deployment.
ru: Если вы установите некоторые дополнительные функции развертывания в виде коллекции или репозитория git на хосте развертывания, можно будет автоматически включать дополнительные плейбуки в определенные моменты во время развертывания.

source: If you require additional network configuration for your container interfaces (like changing the routes on eth1 for routes on the management network), please adapt your ``openstack_user_config.yml`` file. See :ref:`openstack-user-config-reference` for more details.
ru: Если вам требуется дополнительная сетевая настройка для интерфейсов контейнера (как например изменение маршрутов на eth1 для управляющей сети), пожалуйста, адаптируйте свой файл ``openstack_user_config.yml``. См. :ref:`openstack-user-config-reference` для деталей.

source: If you want to change the location of the override folder, you can adapt your ``user.rc`` file (see details in :dev_docs:`Extending OSA with additional Ansible content <reference/configuration/extending-osa.html#defining-environment-variables-for-deployment>`), or export ``GROUP_VARS_PATH`` and ``HOST_VARS_PATH`` during your shell session.
ru: Если вы хотите изменить расположение папки переопределения, вы можете адаптировать свой файл ``user.rc`` (подробности см. в :dev_docs:`Расширение OSA с помощью дополнительного содержимого Ansible <reference/configuration/extending-osa.html#defining-environment-variables-for-deployment>`) или экспортировать ``GROUP_VARS_PATH`` и ``HOST_VARS_PATH`` во время сеанса оболочки.

source: If you want to create a custom group for arbitrary grouping of hosts and containers within these hosts but skip the generation of any new containers, you should use ``is_nest`` property under container_skel and skip defining ``belongs_to`` structure. ``is_nest`` property will add host-containers as children to such a group.
ru: Если вы хотите создать пользовательскую группу для произвольного объединения хостов и контейнеров внутри этих хостов, но пропустить генерацию новых контейнеров, вам следует использовать свойство ``is_nest`` в container_skel и пропустить определение структуры ``belongs_to``. Свойство ``is_nest`` добавит хост-контейнеры в качестве дочерних элементов в такую ​​группу.

source: If you want to extend or just partially override content of the ``ansible-role-requirements.yml`` file you can create a new config file which path defaults to ``/etc/openstack_deploy/user-role-requirements.yml``. This path can be overriden with another environment variable ``USER_ROLE_FILE`` which is expected to be relative to ``OSA_CONFIG_DIR`` (/etc/openstack_deploy) folder.
ru: Если вы хотите расширить или частично переопределить содержимое файла ``ansible-role-requirements.yml``, вы можете создать новый файл конфигурации, путь к которому по умолчанию ``/etc/openstack_deploy/user-role-requirements.yml``. Этот путь можно переопределить с помощью другой переменной среды ``USER_ROLE_FILE``, которая, как ожидается, будет относительно папки ``OSA_CONFIG_DIR`` (/etc/openstack_deploy).

source: If you want to globally override variable, you can define the variable you want to override in a ``/etc/openstack_deploy/user_*.yml`` file. It will apply on all hosts.
ru: Если вы хотите глобально переопределить переменную, вы можете назначить переменную, которую хотите переопределить, в файле ``/etc/openstack_deploy/user_*.yml``. Это будет применено ко всем хостам.
