Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: ru

source: (* because we need to include containers in the limit)
ru: (* потому что нам нужно включить контейнеры в ограничение)

source: (* because we're deleting all container facts for the host as well)
ru: (* потому что мы также удаляем все факты о контейнерах для хоста)

source: (* because we're deleting all container facts for the host as well.)
ru: (* потому что мы удаляем все факты о контейнерах и для хоста.)

source: **Availability Zone**
ru: **Зона доступности**

source: **Configuration**
ru: **Конфигурация**

source: **Custom journald configuration**
ru: **Своя конфигурация journald**

source: **Data flow example**
ru: **Пример потока данных**

source: **Figure Dashboard — Instances tab**
ru: **Панель управления — вкладка "Инстансы"**

source: **Flavor**
ru: **Тип инстансов**

source: **Image**
ru: **Образ**

source: **Instance Boot Source**
ru: **Источник загрузки инстанса**

source: **Instance Count**
ru: **Количество инстансов**

source: **Instance Details**
ru: **Детали инстанса**

source: **Instance Name**
ru: **Имя инстанса**

source: **Instance Networks**
ru: **Сети инстансов**

source: **Instance Source**
ru: **Источник инстанса**

source: **Instances Page**
ru: **Страница инстансов**

source: **Keypair**
ru: **Ключевая пара**

source: **Launching an instance options**
ru: **Параметры запуска инстанса**

source: **Networks**
ru: **Сети**

source: **Persistent journal storage**
ru: **Постоянное хранение логов**

source: **Security Groups**
ru: **Группы безопасности**

source: A RabbitMQ broker is a logical grouping of one or several Erlang nodes with each node running the RabbitMQ application and sharing users, virtual hosts, queues, exchanges, bindings, and runtime parameters. A collection of nodes is often referred to as a `cluster`. For more information on RabbitMQ clustering, see `RabbitMQ cluster <https://www.rabbitmq.com/clustering.html>`_.
ru: Брокер сообщений RabbitMQ — это логическая группировка одного или нескольких узлов Erlang, на каждом из которых запущено приложение RabbitMQ и используются общие пользователи, виртуальные хосты, очереди, обмены, привязки и параметры времени выполнения. Набор узлов часто называют `кластером`. Для получения дополнительной информации о кластеризации RabbitMQ см. `Кластер RabbitMQ <https://www.rabbitmq.com/clustering.html>`_.

source: A minor upgrade typically requires the following steps:
ru: Для минорного обновления обычно требуются следующие действия:

source: A newly deployed OpenStack-Ansible has no networks by default. If you need to add networks, you can use the OpenStack CLI, or you can use the Ansible modules for it.
ru: Недавно развернутый OpenStack-Ansible не имеет сетей по умолчанию. Если вам нужно добавить сети, вы можете использовать OpenStack CLI или использовать модули Ansible для этого.

source: ARA Integration
ru: Интеграция ARA

source: Access the deployment groups section of the configuration file. Underneath the deployment group name, add an affinity value line to container scales OpenStack services:
ru: Откройте раздел групп развертывания в файле конфигурации. Под именем группы развертывания добавьте строку значения affinity для масштабирования контейнера службы OpenStack:

source: Access the utility container:
ru: Доступ к контейнеру утилит:

source: Accessibility for multi-region Object Storage
ru: Доступность для мультирегиональных объектных хранилищ

source: Add a compute host
ru: Добавить вычислительный хост

source: Add a new infrastructure host
ru: Добавление нового хоста инфраструктуры

source: Add another destination host in ``openstack_user_config`` for database_hosts:
ru: Добавьте еще один хост назначения в ``openstack_user_config`` для database_hosts:

source: Add another destination host in ``openstack_user_config`` for mq_hosts:
ru: Добавьте еще один хост назначения в ``openstack_user_config`` для mq_hosts:

source: Add customisation scripts, if needed, by clicking the :guilabel:`Configuration`. These run after the instance has been created. Some instances support user data, such as root passwords, or admin users. Enter the information specific to the instance here if required.
ru: При необходимости добавьте скрипты настройки, нажав :guilabel:`Конфигурация`. Они запускаются после создания инстанса. Некоторые инстансы поддерживают пользовательские данные, такие как пароли администратора или пользователей с правами администратора. При необходимости введите здесь информацию, относящуюся к данному инстансу.

source: Add each provider network to your cloud to be made known to OpenStack-Ansible and the operating system before you can execute the necessary playbooks to complete the configuration.
ru: Добавьте каждую сеть провайдера в свое облако, чтобы она стала известна OpenStack-Ansible и операционной системе, прежде чем вы сможете выполнить необходимые плейбуки для завершения настройки.

source: Add provider bridges using new network interfaces
ru: Добавление мостов провайдера, используя новые сетевые интерфейсы

source: Add the node to the ``infra_hosts`` stanza of the ``/etc/openstack_deploy/openstack_user_config.yml``:
ru: Добавьте узел в строку ``infra_hosts`` в файле ``/etc/openstack_deploy/openstack_user_config.yml``:

source: Adding an image using the Dashboard
ru: Добавление образа с помощью панели управления

source: Adding an image using the command line
ru: Добавление образа с помощью командной строки

source: Adding images can be done through the Dashboard, or the command line. Another option available is the ``python-openstackclient`` tool, which can be installed on the controller node, or on a workstation.
ru: Добавление образов можно выполнить через панель управления или командную строку. Другой доступный вариант — инструмент ``python-openstackclient``, который можно установить на управляющем узле или на рабочей станции.

source: Adding new members to the MariaDB Galera cluster
ru: Добавление новых участников в кластер MariaDB Galera

source: Adding new members to the RabbitMQ cluster
ru: Добавление новых участников в кластер RabbitMQ

source: Additional flavor features like ephemeral storage or swap have an impact on live migration performance and success.
ru: Дополнительные функции, такие как временное хранилище или swap, влияют на производительность и успешность живой миграции.

source: Adjust HAProxy status
ru: Настройте статус HAProxy

source: After adjusting any journald-related variables, you can apply the changes by re-running the ``openstack_hosts_setup`` role:
ru: После настройки всех переменных, связанных с journald, вы можете применить изменения, повторно запустив роль ``openstack_hosts_setup``:

source: After creating a new infra node, test that the node runs correctly by launching a new instance. Ensure that the new node can respond to a networking connection test through the :command:`ping` command. Log in to your monitoring system, and verify that the monitors return a green signal for the new node.
ru: После создания нового инфраструктурного узла проверьте, что узел работает правильно, запустив новый инстанс. Убедитесь, что новый узел может ответить на тест сетевого соединения с помощью команды :command:`ping`. Войдите в свою систему мониторинга и убедитесь, что мониторы возвращают зеленый сигнал для нового узла.

source: After creating a new node, test that the node runs correctly by launching an instance on the new node:
ru: После создания нового узла проверьте правильность его работы, запустив инстанс на новом узле:

source: After that you can proceed with standard OpenStack upgrade steps:
ru: После этого вы можете приступить к стандартным шагам обновления OpenStack:

source: After that you might want to ensure that "local" backends remain disabled. You can also use the playbook for this:
ru: После этого вам, возможно, захочется убедиться, что "локальные" бэкенды остаются отключенными. Для этого также можно воспользоваться следующим плейбуком:

source: After the playbook completes, remove the compute node from the OpenStack-Ansible configuration file in ``/etc/openstack_deploy/openstack_user_config.yml``.
ru: После завершения работы плейбука удалите вычислительный узел из конфигурационного файла OpenStack-Ansible в файле ``/etc/openstack_deploy/openstack_user_config.yml``.

source: After the playbook has finished, neutron services will be started and configured to use new clusters.
ru: После завершения плейбука будут запущены службы neutron и настроены для использования новых кластеров.

source: After the upgrade to the latest patches in the same branch:
ru: После обновления до последних патчей в той же ветке:

source: All LXC containers on the host have at least two virtual Ethernet interfaces:
ru: Все контейнеры LXC на хосте имеют не менее двух виртуальных интерфейсов Ethernet:

source: All container journals are accessible on the host under:
ru: Все логи контейнеров доступны на хосте в:

source: All of the OpenStack-Ansible releases are compatible with specific sets of operating systems and their versions. Operating Systems have their own lifecycles, however we may drop their support before end of their EOL because of various reasons:
ru: Все релизы OpenStack-Ansible совместимы с определенными наборами операционных систем и их версиями. Операционные системы имеют свой собственный жизненный цикл, однако по различным причинам мы можем прекратить их поддержку до окончания их EOL:

source: All provider networks need to be added to the OpenStack-Ansible configuration.
ru: Все сети провайдера необходимо добавить в конфигурацию OpenStack-Ansible.

source: All the nodes have failed if ``mariadbd`` is not running on any of the nodes and all of the nodes contain a ``seqno`` value of -1.
ru: Все узлы вышли из строя, если ``mariadbd`` не запущен ни на одном из узлов и все узлы содержат значение ``seqno``, равное -1.

source: Also ensure that you have migrated from mirrored queues (HA queues) to Quorum queues before the upgrade, as mirrored queues are no longer supported after upgrade.
ru: Также убедитесь, что перед обновлением вы перешли с зеркальных очередей (очередей HA) на очереди Quorum, поскольку после обновления зеркальные очереди больше не поддерживаются.

source: Alternatively you can try using new compute nodes deployment script ``/opt/openstack-ansible/scripts/add-compute.sh``.
ru: В качестве альтернативы вы можете попробовать использовать новый скрипт развертывания вычислительных узлов ``/opt/openstack-ansible/scripts/add-compute.sh``.

source: Alternatively, the following Ansible can be used to automate these actions:
ru: Кроме того, для автоматизации этих действий можно использовать следующий Ansible:

source: Always ensure that the branch is up-to-date and compatible with the rest of your deployment before proceeding.
ru: Прежде чем продолжить, всегда проверяйте, что ветвь обновлена ​​и совместима с остальной частью вашего развертывания.

source: An example on how to provision networks is in the `OpenStack-Ansible plugins <https://opendev.org/openstack/openstack-ansible-plugins>`_ repository, where you can use the openstack_resources role:
ru: Пример того, как подготовить сети, можно найти в репозитории `OpenStack-Ansible plugins <https://opendev.org/openstack/openstack-ansible-plugins>`_, где можно использовать роль openstack_resources:

source: An image represents the operating system, software, and any settings that instances may need depending on the project goals. Create images first before creating any instances.
ru: Образ представляет операционную систему, программное обеспечение и любые настройки, которые могут потребоваться инстансам в зависимости от целей проекта. Сначала создайте образы, прежде чем создавать какие-либо инстансы.

source: And install RabbitMQ to the new container and ensure it’s part of the cluster:
ru: Установите RabbitMQ в новый контейнер и убедитесь, что он является частью кластера:

source: And remove it from the inventory:
ru: И удалите его из inventory:

source: And run a backup/restore of the MariaDB database for the service. For this purpose, we will use another small playbook, that we name as ``mysql_backup_restore.yml`` with the following content:
ru: И запустим резервное копирование/восстановление базы данных MariaDB для службы. Для этого мы воспользуемся ещё одним небольшим плейбуком, который назовём ``mysql_backup_restore.yml``, со следующим содержимым:

source: And run:
ru: И запустите:

source: And use that SHA in your configuration to ensure consistent versions across all hosts in your ``user_variables.yml``:
ru: И используйте этот SHA в своей конфигурации, чтобы гарантировать единообразие версий на всех хостах в вашем ``user_variables.yml``:

source: Another option would be to use the LXC tools to retrieve information about the utility container. For example:
ru: Другим вариантом было бы использование инструментов LXC для получения информации о контейнере утилит. Например:

source: Ansible Logging Guide
ru: Логирование Ansible

source: Ansible `forks`_ entry for ansible.cfg
ru: Ansible `forks`_ запись для ansible.cfg

source: Are VXLAN VTEP addresses able to ping each other?
ru: Могут ли адреса VXLAN VTEP пинговать друг друга?

source: Are you sure you want to destroy the LXC containers? Are you sure you want to destroy the LXC container data?
ru: Вы уверены, что хотите удалить контейнеры LXC? Вы уверены, что хотите удалить данные контейнеров LXC?

source: As a hint, you could find the list of all public URI defaults by executing the following:
ru: В качестве подсказки, вы можете найти список всех публичных URI по умолчанию, выполнив следующее:

source: As an example, an all-in-one (AIO) build might provide a utility container called `aio1_utility_container-d13b7132`. That container will have two network interfaces: `d13b7132_eth0` and `d13b7132_eth1`.
ru: В качестве примера можно привести сборку "все в одном" (AIO) с контейнером утилит под названием `aio1_utility_container-d13b7132`. Этот контейнер будет иметь два сетевых интерфейса: `d13b7132_eth0` и `d13b7132_eth1`.

source: As explained in the previous section, you can find (in each roles documentation) the default variables used for the public interface endpoint ports.
ru: Как объяснялось в предыдущем разделе, вы можете найти (в документации каждой роли) переменные по умолчанию, используемые для портов точек доступа публичного интерфейса.

source: As noted above, this should be carried out for non-primaries first, ideally starting with a 'repo' host.
ru: Как отмечалось выше, сначала это следует сделать для не основных хостов, в идеале начав с хоста "репозитория".

source: As you might have noticed, we still consume the same HAProxy instance for MariaDB balancing to the new infra cluster.
ru: Как вы могли заметить, мы по-прежнему используем тот же инстанс HAProxy для балансировки MariaDB в новом инфраструктурном кластере.

source: As you might see from the output above, a record for the new container has been generated and assigned correctly to the infra01 host. Though this container has a new IP address, we need to preserve it. So we manually replaced the new IP with the old one in the inventory file and ensured it’s the proper one now:
ru: Как видно из приведенного выше вывода, была создана запись для нового контейнера и правильно назначена хосту infra01. Хотя этот контейнер имеет новый IP-адрес, нам необходимо сохранить его. Поэтому мы вручную заменили новый IP-адрес на старый в файле inventory и убедились, что теперь он правильный:

source: As you might see on the diagram, all connections to MariaDB come through the HAProxy which has Internal Virtual IP (VIP). OpenStack-Ansible does configure the Galera cluster for MariaDB, which is a multi-master replication system. Although you can issue any request to any member of the cluster, all write requests will be passed to the current “primary” instance creating more internal traffic and raising the amount of work each instance should do. So it is recommended to pass write requests only to the “primary” instance.
ru: Как видно на схеме, все подключения к MariaDB проходят через HAProxy, который имеет внутренний виртуальный IP-адрес (VIP). OpenStack-Ansible настраивает кластер Galera для MariaDB, который представляет собой систему репликации с несколькими мастерами. Хотя вы можете отправлять любой запрос любому участнику кластера, все запросы на запись будут передаваться текущему "основному" инстансу, создавая больше внутреннего трафика и увеличивая объем работы, которую должен выполнять каждый инстанс. Поэтому рекомендуется передавать запросы на запись только "основному" инстансу.

source: As you might see, OpenStack-Ansible is flexible enough to let you scale a deployment in many different ways.
ru: Как вы можете видеть, OpenStack-Ansible достаточно гибкий, чтобы позволить вам масштабировать развертывание многими различными способами.

source: Assuming, you currently have a config like the one below in your ``openstack_user_config.yml``:
ru: Предположим, что в настоящее время у вас есть конфигурация, подобная приведенной ниже, в файле ``openstack_user_config.yml``:

source: At the beginning of a playbook run, information about each host is gathered, such as:
ru: В начале выполнения плейбука собирается информация о каждом хосте, например:

source: At the completion of this operation the inventory will be restored to the earlier version.
ru: По завершении этой операции inventory будет восстановлен до предыдущей версии.

source: At this point you can minorly upgrade RabbitMQ with the following command:
ru: На этом этапе вы можете незначительно обновить RabbitMQ с помощью следующей команды:

source: Attach/Detach Interface
ru: Подключить/отсоединить интерфейс

source: Attach/Detach Volume
ru: Подключить/отключить диск

source: Authenticate using the username ``admin`` and password defined by the ``keystone_auth_admin_password`` option in the ``/etc/openstack_deploy/user_secrets.yml`` file.
ru: Выполните аутентификацию, используя имя пользователя ``admin`` и пароль, заданные параметром ``keystone_auth_admin_password`` в файле ``/etc/openstack_deploy/user_secrets.yml``.

source: Backup and restore the ``/etc/openstack_deploy/`` directory
ru: Резервное копирование и восстановление каталога ``/etc/openstack_deploy/``

source: Backup and restore your cloud
ru: Резервное копирование и восстановление вашего облака

source: Backup the existing OpenStack-Ansible configuration
ru: Резервное копирование существующей конфигурации OpenStack-Ansible

source: Before dropping the RabbitMQ container, it’s worth transitioning the RabbitMQ instance to the Maintenance mode, so it could offload its responsibilities to other cluster members and close connections to clients properly. You can use the following ad-hoc for that:
ru: Перед удалением контейнера RabbitMQ стоит перевести инстанс RabbitMQ в режим обслуживания, чтобы он мог переложить свои обязанности на других участников кластера и правильно закрыть соединения с клиентами. Для этого можно использовать следующую ad-hoc команду:

source: Before installing the infrastructure and OpenStack, update the host machines.
ru: Перед установкой инфраструктуры и окружения OpenStack обновите хосты.

source: Before starting with the upgrade, perform preflight health checks to ensure your environment is stable. If any of those checks fail, ensure that the issue is resolved before continuing.
ru: Прежде чем приступить к обновлению, выполните предварительную проверку работоспособности, чтобы убедиться в стабильности окружения. Если какая-либо из этих проверок не удалась, убедитесь, что проблема решена, прежде чем продолжать.

source: Before talking about ways on how to improve things, let’s quickly describe “starting point”, to understand what we’re dealing with at the starting point.
ru: Прежде чем говорить о способах улучшения ситуации, давайте кратко опишем "исходную точку", чтобы понять, с чем мы имеем дело на начальном этапе.

source: Being familiar with running ad-hoc Ansible commands is helpful when operating your OpenStack-Ansible deployment. For a review, we can look at the structure of the following Ansible command:
ru: Знакомство с выполнением ad-hoc команд Ansible полезно при работе с развертыванием OpenStack-Ansible. Для обзора мы можем рассмотреть структуру следующей команды Ansible:

source: Below you will find the support matrix of Operating Systems for OpenStack-Ansible releases.
ru: Ниже приведена матрица поддержки операционных систем для релизов OpenStack-Ansible.

source: Besides the live migration, Nova offers the option to migrate entire hosts in a online (live) or offline (cold) migration.
ru: Помимо живой миграции, Nova предлагает возможность миграции целых хостов в режиме онлайн (живой) или офлайн (холодной) миграции.

source: Beyond these requirements, a suggested order for upgrades is a follows:
ru: Помимо этих требований, предлагается следующий порядок обновления:

source: Block Storage service
ru: Служба блочного хранилища

source: Bootstrap Ansible again to ensure that all OpenStack-Ansible role dependencies are in place before you run playbooks from the |current_release_formal_name| release.
ru: Снова загрузите Ansible, чтобы убедиться, что все зависимости роли OpenStack-Ansible установлены, прежде чем запускать плейбуки из релиза |current_release_formal_name|.

source: Bootstrap the new Ansible and OpenStack-Ansible roles
ru: Загрузите новые роли Ansible и OpenStack-Ansible

source: Bulk pruning
ru: Массовая очистка

source: But which one is right for you? Well, it all depends on the situation you find yourself in.
ru: Но какой из них подходит именно вам? Все зависит от ситуации, в которой вы находитесь.

source: By default, OpenStack-Ansible relies on Ansible SSH connections, and needs the TCP port 22 to be opened on all hosts internally.
ru: По умолчанию OpenStack-Ansible использует SSH-подключения Ansible и требует, чтобы на всех хостах внутри был открыт TCP порт 22.

source: By default, OpenStack-Ansible stores all playbook logs in:
ru: По умолчанию OpenStack-Ansible хранит все логи плейбуков в:

source: By default, live migration assumes that your instances are stored on shared storage and KVM/Libvirt only need to synchronize the memory and base image of the instance to the new host. Live migrations on local storage will fail as a result of that assumption. Migrations with local storage can be accomplished by allowing instance disk migrations with the ``--block-migrate`` option.
ru: По умолчанию при живой миграции предполагается, что ваши инстансы хранятся в общем хранилище, и KVM/Libvirt нужно только синхронизировать память и базовый образ инстанса на новым хосте. В результате этого предположения живые миграции на локальном хранилище завершатся неудачей. Миграции на локальном хранилище можно выполнить, разрешив миграции дисков инстансов с помощью опции ``--block-migrate``.

source: By default, systemd journals are kept in memory and discarded after a reboot. OpenStack-Ansible sets the variable ``openstack_host_keep_journals: true`` by default, which persists journals across reboots. You can explicitly configure it in your ``user_variables.yml`` if needed:
ru: По умолчанию логи systemd хранятся в памяти и удаляются после перезагрузки. OpenStack-Ansible по умолчанию устанавливает переменную ``openstack_host_keep_journals: true``, которая сохраняет логи после перезагрузки. При необходимости вы можете явно настроить её в файле ``user_variables.yml``:

source: By doing this, the cluster can continue to run effectively and you can repair the failing node.
ru: Благодаря этому кластер сможет продолжать эффективно работать, а вы сможете отремонтировать неисправный узел.

source: Cached Ansible facts issues
ru: Проблемы с кэшированными фактами Ansible
