Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: ru

source: Cached facts may be incorrect if the host receives a kernel upgrade or new network interfaces. Newly created bridges also disrupt cache facts.
ru: Кэшированные факты могут быть некорректными, если хост получает обновление ядра или новые сетевые интерфейсы. Новые мосты также нарушают кэшированные факты.

source: Can the hardware replacement be done without the host going down? For example, a single disk in a RAID-10.
ru: Можно ли заменить оборудование без отключения хоста? Например, один диск в RAID-10.

source: Ceph related playbooks are included as part of ``openstack.osa.setup_infrastructure`` and ``openstack.osa.setup_openstack`` playbooks, so you should be cautious when running them during OpenStack upgrades. If you have ``upgrade_ceph_packages: true`` in your user variables or provided ``-e upgrade_ceph_packages=true`` as argument and run ``setup-infrastructure.yml`` this will result in Ceph package being upgraded as well.
ru: Плейбуки, связанные с Ceph, включены в состав плейбуков ``openstack.osa.setup_infrastructure`` и ``openstack.osa.setup_openstack``, поэтому следует быть осторожным при их запуске во время обновления OpenStack. Если в пользовательских переменных указано ``upgrade_ceph_packages: true`` или в качестве аргумента задан ``-e upgrade_ceph_packages=true`` и запущен ``setup-infrastructure.yml``, это приведет к тому, что пакет Ceph также будет обновлен.

source: Change directory to the cloned repository's root directory:
ru: Измените каталог на клонированный корневой каталог репозитория:

source: Change directory to the repository clone root directory:
ru: Измените каталог на корневой каталог клона репозитория:

source: Change to playbook folder on the deployment host:
ru: Перейдите в папку плейбука на хосте развертывания:

source: Change to the ``playbooks`` directory and run the following Ansible command to determine the failed node:
ru: Перейдите в каталог ``playbooks`` и выполните следующую команду Ansible, чтобы определить неисправный узел:

source: Change to the playbooks directory:
ru: Перейдите в каталог плейбука:

source: Changes the flavor of an instance (increase) while rebooting and also migrates (cold) the instance to a new host to accommodate the new resource requirements. This operation can take considerate amount of time, depending disk image sizes.
ru: Изменяет шаблон конфигурации (увеличивает) при перезагрузке, а также переносит (холодная миграция) инстанс на новый хост для удовлетворения новых требований к ресурсам. Эта операция может занять значительное время в зависимости от размера образа диска.

source: Check "gateway" or host routes on the Neutron subnet.
ru: Проверьте "шлюз" или маршруты хоста в подсети Neutron.

source: Check Floating IP associations (if applicable).
ru: Проверьте привязки плавающего IP (если применимо).

source: Check Neutron DHCP agent logs.
ru: Проверьте журналы агента DHCP Neutron.

source: Check Neutron Floating IP associations (if applicable).
ru: Проверьте привязки плавающего IP Neutron (если применимо).

source: Check Neutron L3 agent logs (if applicable).
ru: Проверьте журналы L3 агента (если применимо).

source: Check Neutron Open vSwitch agent logs.
ru: Проверьте журналы агента Neutron Open vSwitch.

source: Check Neutron Open vSwitch logs.
ru: Проверьте журналы Neutron Open vSwitch.

source: Check Neutron Router external gateway information (if applicable).
ru: Проверьте информацию о внешнем шлюзе маршрутизатора Neutron (если применимо).

source: Check Neutron router ports (if applicable).
ru: Проверьте порты маршрутизатора Neutron (если применимо).

source: Check Nova console logs to see if the instance ever received its IP address initially.
ru: Проверьте логи консоли Nova, чтобы узнать, получал ли инстанс свой IP-адрес изначально.

source: Check VLAN configurations and any necessary trunking to edge ports on physical switch
ru: Проверьте конфигурацию VLAN и все необходимые транковые соединения с пограничными портами на физическом коммутаторе.

source: Check VLAN configurations and any necessary trunking to uplink ports on physical switches (if applicable)
ru: Проверьте конфигурацию VLAN и все необходимые транковые соединения с uplink портами на физических коммутаторах (если применимо).

source: Check VTEP learning method (multicast or l2population):
ru: Проверьте метод обучения VTEP (multicas или l2population):

source: Check ``br-vxlan`` interface on Compute and Network nodes
ru: Проверьте интерфейс ``br-vxlan`` на вычислительных и сетевых узлах

source: Check ``security-group-rules``, consider adding ICMP rule for testing.
ru: Проверьте правила группы безопасности, рассмотрите возможность добавления правила ICMP для тестирования.

source: Check ``security-group-rules``, consider adding allow ICMP rule for testing.
ru: Проверьте правила группы безопасности, подумайте о добавлении правила разрешения ICMP для тестирования.

source: Check any OpenStack-Ansible variables which you customise to ensure that they take into account the new and old operating system version (for example custom package repositories and version pinning).
ru: Проверьте все переменные OpenStack-Ansible, которые вы настраиваете, чтобы убедиться, что они учитывают новую и старую версию операционной системы (например, пользовательские репозитории пакетов и привязка версий).

source: Check cable, seating, physical switchport configuration, interface/bonding configuration, and general network configuration. See general network troubleshooting documentation.
ru: Проверьте кабель, соединение, конфигурацию физического порта коммутатора, конфигурацию интерфейса/агреграции и общую конфигурацию сети. См. общую документацию по устранению неполадок в сети.

source: Check gateway or host routes on the Neutron subnet.
ru: Проверьте маршруты шлюза или хоста в подсети Neutron.

source: Check interface bonding (if applicable)
ru: Проверьте агрегирование интерфейсов (если применимо)

source: Check ml2 config file for local VXLAN IP and other VXLAN configuration settings.
ru: Проверьте файл конфигурации ml2 на наличие локального IP-адреса VXLAN и других параметров конфигурации VXLAN.

source: Check nova console logs to see if the instance ever received its IP address initially.
ru: Проверьте журналы консоли nova, чтобы узнать, получал ли инстанс свой IP-адрес изначально.

source: Check out the |current_release_formal_name| release
ru: Проверьте релиз |current_release_formal_name|.

source: Check physical connectivity of hosts to physical network
ru: Проверьте физическое подключение хостов к физической сети

source: Check physical interface mappings.
ru: Проверьте сопоставление физических интерфейсов.

source: Check syslogs.
ru: Проверьте системные журналы.

source: Check that Bridge Forwarding Database (fdb) contains the proper entries on both the compute and Neutron agent container.
ru: Убедитесь, что fdb таблица содержит нужные записи как на вычислительном, так и на сетевом контейнере агента Neutron.

source: Check that OVS bridges contain the proper interfaces on compute and network nodes.
ru: Проверьте, что мосты OVS содержат правильные интерфейсы на вычислительных и сетевых узлах.

source: Check that hosts are in the same IP subnet or have proper routing between them
ru: Убедитесь, что узлы находятся в одной IP-подсети или между ними установлена правильная маршрутизация

source: Check that hosts are in the same subnet or have proper routing between them
ru: Убедитесь, что хосты находятся в одной подсети или между ними установлена правильная маршрутизация

source: Check the **Actions** column, and click on the down arrow. Select the action.
ru: Проверьте столбец **Действия** и нажмите на стрелку, указанную вниз. Выберите действие.

source: Check the :guilabel:`Launch Instance` dialog, and find the :guilabel:`Details` tab. Enter the appropriate values for the instance.
ru: Откройте диалоговое окно :guilabel:`Запуск инстанса` и перейдите во вкладку :guilabel:`Детали`. Введите соответствующие значения для инстанса.

source: Check the RabbitMQ cluster status
ru: Проверьте состояние кластера RabbitMQ

source: Check the backend API health on your load balancer nodes. For example, if using HAProxy, ensure no backend is marked as "DOWN":
ru: Проверьте работоспособность API бекэнда на узлах балансировщика нагрузки. Например, если вы используете HAProxy, убедитесь, что ни один бекэнд не отмечен как "DOWN":

source: Check there are no iptables applied to the hosts that would deny traffic
ru: Убедитесь, что к хостам не применены iptables, которые запрещают трафик

source: Check to verify that physcial interface is in the bridge
ru: Проверьте, находится ли физический интерфейс в мосту

source: Check to verify that physical interface is in the bridge
ru: Проверьте, находится ли физический интерфейс в составе моста

source: Check to verify that veth-pair end from container is in ``br-mgmt``
ru: Убедитесь, что конец veth-пары из контейнера находится в ``br-mgmt``

source: Check to verify that veth-pair end from container is in ``br-vxlan``
ru: Проверьте, что конец veth-пары из контейнера находится в ``br-vxlan``

source: Check upstream routes, NATs or ``access-control-lists``.
ru: Проверьте вышестоящие маршруты, NAT или ``списки контроля доступа``.

source: Check upstream routes, NATs or access-control-lists.
ru: Проверьте вышестоящие маршруты, NAT или списки контроля доступа.

source: Check veth pairs between containers and Linux bridges on the host.
ru: Проверьте пары veth между контейнерами и мостами Linux на хосте.

source: Check your OpenStack-Ansible cloud
ru: Проверка вашего облака OpenStack-Ansible

source: Checking services
ru: Проверка служб

source: Cinder attached volumes also require a Libvirt version larger or equal to 1.2.17.
ru: Для присоединенных дисков Cinder также требуется версия Libvirt не ниже 1.2.17.

source: Clean up the removed container from the inventory:
ru: Уберите удаленный контейнер из inventory:

source: Clear out stale ansible-facts
ru: Удалите устаревшие факты из ansible-facts

source: Clearing out stale information
ru: Очистка от устаревшей информации

source: Click :guilabel:`Launch` to create the instance. The instance will start on a compute node. The **Instances** page will open and start creating a new instance. The **Instances** page that opens will list the instance name, size, status, and task. Power state and public and private IP addresses are also listed here.
ru: Нажмите :guilabel:`Запустить`, чтобы создать инстанс. Инстанс запустится на вычислительном узле. Откроется страница **Инстансы**, на которой начнется создание нового инстанса. На открывшейся странице **Инстансы** будут отображены имя инстанса, его размер, статус и задача. Здесь также отображаются состояние питания и публичные и частные IP-адреса.

source: Click the :guilabel:`Create Image` button. The **Create an Image** dialog box will appear.
ru: Нажмите кнопку :guilabel:`Создать образ`. Появится диалоговое окно **Создать образ**.

source: Click the :guilabel:`Create Image` button. The newly created image may take some time before it is completely uploaded since the image arrives in an image queue.
ru: Нажмите кнопку :guilabel:`Создать образ`. Создание нового образа может занять некоторое время, так как он попадает в очередь образов.

source: Click the :guilabel:`Keypair` tab and select the keypair or create new one.
ru: Перейдите во вкладку :guilabel:`Ключевая пара` и выберите пару ключей или создайте новую.

source: Click the :guilabel:`Networks tab`. This tab will be unavailable if Network service (neutron) has not been enabled. If networking is enabled, select the networks on which the instance will reside.
ru: Нажмите на вкладку :guilabel:`Сети`. Эта вкладка будет недоступна, если сетевая служба (neutron) не включена. Если служба включена, выберите сети, в которых будет находиться инстанс.

source: Click the :guilabel:`Security Groups` tab and set the security group as "default".
ru: Перейдите во вкладку :guilabel:`Группы безопасности` и установите группу безопасности "по умолчанию".

source: Click the :guilabel:`Source`. In the Source step, select the boot source: Image, Volume (Volume Snapshot), or Instance Snapshot. If you choose Image, pick the desired OS or custom image from the list to boot your instance. Volume option will only be available if Block Storage service (cinder) is enabled.
ru: Нажмите :guilabel:`Источник`. На шаге "Источник" выберите источник загрузки: образ, диск (снимок диска) или снимок инстанса. Если вы выбрали "Образ", выберите нужную ОС или пользовательский образ из списка для загрузки инстанса. Опция "Диск" будет доступна только в том случае, если включена служба блочного хранилища (cinder).

source: Clone the ``openstack-ansible-ops`` repository to your deployment host:
ru: Склонируйте репозиторий ``openstack-ansible-ops`` на ваш хост развертывания:

source: Commands
ru: Команды

source: Commands below will configure all required backends on HAProxy nodes:
ru: Команды ниже настроят все необходимые бекенды на узлах HAProxy:

source: Compare the output of the following command with the following output. It should give you information about the status of your cluster.
ru: Сравните вывод следующей команды со следующим выводом. Он должен предоставить вам информацию о состоянии вашего кластера.

source: Compatability matrix for legacy releases of OpenStack-Ansible can be found on this page: :ref:`compatibility-matrix-legacy`.
ru: Матрицу совместимости для устаревших релизов OpenStack-Ansible можно найти на этой странице: :ref:`compatibility-matrix-legacy`.

source: Compatibility Matrix
ru: Матрица совместимости

source: Compatibility Matrix of Legacy releases
ru: Матрица совместимости устаревших версий

source: Compute nodes
ru: Вычислительные узлы

source: Compute nodes should have their UUID stored in the file '/var/lib/nova/compute_id' and the 'nova-compute' service restarted. UUIDs can be found from the command line'openstack hypervisor list'.
ru: Вычислительные узлы должны иметь свой UUID в файле ``/var/lib/nova/compute_id``, а служба "nova-compute" должна быть перезапущена. UUID можно найти, выполнив в командной строке ``openstack hypervisor list``.

source: Compute service (compute node)
ru: Вычислительная служба (вычислительный узел)

source: Compute service (controller node)
ru: Вычислительная служба (управляющий узел)

source: Conclusion
ru: Заключение

source: Configure the host as a target host. See the :deploy_guide:`target hosts configuration section <targethosts.html>` of the deploy guide for more information.
ru: Настройте хост в качестве целевого узла. Дополнительные сведения см. в :deploy_guide:`разделе конфигурации целевых хостов <targethosts.html>` руководства по развертыванию.

source: Configure your first networks
ru: Настройка ваших первых сетей

source: Configures HAProxy for routing traffic between services. Use this tag if HAProxy settings change or a new service backend is added.
ru: Настраивает HAProxy для маршрутизации трафика между службами. Используйте этот тег при изменении настроек HAProxy или добавлении нового бэкенда службы.

source: Configures a specific OpenStack service (replace <service> with the service name). This tag applies configuration files, directories, and service-specific settings. It usually covers a broad set of tasks beyond post-install, and may include systemd-service, pki, common-mq or common-db service tags. Run this tag when applying updated configurations to a service that is already installed.
ru: Настраивает определенную службу OpenStack (замените <service> на имя службы). Этот тег применяет файлы конфигурации, каталоги и настройки, специфичные для данной службы. Обычно он охватывает широкий набор задач, выходящих за рамки задач после установки, и может включать теги служб systemd-service, pki, common-mq или common-db. Используйте этот тег при применении обновленных конфигураций к уже установленной службе.

source: Configuring journald
ru: Конфигурирование journald

source: Confirm all instances are down:
ru: Убедитесь, что все инстансы выключены:

source: Consider the following to help establish a hardware replacement plan:
ru: При разработке плана замены оборудования учитывайте следующее:

source: Consult the rabbitmqctl manpage for more information.
ru: Более подробную информацию можно найти на странице руководства rabbitmqctl.

source: Container management
ru: Управление контейнерами

source: Container networking issues
ru: Проблемы работы сетей контейнеров

source: Contents
ru: Содержание

source: Continue!
ru: Продолжайте!

source: Convert it to something like this:
ru: Преобразуйте его в нечто подобное:

source: Create a RabbitMQ cluster
ru: Создание кластера RabbitMQ

source: Create new containers on the destination host:
ru: Создайте новые контейнеры на хосте назначения:

source: Create the container on the new infra node:
ru: Создайте контейнер на новом инфраструктурном узле:

source: Creates and configures databases, including user creation, and permission assignments. Run this tag if database credential or permissions need to be refreshed or corrected.
ru: Создает и настраивает базы данных, включая создание пользователей и назначение разрешений. Используйте этот тег, если необходимо обновить или исправить учетные данные или разрешения базы данных.

source: Creating an instance using the Dashboard
ru: Создание инстанса с помощью панели управления

source: Creating an instance using the command line
ru: Создание инстанса с помощью командной строки

source: Critically, it is important to consider when you upgrade 'repo' hosts/containers. At least one 'repo' host should be upgraded before you upgrade any API hosts/containers. The last 'repo' host to be upgraded should be the 'primary', and should not be carried out until after the final service which does not support '--limit' is upgraded.
ru: Очень важно учитывать, когда вы обновляете хосты/контейнеры "репозиториев" Перед обновлением хостов/контейнеров API следует обновить хотя бы один хост "репозитория". Последний обновляемый хост "репозитория" должен быть "основным", и его обновление должно выполняться только после обновления последней службы, который не поддерживает "--limit".

source: Database backups and recovery
ru: Резервное копирование и восстановление базы данных

source: Declaratively (list of cluster nodes in a config, with ``rabbitmq-autocluster``, or ``rabbitmq-clusterer`` plugins)
ru: Декларативно (список узлов кластера в конфигурации с плагинами ``rabbitmq-autocluster`` или ``rabbitmq-clusterer``)

source: Default Log File
ru: Лог-файл по умолчанию

source: Define new groups for RabbitMQ and MariaDB. For that, you can create files with the following content: ``/etc/openstack_deploy/env.d/galera-neutron.yml``:
ru: Определите новые группы для RabbitMQ и MariaDB. Для этого можно создать файлы со следующим содержанием: ``/etc/openstack_deploy/env.d/galera-neutron.yml``:

source: Define redeployed host as environment variable
ru: Определить повторно развернутый хост как переменную среды

source: Define some specific configurations for newly created groups and balance them:
ru: Определите некоторые конкретные конфигурации для вновь созданных групп и сбалансируйте их:

source: Define the variable openstack_resources_network according to the structure in the role `defaults <https://opendev.org/openstack/openstack-ansible-plugins/src/branch/master/roles/openstack_resources/defaults/main.yml#L100-L143>`
ru: Определите переменную openstack_resources_network в соответствии со структурой в роли `defaults <https://opendev.org/openstack/openstack-ansible-plugins/src/branch/master/roles/openstack_resources/defaults/main.yml#L100-L143>`

source: Delete the instance under the **Actions** column.
ru: Удалите инстанс в столбце **Действия**.

source: Depending on the OpenStack-Ansible version in use, Nova can be configured to force configuration drive attachments to instances. In this case, a ISO9660 CD-ROM image will be made available to the instance via the ``/mnt`` mount point. This can be used by tools, such as cloud-init, to gain access to instance metadata. This is an alternative way of accessing the Nova EC2-style Metadata.
ru: В зависимости от используемой версии OpenStack-Ansible, Nova можно настроить на принудительное подключение привода к инстансам. В этом случае образ CD-ROM ISO9660 будет доступен инстансу через точку монтирования ``/mnt``. Это может использоваться такими инструментами, как cloud-init, для получения доступа к метаданным инстанса. Это альтернативный способ доступа к метаданным Nova в стиле EC2.

source: Deploy MariaDB there and add it to the cluster:
ru: Разверните MariaDB там и добавьте его в кластер:

source: Deploy RabbitMQ on the new host and enroll it to the cluster:
ru: Разверните RabbitMQ на новом хосте и добавьте его в кластер:

source: Deploy clusters:
ru: Разверните кластеры:

source: Deploying Compute and Network Hosts
ru: Развертывание вычислительных и сетевых узлов

source: Deploying Infrastructure Hosts
ru: Развертывание узлов инфраструктуры

source: Deploys and configures Ceph clients and related components. Use this tag for tasks such as adding new monitors or upgrading Ceph clients to a different version, as well as other Ceph-related configuration updates.
ru: Развертывает и настраивает клиенты Ceph и связанные с ними компоненты. Используйте этот тег для таких задач, как добавление новых мониторов или обновление клиентов Ceph до другой версии, а также для других обновлений конфигурации, связанных с Ceph.

source: Destroy and recreate containers
ru: Удаление и пересоздание контейнеров

source: Destroy the container and remove MariaDB data stored outside of the container:
ru: Удалите контейнер и удалите данные MariaDB, хранящиеся за пределами контейнера:

source: Destroying containers
ru: Удаление контейнеров

source: Details
ru: Подробности

source: Diagnose Image service issues
ru: Диагностика проблем, связанных с службой образов

source: Disable HAProxy back ends (optional)
ru: Отключите бекэнды HAProxy (необязательно)

source: Disable all OpenStack services running on the compute node. This can include, but is not limited to, the ``nova-compute`` service and the neutron agent service:
ru: Отключите все службы OpenStack, запущенные на вычислительном узле. Это может не ограничиваться службой ``nova-compute`` и службой агента neutron:

source: Disable the ``cinder-volume`` service:
ru: Отключите службу ``cinder-volume``:

source: Disable the ``nova-compute`` binary:
ru: Отключите ``nova-compute``:

source: Disable the failed node on the load balancer.
ru: Отключите неисправный узел на балансировщике нагрузки.

source: Disable the hypervisor service on compute hosts and migrate any instances to another available hypervisor.
ru: Отключите службу гипервизора на вычислительных узлах и переведите все инстансы на другой доступный гипервизор.

source: Distribution upgrades
ru: Обновления дистрибутива

source: Do generic preparation of reinstalled host
ru: Выполните общую подготовку переустановленного хоста

source: Do not continue until VXLAN endpoints have reachability to each other.
ru: Не продолжайте работу до тех пор, пока точки доступа VXLAN не будут доступны друг другу.

source: Do not continue until instance has an IP address and can reach local network resources like DHCP.
ru: Не продолжайте, пока инстанс не получит IP-адрес и не сможет обращаться к ресурсам локальной сети, например DHCP.

source: Do not continue until instance has an IP address and can reach local network resources.
ru: Не продолжайте, пока инстанс не получит IP-адрес и не сможет обращаться к ресурсам локальной сети.

source: Do not continue until physical network is properly configured.
ru: Не продолжайте работу, пока физическая сеть не будет правильно настроена.
