Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: ru

source: OpenStack services use RabbitMQ for Advanced Message Queuing Protocol (AMQP). OpenStack-Ansible deploys RabbitMQ in a clustered configuration with all queues mirrored between the cluster nodes. Because Telemetry (ceilometer) message queue traffic is quite heavy, for large environments we recommend separating Telemetry notifications into a separate RabbitMQ cluster.
ru: Службы OpenStack используют RabbitMQ для Advanced Message Queuing Protocol (AMQP). OpenStack-Ansible развертывает RabbitMQ в кластерной конфигурации со всеми очередями, зеркально отраженными между узлами кластера. Поскольку трафик очереди сообщений Telemetry (ceilometer) довольно большой, для больших сред мы рекомендуем разделить уведомления Telemetry в отдельный кластер RabbitMQ.

source: OpenStack-Ansible (OSA) has a flexible deployment configuration model that can deploy all services in separate machine containers or on designated hosts without using containers, and all network traffic either on a single network interface or on many network interfaces.
ru: OpenStack-Ansible (OSA) имеет гибкую модель конфигурации развертывания, которая позволяет развертывать все службы в отдельных контейнерах машин или на назначенных хостах без использования контейнеров, а весь сетевой трафик — либо на одном сетевом интерфейсе, либо на нескольких сетевых интерфейсах.

source: OpenStack-Ansible (OSA) uses the `Ansible <https://docs.ansible.com/ansible/latest/getting_started/index.html>`_ IT automation engine to deploy an OpenStack environment on Ubuntu, Debian and CentOS Stream (including derivatives like Rocky Linux).
ru: OpenStack-Ansible (OSA) использует `Ansible <https://docs.ansible.com/ansible/latest/getting_started/index.html>`_ — механизм автоматизации для развертывания среды OpenStack на Ubuntu, Debian и CentOS Stream (включая производные, такие как Rocky Linux).

source: OpenStack-Ansible Manifesto
ru: Манифест OpenStack-Ansible

source: OpenStack-Ansible Reference
ru: Справочник OpenStack-Ansible

source: OpenStack-Ansible configures unique username and password combinations for each service that interacts with RabbitMQ and Galera/MariaDB. Each service that connects to RabbitMQ uses a separate virtual host for publishing and consuming messages. The MariaDB users for each service are only granted access only to the databases that they need to query.
ru: OpenStack-Ansible настраивает уникальные комбинации имени пользователя и пароля для каждой службы, которая взаимодействует с RabbitMQ и Galera/MariaDB. Каждая служба, которая подключается к RabbitMQ, использует отдельный виртуальный хост для публикации и потребления сообщений. Пользователям MariaDB для каждой службы предоставляется доступ только к тем базам данных, к которым им нужно обращаться с запросами.

source: OpenStack-Ansible currently uses `AppArmor`_ to provide MAC policies on infrastructure servers and hypervisors. The AppArmor configuration sets the access policies to prevent one container from accessing the data of another container. For virtual machines, ``libvirtd`` uses the `sVirt`_ extensions to ensure that one virtual machine cannot access the data or devices from another virtual machine.
ru: OpenStack-Ansible в настоящее время использует `AppArmor`_ для предоставления политик MAC на серверах инфраструктуры и гипервизорах. Конфигурация AppArmor устанавливает политики доступа, чтобы предотвратить доступ одного контейнера к данным другого контейнера. Для виртуальных машин ``libvirtd`` использует расширения `sVirt`_, чтобы гарантировать, что одна виртуальная машина не сможет получить доступ к данным или устройствам другой виртуальной машины.

source: OpenStack-Ansible deploys HAProxy back ends for each service and restricts access for highly sensitive services by making them available only on the management network. Deployers with external load balancers must ensure that the back ends are configured securely and that firewalls prevent traffic from crossing between networks.
ru: OpenStack-Ansible развертывает бекэнды HAProxy для каждой службы и ограничивает доступ к высокочувствительным службам, делая их доступными только в сети управления. Разработчики с внешними балансировщиками нагрузки должны убедиться, что бекэнды настроены безопасно, а брандмауэры предотвращают пересечение трафика между сетями.

source: OpenStack-Ansible deploys Linux containers (LXC) and uses Linux or Open vSwitch-based bridging between the container and the host interfaces to ensure that all traffic from containers flows over multiple host interfaces. All services in this deployment model use a *unique* IP address.
ru: OpenStack-Ansible развертывает контейнеры Linux (LXC) и использует мосты на основе Linux или Open vSwitch между контейнером и интерфейсами хоста, чтобы гарантировать, что весь трафик из контейнеров проходит через несколько интерфейсов хоста. Все службы в этой модели развертывания используют *уникальный* IP-адрес.

source: OpenStack-Ansible deploys the following infrastructure components:
ru: OpenStack-Ansible развертывает следующие компоненты инфраструктуры:

source: OpenStack-Ansible directory checkout
ru: Извлечение каталога OpenStack-Ansible

source: OpenStack-Ansible enables you to reference any options in the `OpenStack Configuration Reference`_ through the use of a simple set of configuration entries in the ``/etc/openstack_deploy/user_variables.yml``.
ru: OpenStack-Ansible позволяет ссылаться на любые параметры в `Справочнике по конфигурации OpenStack`_ с помощью простого набора записей конфигурации в ``/etc/openstack_deploy/user_variables.yml``.

source: OpenStack-Ansible frequently does proactive bugfix backports. In order to reduce the risk of these backports introducing any destabilization, OpenStack-Ansible implements a 'soak' period for any patches implemented in the stable branches for roles, but also provides for circumventing this in exceptional circumstances.
ru: OpenStack-Ansible часто выполняет упреждающие бэкпорты исправления ошибок. Чтобы снизить риск того, что эти бэкпорты внесут какую-либо дестабилизацию, OpenStack-Ansible реализует период 'выдержки' для любых исправлений, реализованных в стабильных ветвях для ролей, но также предусматривает обход этого в исключительных обстоятельствах.

source: OpenStack-Ansible is able to deploy a multitude of services. Have a look at the role maturity matrix to know the status of the service you want to deploy.
ru: OpenStack-Ansible может развертывать множество сервисов. Посмотрите на матрицу зрелости ролей, чтобы узнать статус сервиса, который вы хотите развернуть.

source: OpenStack-Ansible provides a comprehensive `security hardening role`_ that applies over 200 security configurations as recommended by the `Security Technical Implementation Guide`_ (STIG) provided by the Defense Information Systems Agency (DISA). These security configurations are widely used and are distributed in the public domain by the United States government.
ru: OpenStack-Ansible предоставляет комплексную `роль усиления безопасности`_, которая применяет более 200 конфигураций безопасности, рекомендованных `Руководством по технической реализации безопасности`_ (STIG), предоставленным Агентством оборонных информационных систем (DISA). Эти конфигурации безопасности широко используются и распространяются в открытом доступе правительством США.

source: OpenStack-Ansible provides safe defaults for deployers in its group_vars folder. They take care of the wiring between different roles, like for example storing information on how to reach RabbitMQ from nova role.
ru: OpenStack-Ansible предоставляет безопасные значения по умолчанию для развертывателей в своей папке group_vars. Они заботятся о связях между различными ролями, например, хранят информацию о том, как получить доступ к RabbitMQ из роли nova.

source: OpenStack-Ansible provides two overrides when defining provider networks that can be used for creating the mappings and in some cases, connecting the physical interfaces to provider bridges:
ru: OpenStack-Ansible предоставляет два переопределения при назначении сетей провайдера, которые можно использовать для создания отображений и, в некоторых случаях, для подключения физических интерфейсов к мостам провайдера:

source: OpenStack-Ansible supports deploying OpenStack and related services on "metal" as well as inside LXC containers. Python virtual environments (venvs) provide OpenStack service and Python library segregation, while other services such as Galera and RabbitMQ are co-located on the host. All services in this deployment model share the *same* IP address.
ru: OpenStack-Ansible поддерживает развертывание OpenStack и связанных сервисов на "металле", а также внутри контейнеров LXC. Виртуальные среды Python (venvs) обеспечивают слеужбу OpenStack и разделение библиотек Python, в то время как другие сервисы, такие как Galera и RabbitMQ, размещаются на хосте. Все сервисы в этой модели развертывания используют *один и тот же* IP-адрес.

source: OpenStack-Ansible uses Linux bridges for control plane connections to LXC containers, and can use Linux bridges or Open vSwitch-based bridges for data plane connections that connect virtual machine instances to the physical network infrastructure.
ru: OpenStack-Ansible использует мосты Linux для подключений плоскости управления (control plane) к контейнерам LXC и может использовать мосты Linux или мосты на основе Open vSwitch для подключений плоскости данных (data plane), которые соединяют инстансы виртуальных машин с физической сетевой инфраструктурой.

source: OpenStack-Ansible uses an included script to generate the inventory of hosts and containers within the environment. This script is called by Ansible through its `dynamic inventory functionality <https://docs.ansible.com/ansible/latest/inventory_guide/intro_dynamic_inventory.html>`_.
ru: OpenStack-Ansible использует включенный скрипт для генерации inventory хостов и контейнеров в окружении. Этот скрипт вызывается Ansible через его `функцию динамического inventory <https://docs.ansible.com/ansible/latest/inventory_guide/intro_dynamic_inventory.html>`_.

source: OpenStack-Ansible uses the 'cycle-trailing' release model as specified in the OpenStack `release model reference`_.
ru: OpenStack-Ansible использует модель выпуска 'циклического отставания', как указано в `справочнике модели выпуска`_ OpenStack.

source: OpenStack-Ansible wrapper
ru: Оболочка OpenStack-Ansible

source: Operations taken by this script only affect the ``/etc/opentstack_deploy/openstack_inventory.json`` file; any new or removed information must be set by running playbooks.
ru: Операции, выполняемые этим скриптом, влияют только на файл ``/etc/opentstack_deploy/openstack_inventory.json``; любая новая или удаленная информация должна быть установлена ​​путем запуска плейбуков.

source: Our ``openstack-ansible`` cli is located in ``/usr/local/bin/openstack-ansible``. It sources an environment variable file located in: ``/usr/local/bin/openstack-ansible.rc``.
ru: Наш ``openstack-ansible`` cli находится в ``/usr/local/bin/openstack-ansible``. Он использует файл переменных среды, расположенный в: ``/usr/local/bin/openstack-ansible.rc``.

source: Outputs
ru: Выводы

source: Overriding .conf files
ru: Переопределение файлов .conf

source: Overriding .json files
ru: Переопределение файлов .json

source: Overriding .yml files
ru: Переопределение файлов .yml

source: Overriding OpenStack configuration defaults
ru: Переопределение настроек OpenStack по умолчанию

source: Overriding OpenStack upper constraints
ru: Переопределение ограничений версий пакетов OpenStack

source: Overriding default configuration
ru: Переопределение конфигурации по умолчанию

source: Physical host interfaces
ru: Интерфейсы физических хостов

source: Please refer to the :ref:`inventory` section of this reference.
ru: Пожалуйста, обратитесь к разделу :ref:`inventory` данного справочника.

source: Possible additional overrides can be found in the "Tunable Section" of each role's ``main.yml`` file, such as ``/etc/ansible/roles/role_name/defaults/main.yml``.
ru: Возможные дополнительные переопределения можно найти в «Настраиваемом разделе» файла ``main.yml`` каждой роли, например ``/etc/ansible/roles/role_name/defaults/main.yml``.

source: Prevents unauthorized network surveillance
ru: Предотвращает несанкционированное сетевое наблюдение

source: Previous versions of OpenStack-Ansible utilized a bridge named ``br-vlan`` for flat and vlan-based provider and tenant network traffic. The ``br-vlan`` bridge is a leftover of containerized Neutron agents and is no longer useful or recommended.
ru: Предыдущие версии OpenStack-Ansible использовали мост с именем ``br-vlan`` для плоского и vlan трафика провайдера и пользователя. Мост ``br-vlan`` является остатком контейнерных агентов Neutron и больше не полезен и не рекомендуется.

source: Project scope
ru: Рамки проекта

source: Python wheels for all services that are deployed in the environment
ru: Python wheels для всех служб, развернутых в среде

source: Reduces damage from unknown or unpatched service vulnerabilities
ru: Снижает ущерб от неизвестных или неисправленных уязвимостей служб

source: Reduces the chance of credential theft
ru: Снижает вероятность кражи учетных данных

source: Releases
ru: Релизы

source: Remove the ``physical_skel`` link between the container group and the host group by deleting the related file located in the ``env.d/`` directory.
ru: Удалите связь ``physical_skel`` между группой контейнеров и группой хостов, удалив соответствующий файл, расположенный в каталоге ``env.d/``.

source: Removing a group
ru: Удаление группы

source: Removing a host
ru: Удаление хоста

source: Repository
ru: Репозиторий

source: Role defaults
ru: Значения по умолчанию для роли

source: Role vars
ru: Переменные роли

source: Roles within the OpenStack-Ansible umbrella are built using Ansible best practices and contain namespaced variables that are *human* understandable. All roles are independant of each other and testable separately.
ru: Роли в рамках OpenStack-Ansible построены с использованием лучших практик Ansible и содержат переменные пространства имен, которые понятны *человеку*. Все роли независимы друг от друга и могут быть протестированы отдельно.

source: Run as quickly as possible
ru: Выполняться как можно быстрее

source: Run the following command:
ru: Выполните следующую команду:

source: Running with tox
ru: Выполнение с tox

source: Securing network access to OpenStack services
ru: Обеспечение безопасности сетевого доступа к службам OpenStack

source: Security
ru: Безопасность

source: Security is one of the top priorities within OpenStack-Ansible (OSA), and many security enhancements for OpenStack clouds are available in deployments by default. This section provides a detailed overview of the most important security enhancements.
ru: Безопасность является одним из главных приоритетов в OpenStack-Ansible (OSA), и многие улучшения безопасности для облаков OpenStack доступны в развертываниях по умолчанию. В этом разделе представлен подробный обзор наиболее важных улучшений безопасности.

source: Service architecture
ru: Архитектура службы

source: Services that *all end users* can access
ru: Службы, к которым могут получить доступ *все конечные пользователи*

source: Services that *only administrators or operators* can access
ru: Службы, к которым могут получить доступ *только администраторы или операторы*

source: Setting overrides in configuration files with config_template
ru: Установка переопределений в файлах конфигурации с помощью config_template

source: Shared Filesystems storage (manila)
ru: Хранилище общих файловых систем (manila)

source: Should an ``env.d`` directory be found in the directory specified by ``--config``, its contents will be added to the base environment, overriding any previous contents in the event of conflicts.
ru: Если каталог ``env.d`` будет найден в каталоге, указанном с ``--config``, его содержимое будет добавлено в базовую среду, перезаписав любое предыдущее содержимое в случае конфликтов.

source: Show container details including operational state, resource utilization, and ``veth`` pairs:
ru: Показать сведения о контейнере, включая рабочее состояние, использование ресурсов и пары ``veth``:

source: Some Ansible collections may require presence of specific Python libraries inside execution environment. In order to accomplish that deployer can create ``/etc/openstack_deploy/user-ansible-venv-requirements.txt`` file with a list of Python libraries that should be installed inside virtual environment along with Ansible during ``bootstrap-ansible.sh`` execution.
ru: Некоторые коллекции Ansible могут потребовать наличия определенных библиотек Python внутри среды выполнения. Чтобы добиться этого, оператор может создать файл ``/etc/openstack_deploy/user-ansible-venv-requirements.txt`` со списком библиотек Python, которые должны быть установлены внутри виртуальной среды вместе с Ansible во время выполнения ``bootstrap-ansible.sh``.

source: Some roles, like uwsgi, are used for lot of roles, and have "special" overrides, (like `uwsgi_ini_overrides`) which can be defined to impact all services which are using uwsgi. These variables are "special" as they will have precedence over role defined `*_uwsgi_ini_overrides`.
ru: Некоторые роли, такие как uwsgi, используются для множества ролей и имеют "специальные" переопределения (например, `uwsgi_ini_overrides`), которые можно определить для воздействия на все службы, использующие uwsgi. Эти переменные являются "специальными", поскольку они будут иметь приоритет над определенными для роли `*_uwsgi_ini_overrides`.

source: Source based deployments
ru: Развертывания на основе исходного кода

source: Start a container:
ru: Запустить контейнер:

source: Starting with the Zed release a ``user.rc`` file can be placed in ``OSA_CONFIG_DIR`` (/etc/openstack_deploy) folder and contain any environment variable definitions that might be needed to change the default behaviour or any arbitrary `Ansible configuration`_ parameter. These environment variables are general purpose and are not limited to those understood by Ansible.
ru: Начиная с релиза Zed файл ``user.rc`` может быть помещен в папку ``OSA_CONFIG_DIR`` (/etc/openstack_deploy) и содержать любые определения переменных среды, которые могут потребоваться для изменения поведения по умолчанию или любого произвольного параметра `Ansible configuration`_. Эти переменные среды являются переменными общего назначения и не ограничиваются теми, которые понимает Ansible.

source: Stop a container:
ru: Остановить контейнер:

source: Storage architecture
ru: Архитектура хранения данных

source: Supports the major Linux distributions Ubuntu, CentOS Stream, Rocky Linux and Debian.
ru: Поддерживает основные дистрибутивы Linux: Ubuntu, CentOS Stream, Rocky Linux и Debian.

source: Swift storage (for direct access to drive)
ru: Swift хранилище (для прямого доступа к диску)

source: The "containerized" applications are sometimes grouped within a single container where it makes sense, or distributed in multiple containers based on application and or architectural needs.
ru: "Контейнеризованные" приложения иногда группируются на одном контейнере, когда это имеет смысл, либо же разносятся в несколько контейнеров в зависимости от приложения и архитектурных нужд.

source: The Block Storage (cinder) service manages volumes on storage devices in an environment. In a production environment, the device presents storage via a storage protocol (for example, NFS, iSCSI, or Ceph RBD) to a storage network (``br-storage``) and a storage management API to the management network (``br-mgmt``). Instances are connected to the volumes via the storage network by the hypervisor on the Compute host.
ru: Служба блочного хранилища (cinder) управляет дисками на устройствах хранения в среде. В рабочем окружении устройство представляет хранилище через протокол хранения (например, NFS, iSCSI или Ceph RBD) в сети хранения (``br-storage``) и API управления хранилищем в сети управления (``br-mgmt``). Инстансы подключаются к дискам через сеть хранения гипервизором на вычислительном хосте.

source: The Compute host is configured with access to the storage device. The Compute host accesses the storage space via the storage network (``br-storage``) by using a storage protocol (for example, NFS, iSCSI, or Ceph RBD).
ru: Вычислительный хост настроен с доступом к устройству хранения. Вычислительный хост получает доступ к пространству хранения через сеть хранения (``br-storage``) с использованием протокола хранения (например, NFS, iSCSI или Ceph RBD).

source: The Image service (glance) can be configured to store images on a variety of storage back ends supported by the `glance_store drivers`_.
ru: Службу образов (glance) можно настроить для хранения образов на различных внутренних хранилищах, поддерживаемых `драйверами glance_store`_.

source: The ML2/OVN mechanism driver is deployed by default as of the Zed release of OpenStack-Ansible.
ru: Драйвер ML2/OVN развернут по умолчанию, начиная с версии Zed OpenStack-Ansible.

source: The Object Storage (swift) service implements a highly available, distributed, eventually consistent object/blob store that is accessible via HTTP/HTTPS.
ru: Служба Object Storage (Swift) реализует высокодоступное, распределенное и в конечном итоге согласованное хранилище объектов/BLOB-объектов, доступное по протоколу HTTP/HTTPS.

source: The OpenStack series names are alphabetical, with each letter matched to a number (e.g., Austin = 1, Bexar = 2, Newton = 14, Pike = 16, etc.). OpenStack-Ansible adopted the same ``<MAJOR>`` release numbering as the Nova project to match the overall OpenStack series version numbering.
ru: Названия серий OpenStack являются алфавитными, где каждой букве соответствует число (например, Austin = 1, Bexar = 2, Newton = 14, Pike = 16 и т. д.). OpenStack-Ansible принял ту же нумерацию релизов ``<MAJOR>``, что и проект Nova, чтобы соответствовать общей нумерации версий серии OpenStack.

source: The OpenStack-Ansible project provides a basic OpenStack environment, but many deployers will wish to extend the environment based on their needs. This could include installing extra services, changing package versions, or overriding existing variables.
ru: Проект OpenStack-Ansible предоставляет базовую среду OpenStack, но многие операторы захотят расширить среду в соответствии со своими потребностями. Это может включать установку дополнительных служб, изменение версий пакетов или переопределение существующих переменных.

source: The Victoria release of OpenStack-Ansible adds an optional new config file which defaults to ``/etc/openstack_deploy/user-collection-requirements.yml``.
ru: В выпуске OpenStack-Ansible Victoria добавлен новый необязательный файл конфигурации, который по умолчанию имеет имя ``/etc/openstack_deploy/user-collection-requirements.yml``.
