Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: ru

source: Once the live migration request has been accepted, the status can be monitored with the nova client:
ru: После принятия запроса на живую миграцию статус можно отслеживать с помощью клиента nova:

source: Once the playbook is finished, you can ensure that the cluster is in the **Synced** state and has proper cluster_size with the following ad-hoc:
ru: После завершения плейбука вы можете убедиться, что кластер находится в состоянии **Synced** и имеет правильный cluster_size, выполнив следующий ad-hoc:

source: Once this is done, you can deploy Keepalived again:
ru: Как только это будет сделано, вы сможете снова развернуть Keepalived:

source: Once we have a database prepared, we need to disable HAProxy backends that proxy traffic to the API of the service in order to prevent any user or service actions with it.
ru: После подготовки базы данных необходимо отключить бэкенды HAProxy, которые проксируют трафик к API служб, чтобы предотвратить любые действия пользователей или служб с ней.

source: Once we’ve figured out the execution order, it’s time for a step-by-step guide.
ru: После того, как мы определили порядок выполнения, пришло время для пошагового руководства.

source: OpenStack is a cloud computing platform that is designed to be highly scalable. However, even though OpenStack is designed to be scalable, there are a few potential bottlenecks that can occur in large deployments. These bottlenecks typically involve the performance and throughput of RabbitMQ and MariaDB clusters.
ru: OpenStack — это облачная вычислительная платформа, разработанная с учетом высокой масштабируемости. Однако, несмотря на то что OpenStack разработан с учетом масштабируемости, при крупных развертываниях могут возникнуть некоторые потенциальные узкие места. Эти узкие места обычно связаны с производительностью и пропускной способностью кластеров RabbitMQ и MariaDB.

source: OpenStack requires a higher version of a library (ie. libvirt)
ru: OpenStack требует более высокую версию библиотеки (например, libvirt).

source: OpenStack service
ru: Служба OpenStack

source: OpenStack-Ansible changes the default setting and used a encrypted SSH connection to transfer the instance data.
ru: OpenStack-Ansible изменяет настройки по умолчанию и использует зашифрованное SSH-соединение для передачи данных инстанса.

source: OpenStack-Ansible configuration
ru: Конфигурация OpenStack-Ansible

source: OpenStack-Ansible does not configure firewalls for its infrastructure. It is up to the deployer to define the perimeter and its firewall configuration.
ru: OpenStack-Ansible не настраивает файрволы для своей инфраструктуры. Периметр и конфигурацию файрвола должен определить сам оператор.

source: OpenStack-Ansible enables fact caching by default. The facts are cached in JSON files within ``/etc/openstack_deploy/ansible_facts``.
ru: OpenStack-Ansible включает кэширование фактов по умолчанию. Факты кэшируются в JSON-файлах в ``/etc/openstack_deploy/ansible_facts``.

source: OpenStack-Ansible group vars conveniently expose the vars outside of the `role scope <https://opendev.org/openstack/openstack-ansible/src/inventory/group_vars/all/all.yml>`_ in case you are relying on the OpenStack-Ansible groups to configure your firewall.
ru: Групповые переменные OpenStack-Ansible удобно раскрывают переменные за пределами `области действия роли <https://opendev.org/openstack/openstack-ansible/src/inventory/group_vars/all/all.yml>`_ в случае, если вы полагаетесь на группы OpenStack-Ansible для настройки своего файрвола.

source: OpenStack-Ansible maintains a running archive of inventory. If a change has been introduced into the system that has broken inventory or otherwise has caused an unforseen issue, the inventory can be reverted to an early version. The backup file ``/etc/openstack_deploy/backup_openstack_inventory.tar`` contains a set of timestamped inventories that can be restored as needed.
ru: OpenStack-Ansible поддерживает архив текущего inventory. Если в системе произойдет изменение, которое нарушит inventory или вызовет другую непредвиденную проблему, inventory может быть возвращена к более ранней версии. Файл резервной копии ``/etc/openstack_deploy/backup_openstack_inventory.tar`` содержит набор inventory с временными метками, которые могут быть восстановлены при необходимости.

source: OpenStack-Ansible provides flexible options for collecting and analyzing Ansible execution logs. Operators can use the default logging configuration, or integrate with `ARA Records Ansible <https://ara.recordsansible.org/>`_ for advanced reporting.
ru: OpenStack-Ansible предоставляет гибкие возможности для сбора и анализа логов выполнения Ansible. Операторы могут использовать конфигурацию логирования по умолчанию или интегрировать её с `ARA Records Ansible <https://ara.recordsansible.org/>`_ для расширенной отчётности.

source: OpenStack-Ansible supports operating system distribution upgrades during specific release cycles. These can be observed by consulting the operating system compatibility matrix, and identifying where two versions of the same operating system are supported.
ru: OpenStack-Ansible поддерживает обновление дистрибутива операционной системы в течение определенных циклов выпуска. Их можно увидеть, обратившись к матрице совместимости операционных систем и определив, где поддерживаются две версии одной и той же операционной системы.

source: Operating System Compatibility Matrix
ru: Матрица совместимости операционных систем

source: Operating systems with experimental support are marked with ``E`` in the table.
ru: Операционные системы с экспериментальной поддержкой отмечены в таблице символом ``E``.

source: Operational considerations, like compliance, can make it necessary to manage networks. For example, adding new provider networks to the OpenStack-Ansible managed cloud. The following sections are the most common administrative tasks outlined to complete those tasks.
ru: Эксплуатационные соображения, такие как гибкость, могут привести к необходимости управления сетями. Например, добавление новых сетей провайдера в управляемое облако OpenStack-Ansible. В следующих разделах приведены наиболее распространенные административные задачи, изложенные для выполнения этих задач.

source: Operations Guide
ru: Руководство по эксплуатации

source: Option 1: Independent clusters per service
ru: Вариант 1: независимые кластеры для каждой службы

source: Option 2: Dedicated hardware for clusters
ru: Вариант 2: выделенное оборудование для кластеров

source: Option 3: Growing Clusters Horizontally
ru: Вариант 3: горизонтальное расширение кластеров

source: Option three (:ref:`scaling-osa-three`) can be used if your deployment meets the requirements that were written above (ie. not using HA queues or using ProxySQL for balancing) and usually should be considered when you’ve outgrown option one as well.
ru: Третий вариант (:ref:`scaling-osa-three`) можно использовать, если ваше развертывание соответствует требованиям, указанным выше (т. е. не использует очереди HA или ProxySQL для балансировки), и обычно его следует рассматривать, когда первый вариант уже не подходит.

source: Optional
ru: Опционально

source: Or if you've enabled haproxy_stats as described above, you can visit https://admin:password@external_lb_vip_address:1936/ and select them and set state to ``MAINT``.
ru: Или, если вы включили haproxy_stats, как описано выше, вы можете зайти на сайт https://admin:password@external_lb_vip_address:1936/, выбрать их и установить состояние на ``MAINT``.

source: Or preferably if you've installed HAProxy with stats, like so:
ru: А лучше всего, если вы установили HAProxy со статистикой, например, так:

source: Ordering
ru: Порядок

source: Other configurations can be configured inside the ``/etc/openstack_deploy/user_variables.yml`` file:
ru: Другие конфигурации можно настроить внутри файла ``/etc/openstack_deploy/user_variables.yml``:

source: Other forms of instance migration
ru: Другие формы миграции инстансов

source: Pause, resume, rescue or suspend the instance
ru: Приостановить, возобновить, ввести в режим восстановления или приостановить инстанс

source: Perform backups of critical data, in particular the Galera database in case of any failures. It is also recommended to back up the '/var/www/repo' directory on the primary 'repo' host in case it needs to be restored mid-upgrade.
ru: Выполните резервное копирование критически важных данных, в частности базы данных Galera, на случай сбоев. Также рекомендуется создать резервную копию каталога ``/var/www/repo`` на основном хосте "репозитория" на случай, если его придется восстанавливать в процессе обновления.

source: Perform the following checks:
ru: Выполните следующие проверки:

source: Please also have a look at `Starting the Cluster <https://galeracluster.com/library/training/tutorials/starting-cluster.html>`_.
ru: Ознакомьтесь также с разделом `Запуск кластера <https://galeracluster.com/library/training/tutorials/starting-cluster.html>`_.

source: Please make sure you are running RabbitMQ version 3.13 or later before proceeding to this step. Upgrade of RabbitMQ to version 4.0 (default for 2024.2) from prior version will result in playbook failure.
ru: Пожалуйста, убедитесь, что вы используете RabbitMQ версии 3.13 или более поздней, прежде чем приступать к этому шагу. Обновление RabbitMQ до версии 4.0 (по умолчанию для 2024.2) с предыдущей версии приведет к сбою плейбука.

source: Please, check `RabbitMQ maintenance <https://docs.openstack.org/openstack-ansible/latest/admin/maintenance-tasks.html#migrate-between-ha-and-quorum-queues>`_ for more information about switching between Quourum and HA Queues.
ru: Пожалуйста, ознакомьтесь с `RabbitMQ maintenance <https://docs.openstack.org/openstack-ansible/latest/admin/maintenance-tasks.html#migrate-between-ha-and-quorum-queues>`_ для получения дополнительной информации о переключении между Quourum и HA Queues.

source: Pre-Requisites
ru: Предварительные условия

source: Predictable interface naming
ru: Предсказуемое именование интерфейсов

source: Preflight checks
ru: Предварительные проверки

source: Preliminary troubleshooting questions to answer:
ru: Предварительные вопросы по устранению неполадок, на которые необходимо ответить:

source: Prepare new infra hosts and create containers on them. For that, run the command:
ru: Подготовьте новые инфраструктурные хосты и создайте на них контейнеры. Для этого выполните команду:

source: Prerequisites
ru: Предварительные условия

source: Prune Inventory Backup Archive
ru: Очищение архива резервных копий inventory

source: Python version
ru: Версия Python

source: RabbitMQ and Mnesia
ru: RabbitMQ и Mnesia

source: RabbitMQ brokers can tolerate the failure of individual nodes within the cluster. These nodes can start and stop at will as long as they have the ability to reach previously known members at the time of shutdown.
ru: Брокеры RabbitMQ могут допускать отказ отдельных узлов в кластере. Эти узлы могут запускаться и останавливаться по желанию, пока они имеют возможность достичь ранее известных участников в момент отключения.

source: RabbitMQ cluster maintenance
ru: Обслуживание кластера RabbitMQ

source: RabbitMQ clusters can be formed in two ways:
ru: Кластеры RabbitMQ могут быть сформированы двумя способами:

source: RabbitMQ is a message broker that is used to decouple different components of OpenStack. MariaDB is a database that is used to store data for OpenStack. If these two components are not performing well, it can have a negative impact on the performance of the entire OpenStack deployment.
ru: RabbitMQ — это брокер сообщений, который используется для разделения различных компонентов OpenStack. MariaDB — это база данных, которая используется для хранения данных OpenStack. Если эти два компонента работают неэффективно, это может негативно повлиять на производительность всего развертывания OpenStack.

source: RabbitMQ is clustered differently. We supply IP addresses of all cluster members to clients and it’s up to the client to decide which backend it will use for interaction. Only RabbitMQ management UI is balanced through HAProxy, so the connection of clients to queues does not depend on HAProxy in any way.
ru: RabbitMQ кластеризован иначе. Мы предоставляем клиентам IP-адреса всех участников кластера, и клиент сам решает, какой бэкенд использовать для взаимодействия. Только интерфейс управления RabbitMQ балансируется через HAProxy, поэтому подключение клиентов к очередям никак не зависит от HAProxy.

source: RabbitMQ nodes and the CLI tools use an ``erlang cookie`` to determine whether or not they have permission to communicate. The cookie is a string of alphanumeric characters and can be as short or as long as you would like.
ru: Узлы RabbitMQ и инструменты CLI используют ``erlang cookie`` для определения того, есть ли у них разрешение на общение. Файл cookie представляет собой строку буквенно-цифровых символов и может быть настолько коротким или длинным, насколько вам нужно.

source: Re-configure ``openstack_user_config`` to create a new container.
ru: Перенастройте ``openstack_user_config``, чтобы создать новый контейнер.

source: Re-instate compute node hypervisor UUIDs
ru: Заново установите UUID гипервизора вычислительного узла

source: Re-launch all instances on the failed node.
ru: Повторно запустите все инстансы на отказавшем узле.

source: Reboot each instance on the failed node listed in the previous query to regenerate the XML files:
ru: Перезагрузите каждый инстанс на отказавшем узле, указанном в предыдущем запросе, чтобы перегенерировать XML-файлы:

source: Rebuild a container
ru: Пересоздание контейнера

source: Rebuild or replace the failed node as described in :ref:`add-compute-host`.
ru: Пересоздайте или замените неисправный узел, как описано в :ref:`add-compute-host`.

source: Record the Primary Region output of the ``default_project_id`` for the specified user from the user table in the keystone database:
ru: Запишите вывод основного региона для ``default_project_id`` указанного пользователя из таблицы пользователей в базе данных keystone:

source: Record the Secondary Region output of the ``default_project_id`` for the specified user from the user table in the keystone database:
ru: Запишите вывод вторичного региона для ``default_project_id`` указанного пользователя из таблицы пользователей в базе данных keystone:

source: Recover a complete environment failure
ru: Восстановление после полного сбоя окружения

source: Recover a compute host failure
ru: Восстановление вычислительного узла после сбоя

source: Recover a multi-node failure
ru: Восстановление после многоузлового сбоя

source: Recover a single-node failure
ru: Восстановление после отказа одного узла

source: Recovering from certain failures require rebuilding one or more containers.
ru: Для восстановления после некоторых сбоев требуется пересоздание одного или нескольких контейнеров.

source: Reinstall a host's operating system
ru: Переустановите операционную систему хоста

source: Reinstall an infrastructure host's operating system
ru: Переустановка операционной системы узла инфраструктуры

source: Remove Neutron router ports and DHCP agents:
ru: Удалите порты маршрутизатора Neutron и DHCP-агенты:

source: Remove a compute host
ru: Удалить вычислительный хост

source: Remove all Neutron ports from the instances:
ru: Удалите все порты Neutron из инстансов:

source: Remove provider bridges from OpenStack
ru: Удаление мостов провайдера из OpenStack

source: Remove the Neutron network:
ru: Удалите сеть Neutron:

source: Remove the last container in the group using the following playbook:
ru: Удалите последний контейнер в группе с помощью следующего плейбука:

source: Remove the provider network from the ``provider_networks`` configuration of the OpenStack-Ansible configuration ``/etc/openstack_deploy/openstack_user_config.yml`` and re-run the following playbooks:
ru: Удалите сеть провайдера из конфигурации ``provider_networks`` конфигурации OpenStack-Ansible ``/etc/openstack_deploy/openstack_user_config.yml`` и повторно запустите следующие плейбуки:

source: Removing stale ansible-facts
ru: Удаление устаревших фактов из ansible-facts

source: Repair a partitioned RabbitMQ cluster for a multi-node cluster
ru: Восстановление разбитого на разделы кластера RabbitMQ для многоузлового кластера

source: Repair a partitioned RabbitMQ cluster for a single-node
ru: Восстановление разделенного кластера RabbitMQ для одного узла

source: Repeat the steps above for the rest of the instances.
ru: Повторите вышеуказанные шаги для остальных инстансов.

source: Replace ``CONTAINER_NAME`` with the target container.
ru: Замените ``CONTAINER_NAME`` на целевой контейнер.

source: Replace the failed hardware and validate the new hardware is functioning.
ru: Замените вышедшее из строя оборудование и проверьте работоспособность нового оборудования.

source: Replacing failed hardware
ru: Замена вышедшего из строя оборудования

source: Repo Server
ru: Сервер репозитория

source: Required
ru: Обязательно

source: Resize or rebuild any instance
ru: Изменить тип или переустановить любой инстанс

source: Resizing and moving instances to better hardware
ru: Изменение размера и перемещение инстансов на более качественное оборудование

source: Resolving some issues may require destroying a container, and rebuilding that container from the beginning. It is possible to destroy and re-create a container with the ``lxc-containers-destroy.yml`` and ``lxc-containers-create.yml`` commands. These Ansible scripts reside in the ``openstack-ansible/playbooks`` repository.
ru: Для решения некоторых проблем может потребоваться удаление контейнера и его пересоздание с самого начала. Удалить и заново создать контейнер можно с помощью команд ``lxc-containers-destroy.yml`` и ``lxc-containers-create.yml``. Эти скрипты Ansible находятся в репозитории ``openstack-ansible/playbooks``.

source: Restart MariaDB in the new container and verify that it rejoins the cluster.
ru: Перезапустите MariaDB в новом контейнере и убедитесь, что он снова присоединился к кластеру.

source: Restart MariaDB on the failed node and verify that it rejoins the cluster.
ru: Перезапустите MariaDB на неисправном узле и убедитесь, что он снова присоединяется к кластеру.

source: Restart MariaDB on the failed nodes and verify that they rejoin the cluster:
ru: Перезапустите MariaDB на отказавших узлах и убедитесь, что они снова присоединились к кластеру:

source: Restart MariaDB on the other nodes (replace [0] from previous Ansible command with [1:]) and verify that they rejoin the cluster.
ru: Перезапустите MariaDB на других узлах (замените [0] из предыдущей команды Ansible на [1:]) и убедитесь, что они снова присоединились к кластеру.

source: Restart a Networking agent container
ru: Перезапуск контейнера сетевого агента

source: Restart your OpenStack services by accessing every controller node. Some OpenStack services will require restart from other nodes in your environment.
ru: Перезапустите службы OpenStack, обратившись к каждому узлу контроллера. Некоторые службы OpenStack потребуют перезапуска с других узлов в вашем окружении.

source: Restarting OpenStack services
ru: Перезапуск служб OpenStack

source: Restarting services
ru: Перезапуск служб

source: Restore from backup if all of the nodes in a Galera cluster fail (do not shutdown gracefully). Change to the ``playbook`` directory and run the following command to determine if all nodes in the cluster have failed:
ru: Восстановите из резервной копии, если все узлы в кластере Galera вышли из строя (не выключайте их). Перейдите в каталог ``playbook`` и выполните следующую команду, чтобы определить, вышли ли из строя все узлы в кластере:

source: Restoring inventory from backup
ru: Восстановление inventory из резервной копии

source: Review container networking traffic
ru: Обзор сетевого трафика контейнеров

source: Routine maintenance includes gracefully adding or removing nodes from the cluster without impacting operation and also starting a cluster after gracefully shutting down all nodes.
ru: Плановое обслуживание включает в себя корректное добавление или удаление узлов из кластера без нарушения его работы, а также запуск кластера после корректного отключения всех узлов.

source: Run ``rabbitmqctl cluster_status`` from either node.
ru: Запустите ``rabbitmqctl cluster_status`` с любого узла.

source: Run an OpenStack command that uses one or more APIs. For example:
ru: Запустите команду OpenStack, которая использует один или несколько API. Например:

source: Run an OpenStack command to ensure all the compute services are working (the output depends on your configuration) For example:
ru: Запустите команду OpenStack, чтобы убедиться, что все вычислительные службы работают (выходные данные зависят от вашей конфигурации). Например:

source: Run an OpenStack command to ensure the block storage services are working (depends on your configuration). For example:
ru: Запустите команду OpenStack, чтобы убедиться, что службы блочного хранилища работают (зависит от вашей конфигурации). Например:

source: Run an OpenStack command to ensure the image storage service is working (depends on your uploaded images). For example:
ru: Запустите команду OpenStack, чтобы убедиться, что служба хранения образов работает (зависит от загруженных вами образов). Например:

source: Run an OpenStack command to ensure the networking services are working (the output also depends on your configuration) For example:
ru: Запустите команду OpenStack, чтобы убедиться, что сетевые службы работают (вывод также зависит от вашей конфигурации). Например:

source: Run an OpenStack command to reveal all endpoints from your deployment. For example:
ru: Запустите команду OpenStack, чтобы показать все точки доступа из вашего развертывания. Например:

source: Run the **openstack-ansible lxc-containers-destroy.yml** commands, specifying the target containers and the container to be destroyed.
ru: Запустите команды **openstack-ansible lxc-containers-destroy.yml**, указав целевые контейнеры и контейнер, который необходимо удалить.

source: Run the ``openstack image list`` command to ensure that the API and registry is working.
ru: Выполните команду ``openstack image list``, чтобы убедиться, что API и реестр работают.

source: Run the ``openstack.osa.galera_server`` playbook using the ``galera_force_bootstrap`` variable to automatically recover a node or an entire environment.
ru: Запустите плейбук ``openstack.osa.galera_server``, используя переменную ``galera_force_bootstrap``, чтобы автоматически восстановить узел или все окружение.

source: Run the ``remove_compute_node.yml`` Ansible playbook with the ``host_to_be_removed`` user variable set:
ru: Запустите плейбук Ansible ``remove_compute_node.yml`` с установленной пользовательской переменной ``host_to_be_removed``:

source: Run the ad-hoc Ansible commands from the ``openstack-ansible/playbooks`` directory.
ru: Запустите ad-hoc команды Ansible из каталога ``openstack-ansible/playbooks``.

source: Run the appropriate playbook commands after changing the configuration to create the new containers, and install the appropriate services.
ru: После изменения конфигурации выполните соответствующие команды плейбука, чтобы создать новые контейнеры и установить соответствующие службы.

source: Run the appropriate playbooks depending on the ``group_binds`` section.
ru: Запустите соответствующие плейбуки в зависимости от раздела ``group_binds``.

source: Run the following Ansible command to show the failed nodes:
ru: Выполните следующую команду Ansible, чтобы отобразить неисправные узлы:
