Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: ru

source: Do not continue until the instance can reach its gateway.
ru: Не продолжайте, пока инстанс не установит связь со своим шлюзом.

source: Do not rely on the load balancer health checks to disable the node. If the node is not disabled, the load balancer sends SQL requests to it before it rejoins the cluster and cause data inconsistencies.
ru: Не полагайтесь на проверки работоспособности балансировщика нагрузки для отключения узла. Если узел не отключен, балансировщик нагрузки отправляет ему SQL-запросы до того, как он снова присоединится к кластеру что вызывает несогласованность данных.

source: Does physical interface show link and all VLANs properly trunked across physical network?
ru: Показывает ли физический интерфейс подключение и все ли VLAN правильно проброшены транком через физическую сеть?

source: Does the instance's IP address ping from network's DHCP namespace or other instances in the same network?
ru: Пингуется ли IP-адрес инстанса из пространства имен DHCP сети или других инстансов в той же сети?

source: Does the instance's IP address ping from the gateway device (Neutron Router namespace or another gateway device)?
ru: Пингуется ли IP-адрес инстанса с шлюза (пространство имен Neutron Router или другого шлюза)?

source: Download an image to ensure that an image can be read from the store.
ru: Загрузите образ, чтобы убедиться, что он может быть прочитан из хранилища.

source: Due to the adoption of ``systemd-journald`` as the primary logging backend, the traditional mapping of ``/openstack/log/`` to ``/var/log/$SERVICE`` inside the container is no longer present. Logs should be accessed directly through journald tools such as ``journalctl`` or by examining the ``/var/log/journal/`` directories on the host.
ru: В связи с принятием ``systemd-journald`` в качестве основного бэкенда для ведения логов, традиционное расположение ``/openstack/log/`` с ``/var/log/$SERVICE`` внутри контейнера больше не применяется. Доступ к логам следует осуществлять напрямую через инструменты journald, такие как ``journalctl``, или путем просмотра каталогов ``/var/log/journal/`` на хосте.

source: During the bootstrap process, set the following variable:
ru: В процессе загрузки задайте следующую переменную:

source: During the upgrade process, some OpenStack services cannot be deployed by using Ansible's '--limit'. As such, it will be necessary to deploy some services to mixed operating system versions at the same time.
ru: В процессе обновления некоторые службы OpenStack не могут быть развернуты с помощью команды Ansible "--limit". Поэтому некоторые службы придется развертывать одновременно на смешанных версиях операционных систем.

source: Each host is comma-separated with no spaces.
ru: Каждый хост разделяется запятыми без пробелов.

source: Each playbook run will then produce an HTML report stored on the deploy host.
ru: После каждого запуска плейбука будет создан HTML-отчет, сохраненный на хосте развертывания.

source: Edit security groups
ru: Редактировать группы безопасности

source: Edit the ``/etc/openstack_deploy/openstack_user_config.yml`` file and add the host to the ``compute_hosts`` stanza.
ru: Отредактируйте файл ``/etc/openstack_deploy/openstack_user_config.yml`` и добавьте хост в ``compute_hosts` `.

source: Edit the file ``/etc/openstack_deploy/openstack_user_config.yml`` and add a new block underneath the ``provider_networks`` section:
ru: Отредактируйте файл ``/etc/openstack_deploy/openstack_user_config.yml`` и добавьте новый блок под разделом ``provider_networks``:

source: Edit the instance
ru: Редактировать инстанс

source: Enable the ``cinder-volume`` service:
ru: Включите службу ``cinder-volume``:

source: Enable the ``nova-compute`` service in the environment:
ru: Включите службу ``nova-compute`` в окружении:

source: Enable the previously failed node on the load balancer.
ru: Включите ранее отказавший узел на балансировщике нагрузки.

source: Ensure RabbitMQ is not running on the node:
ru: Убедитесь, что RabbitMQ не запущен на узле:

source: Ensure RabbitMQ is running with all feature flags enabled to avoid conflicts when re-installing nodes. If any are listed as disabled then enable them via the console on one of the nodes:
ru: Убедитесь, что RabbitMQ запущен со всеми включенными флагами возможностей, чтобы избежать конфликтов при переустановке узлов. Если какие-либо из них указаны как отключенные, включите их через консоль на одном из узлов:

source: Ensure that all hosts in your target deployment have been installed and configured using a matching version of OpenStack-Ansible. Ideally perform a minor upgrade to the latest version of the OpenStack release cycle which you are currently running first in order to reduce the risk of encountering bugs.
ru: Убедитесь, что все узлы в вашем целевом развертывании были установлены и настроены с помощью соответствующей версии OpenStack-Ansible. В идеале сначала выполните незначительное обновление до последней версии цикла релиза OpenStack, который вы используете в данный момент, чтобы снизить риск столкновения с ошибками.

source: Ensure that the new instance can respond to a networking connection test through the :command:`ping` command. Log in to your monitoring system, and verify that the monitors return a green signal for the new node.
ru: Убедитесь, что новый инстанс может ответить на тест на сетевое соединение через команду :command:`ping`. Войдите в систему мониторинга и убедитесь, что мониторы возвращают зеленый сигнал для нового узла.

source: Ensure that you don’t have more generic shared-infra_hosts defined.
ru: Убедитесь, что у вас не определено больше общих shared-infra_hosts.

source: Ensure that your OpenStack-Ansible code is on the latest |current_release_formal_name| tagged release.
ru: Убедитесь, что ваш код OpenStack-Ansible находится на последней версии с меткой |current_release_formal_name|.

source: Ensure that your OpenStack-Ansible code is on the latest |current_release_formal_name| tagged release:
ru: Убедитесь, что ваш код OpenStack-Ansible находится на последней версии с меткой |current_release_formal_name|:

source: Ensure the cluster is healthy with the following ad-hoc:
ru: Убедитесь, что кластер рабочий, выполнив следующий ad-hoc:

source: Ensure this step is performed first.
ru: Убедитесь, что этот шаг выполнен первым.

source: Enter the details of the image, including the **Image Location**, which is where the URL location of the image is required.
ru: Введите детали об образе, включая **Расположение образа**, где требуется указать URL-адрес образа.

source: Everything should now be in a working state and we can finish it off with
ru: Теперь все должно быть в рабочем состоянии, и мы можем завершить его с помощью

source: Examplarery live migration on a local storage:
ru: Пример живой миграции на локальном хранилище:

source: Example inventory restore process.
ru: Пример процесса восстановления inventory.

source: Example of rebooting one container at a time, 60 seconds apart:
ru: Пример перезагрузки одного контейнера за раз с интервалом в 60 секунд:

source: Example of rebooting still accessible containers.
ru: Пример перезагрузки все еще доступных контейнеров.

source: Example:
ru: Пример:

source: Examples provided in this documentation were made on OpenStack 2023.1 (Antelope). It is possible to achieve the same flows in earlier releases, but some extra steps or slightly different configurations might be required.
ru: Примеры, приведенные в данной документации, были созданы на OpenStack 2023.1 (Antelope). Такие же шаги можно реализовать и в более ранних версиях, но для этого могут потребоваться дополнительные этапы или несколько иные настройки.

source: Execute ``rabbitmq cluster_status`` to see all 3 nodes:
ru: Выполните ``rabbitmq cluster_status``, чтобы увидеть все 3 узла:

source: Execute a minor version upgrade
ru: Выполнение минорного обновления версии

source: Execute the following:
ru: Выполните следующие действия:

source: Executing the migration
ru: Выполнение миграции

source: Export the Neutron network that is about to be removed as single UUID.
ru: Выполните экспорт сети Neutron, которая будет удалена, как один UUID.

source: Extending the cluster is quite trivial. For that, you need to:
ru: Расширить кластер довольно просто. Для этого необходимо:

source: Fact caching can be disabled by running ``export ANSIBLE_CACHE_PLUGIN=memory``. To set this permanently, set this variable in ``/usr/local/bin/openstack-ansible.rc``. Refer to the Ansible documentation on `fact caching`_ for more details.
ru: Кэширование фактов можно отключить, выполнив команду ``export ANSIBLE_CACHE_PLUGIN=memory``. Чтобы установить эту переменную на постоянной основе, задайте ее в файле ``/usr/local/bin/openstack-ansible.rc``. Для получения более подробной информации обратитесь к документации Ansible по `fact caching`_.

source: Failed Ansible playbooks during an upgrade
ru: Неудачные выполнения плейбуков Ansible во время обновления

source: Failed security hardening after host kernel upgrade from version 3.13
ru: Неудачное усиление безопасности после обновления ядра хоста с версии 3.13

source: Field Name
ru: Название поля

source: Find the volumes to check the instance has successfully booted and is at the login:
ru: Найдите диски, чтобы проверить, что инстанс успешно загрузился и находится в режиме входа в систему:

source: Finding ports for your external load balancer
ru: Поиск портов для внешнего балансировщика нагрузки

source: Finding your HAProxy/Keepalived primary is as easy as
ru: Найти свой основной HAProxy/Keepalived так же просто, как

source: Firewalls
ru: Файрволы

source: First, we need to tell Neutron that from now on, the MariaDB database for the service is listening on a different port. So you should add the following override to your ``user_variables.yml``:
ru: Во-первых, нам нужно сообщить Neutron, что с этого момента база данных MariaDB для службы прослушивает другой порт. Для этого добавьте следующее переопределение в ваш ``user_variables.yml``:

source: For a Compute host, shut down instances on the host before it goes down. For a Block Storage (cinder) host using non-redundant storage, shut down any instances with volumes attached that require that mount point. Unmount the drive within your operating system and re-mount the drive once the Block Storage host is back online.
ru: Выключите инстансы на вычислительном узле, прежде чем он будет выключен. Для узла блочного хранилища (cinder), использующего нерезервированное хранилище, выключите все инстансы с подключенными дисками, которым требуется эта точка монтирования. Отмонтируйте диск в операционной системе и снова смонтируйте его, когда узел блочного хранилища снова будет подключен.

source: For an example and more information, see `Verify operation <https://docs.openstack.org/glance/latest/install/verify.html>`_. and `Manage Images <https://docs.openstack.org/glance/latest/admin/manage-images.html>`_.
ru: Пример и дополнительную информацию см. в разделах `Проверка действий <https://docs.openstack.org/glance/latest/install/verify.html>`_ и `Управление образами <https://docs.openstack.org/glance/latest/admin/manage-images.html>`_.

source: For disaster recovery purposes, it is a good practice to perform regular backups of the database, configuration files, network information, and OpenStack service details in your environment. For an OpenStack cloud deployed using OpenStack-Ansible, back up the ``/etc/openstack_deploy/`` directory.
ru: Для целей аварийного восстановления рекомендуется регулярно выполнять резервное копирование базы данных, файлов конфигурации, сетевой информации и сведений о сервисах OpenStack в вашем окружении. Для облака OpenStack, развернутого с помощью OpenStack-Ansible, сделайте резервную копию каталога ``/etc/openstack_deploy/``.

source: For example, if you update the networks requiring a change in all nodes with a linux bridge agent, assuming you have infra nodes named **infra01**, **infra02**, and **infra03**, run:
ru: Например, если вы обновляете сети, требующие изменения всех узлов с помощью агента Linux bridge, предполагая, что у вас есть инфраструктурные (control) узлы с именами **infra01**, **infra02** и **infra03**, выполните:

source: For example, run the **openstack-ansible lxc-containers-create.yml rabbitmq-install.yml** commands from the ``openstack-ansible/playbooks`` repository to complete the scaling process described in the example above:
ru: Например, запустите команды **openstack-ansible lxc-containers-create.yml rabbitmq-install.yml** из репозитория ``openstack-ansible/playbooks``, чтобы завершить процесс масштабирования, описанный в примере выше:

source: For example, the `os_glance documentation <https://docs.openstack.org/openstack-ansible-os_glance/latest/#default-variables>`_ lists the variable ``glance_service_publicuri``. This contains the port used for the reaching the service externally. In this example, it is equal to ``glance_service_port``, whose value is 9292.
ru: Например, `в документации os_glance <https://docs.openstack.org/openstack-ansible-os_glance/latest/#default-variables>`_ указана переменная ``glance_service_publicuri``. Она содержит порт, используемый для внешнего доступа к службе. В этом примере он равен ``glance_service_port``, значение которого 9292.

source: For example, you can update only the Compute hosts by running the following command:
ru: Например, вы можете обновить только вычислительные узлы, выполнив следующую команду:

source: For example, you could use the shell module to check the amount of disk space on a set of Compute hosts:
ru: Например, вы можете использовать модуль shell для проверки объема дискового пространства на наборе вычислительных хостов:

source: For in-depth technical information, see the :ref:`reference-guide`.
ru: Подробную техническую информацию см. в :ref:`reference-guide`.

source: For information on how to contribute, extend or develop OpenStack-Ansible, see the :dev_docs:`Developer Documentation <contributors/index.html>`.
ru: Информацию о том, как внести свой вклад, расширять или развивать OpenStack-Ansible, см. в :dev_docs:`Документации для разработчиков <contributors/index.html>`.

source: For information on how to deploy your OpenStack-Ansible cloud, refer to the :deploy_guide:`Deployment Guide <index.html>` for step-by-step instructions on how to deploy the OpenStack packages and dependencies on your cloud using OpenStack-Ansible.
ru: Информацию о том, как развернуть облако OpenStack-Ansible, см. в :deploy_guide:`Руководстве по развертыванию <index.html>`, где приведены пошаговые инструкции по развертыванию пакетов OpenStack и зависимостей в вашем облаке с помощью OpenStack-Ansible.

source: For more generic information on troubleshooting your network, see the `Network Troubleshooting chapter <https://wiki.openstack.org/wiki/OpsGuide/Network_Troubleshooting>`_ in the Operations Guide.
ru: Более общую информацию об устранении неполадок в сети см. в главе `Устранение неполадок в сети <https://wiki.openstack.org/wiki/OpsGuide/Network_Troubleshooting>`_ в Руководстве по эксплуатации.

source: For more in-depth information on Networking, see the `Networking Guide <https://docs.openstack.org/neutron/latest/admin/>`_.
ru: Более подробную информацию о работе в сети см. в `Руководстве по работе в сети <https://docs.openstack.org/neutron/latest/admin/>`_.

source: For more information about Mnesia, see the `Mnesia overview <https://www.erlang.org/doc/apps/mnesia/mnesia_overview>`_.
ru: Более подробную информацию о Mnesia можно найти в `Обзоре Mnesia <https://www.erlang.org/doc/apps/mnesia/mnesia_overview>`_.

source: For more information about OpenStack client utilities, see these links:
ru: Дополнительную информацию о клиентских утилитах OpenStack можно найти по этим ссылкам:

source: For more information about forks, please see the following references:
ru: Более подробную информацию о forks можно найти по следующим ссылкам:

source: For more information about the major upgrade process, see :ref:`upgrading-by-using-a-script` and :ref:`upgrading-manually`.
ru: Более подробную информацию о процессе обновления смотрите в :ref:`upgrading-by-using-a-script` и :ref:`upgrading-manually`.

source: For more information about the steps performed by the script, see :ref:`upgrading-manually`.
ru: Более подробную информацию о действиях, выполняемых скриптом, смотрите в :ref:`upgrading-manually`.

source: For more information on attaching Block Storage volumes to instances for persistent storage, see the *Managing volumes for persistent storage* section below.
ru: Дополнительную информацию о присоединении дисков блочного хранилища к инстансам для постоянного хранения см. в разделе *Управление дисками для постоянного хранения* ниже.

source: For more information on generic OpenStack firewall configuration, see the `Firewalls and default ports <https://docs.openstack.org/install-guide/firewalls-default-ports.html>`_
ru: Дополнительную информацию о конфигурации файрвола OpenStack можно найти в разделе `Файрволы и порты по умолчанию <https://docs.openstack.org/install-guide/firewalls-default-ports.html>`_

source: For more information, see :deploy_guide:`Configure the deployment <configure.html>` in the OpenStack-Ansible Deployment Guide.
ru: Для получения дополнительной информации см. :deploy_guide:`Конфигурация развертывания <configure.html>` в Руководстве по развертыванию OpenStack-Ansible.

source: For more information, see `Inventory <https://docs.ansible.com/ansible/latest/inventory_guide/intro_inventory.html>`_ and `Patterns <https://docs.ansible.com/ansible/latest/inventory_guide/intro_patterns.html>`_.
ru: Для получения дополнительной информации см. `Inventory <https://docs.ansible.com/ansible/latest/inventory_guide/intro_inventory.html>`_ и `Шаблоны <https://docs.ansible.com/ansible/latest/inventory_guide/intro_patterns.html>`_.

source: For more information, see `shell - Execute commands in nodes <https://docs.ansible.com/ansible/latest/collections/ansible/builtin/shell_module.html>`_.
ru: Для получения дополнительной информации см. `shell - Выполнение команд на узлах <https://docs.ansible.com/ansible/latest/collections/ansible/builtin/shell_module.html>`_.

source: For richer reporting, OpenStack-Ansible can be integrated with **ARA (Ansible Run Analysis)**.
ru: Для более содержательных отчетов OpenStack-Ansible можно интегрировать с **ARA (Ansible Run Analysis)**.

source: For that to happen we should run the following command:
ru: Для этого необходимо выполнить следующую команду:

source: For that, we use a small custom playbook. Let’s name it ``haproxy_backends.yml``:
ru: Для этого мы используем небольшой пользовательский плейбук. Назовем его ``haproxy_backends.yml``:

source: For the 'repo' host, it is important that the freshly installed hosts are set to 'READY' in HAProxy, and any which remain on the old operating system are set to 'MAINT'.
ru: Для хоста "репозитория" важно, чтобы вновь установленные хосты были установлены в состояние "READY" в HAProxy, а все хосты, которые остались на старой операционной системе, были установлены в состояние "MAINT".

source: For upgrades between major versions, the OpenStack-Ansible repository provides playbooks and scripts to upgrade an environment. The ``run-upgrade.sh`` script runs each upgrade playbook in the correct order, or playbooks can be run individually if necessary. Alternatively, a deployer can upgrade manually.
ru: Для обновления между основными версиями репозиторий OpenStack-Ansible содержит плейбук и скрипты для обновления окружения. Сценарий ``run-upgrade.sh`` запускает каждый плейбук обновления в правильном порядке, а при необходимости плейбук можно запускать по отдельности. Кроме того, установщик может обновить среду вручную.

source: For user guides, see the :ref:`user-guide`.
ru: Руководства пользователя см. в :ref:`user-guide`.

source: Forcing regeneration of cached facts
ru: Принудительное пересоздание кэшированных фактов

source: Galera cluster maintenance
ru: Техническое обслуживание кластера Galera

source: Galera cluster recovery
ru: Восстановление кластера Galera

source: Generate a list of instance UUIDs hosted on the failed node:
ru: Сгенерируйте список UUID инстансов, размещенных на отказавшем узле:

source: Good!
ru: Хорошо!

source: Good! The instance can ping its intended gateway.
ru: Отлично! Инстанс может пинговать предполагаемый шлюз.

source: Good! The instance can ping its intended gateway. The issue may be north of the gateway or related to the provider network.
ru: Отлично! Инстанс может пинговать предполагаемый шлюз. Проблема может быть связана со шлюзом или с сетью провайдера.

source: Good! This suggests that the instance received its IP address and can reach local network resources.
ru: Хорошо! Это означает, что инстанс получил свой IP-адрес и может обращаться к ресурсам локальной сети.

source: Gracefully shutting down all nodes destroys the cluster. Starting or restarting a cluster from zero nodes requires creating a new cluster on one of the nodes.
ru: Мягкое выключение всех узлов разрушает кластер. Запуск или перезапуск кластера без узлов требует создания нового кластера на одном из узлов.

source: Gracefully shutting down the MariaDB service on all but one node allows the remaining operational node to continue processing SQL requests. When gracefully shutting down multiple nodes, perform the actions sequentially to retain operation.
ru: Грамотное завершение работы службы MariaDB на всех узлах, кроме одного, позволяет оставшемуся рабочему узлу продолжить обработку SQL-запросов. При грамотном завершении работы нескольких узлов выполняйте действия последовательно, чтобы сохранить работу.

source: Growing the RabbitMQ cluster vertically makes sense mostly when you don’t have HA queues or Quorum queues enabled.
ru: Вертикальное расширение кластера RabbitMQ имеет смысл в основном в том случае, если у вас не включены очереди HA или Quorum.

source: Handles tasks for setting up and configuring RabbitMQ. Use this tag when you need to reconfigure virtual hosts, users, or their privileges without affecting the rest of the deployment.
ru: Выполняет задачи по настройке и конфигурированию RabbitMQ. Используйте этот тег, когда вам нужно перенастроить виртуальные хосты, пользователей или их привилегии, не затрагивая остальную часть развёртывания.

source: Horizontal scaling of the MariaDB cluster makes sense only when you’re using an L7 balancer which can work properly with Galera clusters (like ProxySQL or MaxScale) instead of default HAProxy and the weak point of the current cluster is read performance rather than writes.
ru: Горизонтальное масштабирование кластера MariaDB имеет смысл только в том случае, если вы используете балансировщик L7, который может правильно работать с кластерами Galera (например, ProxySQL или MaxScale), а не стандартный HAProxy, и слабым местом текущего кластера является производительность чтения, а не записи.

source: Host Maintenance
ru: Техническое обслуживание хоста

source: Host capacity management
ru: Управление ресурсами хоста

source: However HAProxy is not capable of balancing MariaDB queries at an application level (L7 of OSI model), to separate read and write requests, so we have to balance TCP streams (L3) and pass all traffic without any separation to the current “primary” node in the Galera cluster, which creates a potential bottleneck.
ru: Однако, HAProxy не способен балансировать запросы MariaDB на уровне приложения (L7 модели OSI), чтобы разделять запросы на чтение и запись, поэтому нам приходится балансировать потоки TCP (L3) и передавать весь трафик без какого-либо разделения на текущий "основной" узел в кластере Galera, что создает потенциальное узкое место.
