Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: ru

source: If you wish to change the SHA to a specific SHA/tag/branch, or wish to use your own fork of an OpenStack service, please see the section titled :ref:`override_openstack_sources` in the user guide.
ru: Если вы хотите изменить SHA на определенный SHA/метку/ветвь или хотите использовать собственную ветку сервиса OpenStack, см. раздел :ref:`override_openstack_sources` в руководстве пользователя.

source: If your company is already invested in other configuration management system (Puppet) and does not want to use Ansible we recommend building on your existing knowledge and experimenting with a different OpenStack deployment project.
ru: Если ваша компания уже использует другую систему управления конфигурацией (Puppet) и не хочет использовать Ansible, мы рекомендуем вам опираться на имеющиеся у вас знания и экспериментировать с другим проектом развертывания OpenStack.

source: Image storage (glance)
ru: Хранение образов (glance)

source: In a typical production environment, physical network interfaces are combined in bonded pairs for better redundancy and throughput. Avoid using two ports on the same multiport network card for the same bonded interface, because a network card failure affects both of the physical network interfaces used by the bond. Multiple bonded interfaces (ie. bond0, bond1) can be used to segregate traffic, if desired. Single (bonded) interfaces are also a supported configuration, but will require the use of VLAN subinterfaces.
ru: В типичном рабочем окружении физические сетевые интерфейсы объединяются в связанные агреграции для лучшей избыточности и пропускной способности. Избегайте использования двух портов на одной и той же сетевой карте с несколькими портами для одного агрегрированного интерфейса, поскольку отказ сетевой карты влияет на оба физических сетевых интерфейса, используемых агрегацией. При желании для разделения трафика можно использовать несколько агрегрированных интерфейсов (например, bond0, bond1). Одиночные (агрегированные) интерфейсы также являются поддерживаемой конфигурацией, но для них потребуются субинтерфейсы VLAN.

source: In a typical production environment, physical network interfaces are combined in bonded pairs for better redundancy and throughput. Avoid using two ports on the same multiport network card for the same bonded interface, because a network card failure affects both of the physical network interfaces used by the bond. Single (bonded) interfaces are also a supported configuration, but will require the use of VLAN subinterfaces.
ru: В типичном рабочем окружении физические сетевые интерфейсы объединяются в агрегированные пары для лучшей избыточности и пропускной способности. Избегайте использования двух портов на одной и той же многопортовой сетевой карте для одного агрегированного интерфейса, поскольку отказ сетевой карты влияет на оба физических сетевых интерфейса, используемых агрегацией. Отдельные (агрегированные) интерфейсы также являются поддерживаемой конфигурацией, но потребуют использования субинтерфейсов VLAN.

source: In addition to this argument, the base environment skeleton is provided in the ``inventory/env.d`` directory of the OpenStack-Ansible codebase.
ru: В дополнение к этому аргументу, базовый скелет среды предоставляется в каталоге ``inventory/env.d`` кодовой базы OpenStack-Ansible.

source: In all versions prior to |previous_release_formal_name|, this argument was ``--file``.
ru: Во всех версиях до |previous_release_formal_name|, этим аргументом был ``--file``.

source: In many environments, the ephemeral disks are stored on the Compute host's local disks, but for production environments we recommend that the Compute hosts be configured to use a shared storage subsystem instead. A shared storage subsystem allows quick, live instance migration between Compute hosts, which is useful when the administrator needs to perform maintenance on the Compute host and wants to evacuate it. Using a shared storage subsystem also allows the recovery of instances when a Compute host goes offline. The administrator is able to evacuate the instance to another Compute host and boot it up again. The following diagram illustrates the interactions between the storage device, the Compute host, the hypervisor, and the instance.
ru: Во многих средах временные диски хранятся на локальных дисках вычислительного хоста, но для рабочих окружений мы рекомендуем настроить вычислительные хосты на использование общей подсистемы хранения. Общая подсистема хранения позволяет быстро выполнять динамическую миграцию инстансов между вычислительными хостами, что полезно, когда администратору необходимо выполнить обслуживание вычислительного хоста и он хочет его эвакуировать. Использование общей подсистемы хранения также позволяет восстанавливать инстансы, когда вычислительный хост отключается. Администратор может эвакуировать инстанс на другой вычислительный хост и снова загрузить его. На следующей схеме показано взаимодействие между устройством хранения, вычислительным хостом, гипервизором и инстансом.

source: In order to achieve that we need:
ru: Для этого нам необходимо:

source: In order to ensure a common understanding of what release versions mean, we use `Semantic Versioning 2.0.0`_ for versioning as a basis. The exception to the rule is for milestone releases during a development cycle, where releases are tagged ``<MAJOR>.0.0.0b<MILESTONE>`` where ``<MAJOR>`` is the next major release number, and ``<MILESTONE>`` is the milestone number.
ru: Чтобы обеспечить общее понимание того, что означают версии релиза, мы используем `Semantic Versioning 2.0.0`_ для версионирования в качестве основы. Исключением из правила являются выпуски вех в ходе цикла разработки, где выпуски помечаются как ``<MAJOR>.0.0.0b<MILESTONE>``, где ``<MAJOR>`` - это следующий номер основного релиза, а ``<MILESTONE>`` - это номер этапа.

source: In some cases it may be useful to have an ability to add extra network interface for some container group (or just a single container). As an example this can be used for applying known fixed IP address from another network for Designate service. We will show futher configuration based on this example. Let's assume, that this network is 10.0.20.0/24 which is reachable through `br-dns` interface.
ru: В некоторых случаях может быть полезно иметь возможность добавлять дополнительный сетевой интерфейс для некоторой группы контейнеров (или просто для одного контейнера). В качестве примера это может быть использовано для применения известного фиксированного IP-адреса из другой сети для службы Designate. Мы покажем дальнейшую конфигурацию на основе этого примера. Предположим, что эта сеть 10.0.20.0/24, которая доступна через интерфейс `br-dns`.

source: In some cases you might want to generate inventory on operator local machines after altering openstack_user_config.yml or env.d/conf.d files. Given that you already have ``openstack_deploy`` directory on such machine, you can create tox.ini file in that directory with following content:
ru: В некоторых случаях вам может понадобиться сгенерировать inventory на локальных машинах оператора после изменения файлов openstack_user_config.yml или env.d/conf.d. Учитывая, что у вас уже есть каталог ``openstack_deploy`` на такой машине, вы можете создать файл tox.ini в этом каталоге со следующим содержимым:

source: In some environments SSH network that is used to access nodes from deploy host and management network are different. In this case it's important that services were listening on correct network while ensure that Ansible use SSH network for accessing managed hosts. In these cases you can define ``management_ip`` key while defining hosts in your ``openstack_user_config.yml`` file.
ru: В некоторых средах сеть SSH, используемая для доступа к узлам с хоста развертывания, и сеть управления различаются. В этом случае важно, чтобы службы прослушивали правильную сеть, а Ansible использовал сеть SSH для доступа к управляемым хостам. В этих случаях вы можете определить ключ ``management_ip`` при определении хостов в файле ``openstack_user_config.yml``.

source: In these files, the target hosts are listed under one or more headings, such as ``shared-infra_hosts`` or ``storage_hosts``, which serve as Ansible group mappings. These groups map to the physical hosts.
ru: В этих файлах целевые хосты перечислены под одним или несколькими заголовками, такими как ``shared-infra_hosts`` или ``storage_hosts``, которые служат в качестве сопоставлений групп Ansible. Эти группы сопоставлены с физическими хостами.

source: In this chapter, you can find details about `why` OpenStack-Ansible was architected in this way.
ru: В этом разделе вы можете найти детали о том, `почему` OpenStack-Ansible был организован данным образом.

source: In this chapter, you can find the information on how to configure the openstack-ansible dynamic inventory to your needs.
ru: В этой главе вы найдете информацию о том, как настроить динамический inventory openstack-ansible в соответствии с вашими потребностями.

source: In this section, you will find documentation relevant to the inventory for OpenStack-Ansible.
ru: В этом разделе вы найдете документацию, касающуюся inventory OpenStack-Ansible.

source: In this task the ``test.ini.j2`` file is a template which will be rendered and written to disk at ``/tmp/test.ini``. The **config_overrides** entry is a dictionary (hash) which allows a deployer to set arbitrary data as overrides to be written into the configuration file at run time. The **config_type** entry specifies the type of configuration file the module will be interacting with; available options are "yaml", "json", and "ini".
ru: В этой задаче файл ``test.ini.j2`` является шаблоном, который будет визуализирован и записан на диск в ``/tmp/test.ini``. Запись **config_overrides** представляет собой словарь (хэш), который позволяет оператору устанавливать произвольные данные в качестве переопределений для записи в файл конфигурации во время выполнения. Запись **config_type** указывает тип файла конфигурации, с которым будет взаимодействовать модуль; доступные параметры: "yaml", "json" и "ini".

source: Including OpenStack-Ansible in your project
ru: Включение OpenStack-Ansible в ваш проект

source: Including OpenStack-Ansible with your Ansible structure
ru: Добавление OpenStack-Ansible в вашу структуру Ansible

source: Including the OpenStack-Ansible repository within another project can be done in several ways:
ru: Включение репозитория OpenStack-Ansible в другой проект можно осуществить несколькими способами:

source: Information on a per-host basis can be obtained with the ``--export/-e`` parameter.
ru: Информацию по каждому хосту можно получить с помощью параметра ``--export/-e``.

source: Infrastructure services
ru: Инфраструктурные услуги

source: Inputs
ru: Вводные

source: Inspecting and manipulating the inventory
ru: Проверка и управление inventory

source: Installing extra Python packages inside Ansible virtualenv
ru: Установка дополнительных пакетов Python внутри Ansible virtualenv

source: Installing extra playbooks using collections, and referencing the playbook with its FQCN is the most robust approach to including additional user defined playbooks.
ru: Установка дополнительных сценариев с использованием коллекций и ссылка на сценарий с его полным именем FQCN — наиболее надежный подход к включению дополнительных пользовательских сценариев.

source: Introduction
ru: Введение

source: Inventory conventions
ru: Правила inventory

source: Isolation
ru: Изоляция

source: It is easy for a deployer to keep this file under their own version control and out of the OpenStack-Ansible tree.
ru: Разработчик может легко сохранить этот файл под своим собственным контролем версий и вне дерева OpenStack-Ansible.

source: It should be in the native format of the ansible-galaxy requirements file and can be used to add new collections to the deploy host or override versions or source for collections defined in ``ansible-collection-requirements``.
ru: Он должен быть в собственном формате файла требований ansible-galaxy и может использоваться для добавления новых коллекций на хост развертывания или переопределения версий или источника для коллекций, определенных в ``ansible-collection-requirements``.

source: Least privilege
ru: Наименьшие привилегии

source: Let's assume you have 3 controllers and each of them is placed in different Availability Zones. There is also a compute node in each Availability Zone. And we want each host or container that is placed physically in a specific AZ be part of it's own group (ie ``azN_all``)
ru: Предположим, у вас есть 3 контроллера, и каждый из них размещен в разных Зонах доступности. В каждой Зоне доступности также есть вычислительный узел. И мы хотим, чтобы каждый хост или контейнер, который физически размещен в определенной AZ, был частью своей собственной группы (т. е. ``azN_all``)

source: Like ``--check``, this flag is not invoked when running from ansible.
ru: Как и ``--check``, этот флаг не вызывается при запуске из ansible.

source: Limiting access to these networks has several benefits:
ru: Ограничение доступа к этим сетям имеет ряд преимуществ:

source: Linux Bridges/Switches
ru: Мосты/коммутаторы Linux

source: Linux Container commands
ru: Команды Linux контейнера

source: List containers and summary information such as operational state and network configuration:
ru: Список контейнеров и сводная информация, такая как рабочее состояние и конфигурация сети:

source: Load balancer
ru: Балансировщик нагрузки

source: Major releases are done every six months according to the `OpenStack release schedule`_. Each major release is consistent with an OpenStack series.
ru: Основные релизы выпускаются каждые шесть месяцев в соответствии с `графиком релизов OpenStack`_. Каждый основной релиз соответствует серии OpenStack.

source: Many of the services deployed with OpenStack-Ansible are encrypted by default or offer encryption as an option. The playbooks generate self-signed certificates by default, but deployers have the option to use their existing certificates, keys, and CA certificates.
ru: Многие из сервисов, развернутых с помощью OpenStack-Ansible, зашифрованы по умолчанию или предлагают шифрование в качестве опции. Плейбуки генерируют самоподписанные сертификаты по умолчанию, но у оператора есть возможность использовать свои существующие сертификаты, ключи и сертификаты CA.

source: Many operational requirements have been taken into consideration for the design of the OpenStack-Ansible project.
ru: Много эксплуатационных требований было принято во внимания для дизайна проекта OpenStack-Ansible.

source: MariaDB with Galera
ru: MariaDB с Galera

source: Metal networking
ru: Сеть на физических серверах

source: Minor/patch releases are requested for stable branches on the second and last Friday of every month. The releases are typically completed within a few days of the request.
ru: Незначительные выпуски/патчи запрашиваются для стабильных веток во вторую и последнюю пятницу каждого месяца. Релизы обычно завершаются в течение нескольких дней с момента запроса.

source: Modify the ``container_skel`` section of the ``env.d/galera.yml`` file. For example:
ru: Измените раздел ``container_skel`` файла ``env.d/galera.yml``. Например:

source: Most often, overrides are implemented for the ``<service>.conf`` files (for example, ``nova.conf``). These files use a standard INI file format.
ru: Чаще всего переопределения реализуются для файлов ``<service>.conf`` (например, ``nova.conf``). Эти файлы используют стандартный формат INI-файла.

source: Network diagrams
ru: Сетевые схемы

source: Network namespaces provide logically separate layer 3 environments (similar to VRFs) within a host. Namespaces use virtual interfaces to connect with other namespaces, including the host namespace. These interfaces, often called ``veth`` pairs, are virtually plugged in between namespaces similar to patch cables connecting physical devices such as switches and routers.
ru: Сетевые пространства имен предоставляют логически отдельные среды уровня 3 (похожие на VRF) в хосте. Пространства имен используют виртуальные интерфейсы для соединения с другими пространствами имен, включая пространство имен хоста. Эти интерфейсы, часто называемые парами ``veth``, виртуально подключаются между пространствами имен, подобно коммутационным кабелям, соединяющим физические устройства, такие как коммутаторы и маршрутизаторы.

source: Networking Node
ru: Сетевой узел

source: Neutron agents can be deployed across a variety of hosts, but are typically limited to dedicated network hosts or infrastructure hosts (controller nodes). Neutron agents are deployed "on metal" and not within an LXC container. Neutron typically requires the operator to define "provider bridge mappings", which map a provider network name to a physical interface. These provider bridge mappings provide flexibility and abstract physical interface names when creating provider networks.
ru: Агенты Neutron могут быть развернуты на различных хостах, но обычно ограничиваются выделенными сетевыми хостами или инфраструктурными хостами (узлами контроллеров). Агенты Neutron развертываются внутри ОС, а не внутри контейнера LXC. Обычно Neutron требует от оператора определения "сопоставлений мостов провайдера", которые сопоставляют имя сети провайдера с физическим интерфейсом. Эти сопоставления мостов провайдера обеспечивают гибкость и абстрактные имена физических интерфейсов при создании сетей провайдера.

source: Neutron traffic
ru: Трафик Neutron

source: Never edit or delete the file ``/etc/openstack_deploy/openstack_inventory.json``. This can lead to problems with the inventory: existng hosts and containers will be unmanaged and new ones will be generated instead, breaking your existing deployment.
ru: Никогда не редактируйте и не удаляйте файл ``/etc/openstack_deploy/openstack_inventory.json``. Это может привести к проблемам с inventory: существующие хосты и контейнеры будут неуправляемыми, а вместо них будут созданы новые, что нарушит существующее развертывание.

source: Next, edit your ``/etc/openstack_deploy/user_variables.yml`` file to indicate the path to the requirements git repository, and the git hash of the commit containing your changes using the ``requirements_git_repo`` and ``requirements_git_install_branch`` variables. When using the local filesystem, the ``requirements_git_repo`` should start with ``file://``.
ru: Далее отредактируйте файл ``/etc/openstack_deploy/user_variables.yml``, чтобы указать путь к репозиторию git требований и хэш git коммита, содержащего ваши изменения, используя переменные ``requirements_git_repo`` и ``requirements_git_install_branch``. При использовании локальной файловой системы ``requirements_git_repo`` должен начинаться с ``file://``.

source: Not all services are containerized: some don't make sense to run within a container. Logic needs to be applied in regards on how services are containerized. If their requirements can't be met due to system limitations, (kernel, application maturity, etc...), then the service is not set to run within a container.
ru: Не все сервисы контейнеризованы: запуск некоторых в контейнере не целесообразен. Логика должна быть применена в зависимости от того как сервисы контейнеризуются. Если их требования не могут быть удовлетворены из-за системных ограничений (ядро, основательность приложения и тд), тогда сервис не запускается в контейнере.

source: Note that any services marked with ``is_metal: true`` will run on the allocated physical host and not in a container. For an example of ``is_metal: true`` being used refer to ``inventory/env.d/cinder.yml`` in the ``container_skel`` section.
ru: Обратите внимание, что любые службы, отмеченные ``is_metal: true``, будут работать на выделенном физическом хосте, а не в контейнере. Пример использования ``is_metal: true`` см. в ``inventory/env.d/cinder.yml`` в разделе ``container_skel``.

source: Nova compute (for direct access to virtualization devices)
ru: Вычислительная служба nova (для доступа к устройствам виртуализации)

source: Now you can leverage ``group_vars`` file to apply a variable to all containers and bare metal hosts in AZ. For example ``/etc/openstack_deploy/group_vars/az1_all.yml``:
ru: Теперь вы можете использовать файл ``group_vars``, чтобы применить переменную ко всем контейнерам и хостам bare metal в AZ. Например, ``/etc/openstack_deploy/group_vars/az1_all.yml``:

source: Object Storage (swift)
ru: Объектное хранилище (swift)

source: Offers automation for upgrades between major OpenStack releases.
ru: Обеспечивает автоматизацию обновлений между основными версиями OpenStack.

source: Omit a service or component from the deployment
ru: Исключить службу или компонент из развертывания

source: Once executed, the script will output an ``openstack_inventory.json`` file into the directory specified with the ``--config`` argument. This is used as the source of truth for repeated runs.
ru: После выполнения скрипт выведет файл ``openstack_inventory.json`` в каталог, указанный с помощью аргумента ``--config``. Он используется как источник истины для повторных запусков.

source: Once the variables are set call the play ``repo-build.yml`` to build all of the wheels within the repository infrastructure. When ready run the target plays to deploy your overridden source code.
ru: После установки переменных запустите ``repo-build.yml`` для сборки всех колес в инфраструктуре репозитория. Когда все будет готово, запустите целевое воспроизведение для развертывания вашего переопределенного исходного кода.

source: Open vSwitch/OVN Example:
ru: Пример Open vSwitch/OVN:

source: OpenStack Resources
ru: Ресурсы OpenStack

source: OpenStack clouds provide many services to end users, that enable them to build instances, provision storage, and create networks. Each of these services exposes one or more service ports and API endpoints to the network.
ru: OpenStack предоставляет множество услуг конечным пользователям, которые позволяют им создавать инстансы, предоставлять хранилище и создавать сети. Каждая из этих услуг предоставляет один или несколько портов услуг и точек доступа API в сеть.

source: OpenStack has many configuration options available in ``.conf`` files (in a standard ``INI`` file format), policy files (in a standard ``JSON`` format) and ``YAML`` files, and can therefore use the ``config_template`` module described above.
ru: OpenStack имеет множество параметров конфигурации, доступных в файлах ``.conf`` (в стандартном формате ``INI``), файлах политик (в стандартном формате ``JSON``) и файлах ``YAML``, и поэтому может использовать модуль ``config_template``, описанный выше.

source: OpenStack has multiple storage realms to consider:
ru: OpenStack имеет несколько областей хранения, которые следует учитывать:

source: OpenStack services
ru: Службы OpenStack

source: OpenStack services use Memcached for in-memory caching, which accelerates transactions. For example, the OpenStack Identity service (Keystone) uses Memcached for caching authentication tokens, which ensures that token validation does not have to complete a disk or database transaction every time the service is asked to validate a token.
ru: Службы OpenStack используют Memcached для кэширования в памяти, что ускоряет транзакции. Например, служба идентификации OpenStack (Keystone) использует Memcached для кэширования токенов аутентификации, что гарантирует, что проверка токена не должна завершать транзакцию на диске или в базе данных каждый раз, когда служба запрашивает проверку токена.
