Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: ru

source: The new container runs a single-node Galera cluster, which is a dangerous state because the environment contains more than one active database with potentially different data.
ru: Новый контейнер запускает кластер Galera с одним узлом, что является опасным состоянием, поскольку среда содержит более одной активной базы данных с потенциально разными данными.

source: The number of forks used may be changed on a permanent basis by including the appropriate change to the ``ANSIBLE_FORKS`` in your ``.bashrc`` file. Alternatively it can be changed for a particular playbook execution by using the ``--forks`` CLI parameter. For example, the following executes the nova playbook against the control plane with 10 forks, then against the compute nodes with 50 forks.
ru: Количество используемых forks можно изменить на постоянной основе, внеся соответствующие изменения в ``ANSIBLE_FORKS`` в файл ``.bashrc``. В качестве альтернативы его можно изменить для конкретного выполнения плейбука, используя параметр CLI ``--forks``. Например, следующий код выполняет nova playbook в плоскости управления с 10 forks, а затем на вычислительных узлов с 50 forks.

source: The playbook above is not idempotent as it will override database content on the destination hosts.
ru: Вышеуказанный плейбук не является идемпотентным, так как он перезаписывает содержимое базы данных на хостах назначения.

source: The playbook restarts all other containers on the node.
ru: Плейбук перезапускает все остальные контейнеры на узле.

source: The playbook will fetch and install the code from the specified branch or commit SHA, applying the latest patches and fixes as defined. Using a pinned SHA ensures consistent versions across all hosts, while following the branch directly will always pull its current HEAD.
ru: Плейбук извлечёт и установит код из указанной ветки или коммита SHA, применяя последние исправления и патчи, как указано. Использование закреплённого SHA обеспечивает согласованность версий на всех хостах, а прямое отслеживание ветки всегда будет загружать её текущий HEAD.

source: The process of RabbitMQ migration will be pretty much the same as MariaDB with one exception – we need to preserve the same IP addresses for containers when moving them to the new hardware. Otherwise, we would need to re-configure all services (like cinder, nova, neutron, etc.) that rely on RabbitMQ as well, as contrary to MariaDB which is balanced through HAProxy, it’s a client who decides to which RabbitMQ backend it will connect.
ru: Процесс миграции RabbitMQ будет практически таким же, как и в случае с MariaDB, за одним исключением — при переносе контейнеров на новое оборудование необходимо сохранить те же IP-адреса. В противном случае нам придется перенастраивать все службы (такие как cinder, nova, neutron и т. д.), которые также используют RabbitMQ, поскольку, в отличие от MariaDB, которая балансируется через HAProxy, здесь клиент сам решает, к какому бэкенду RabbitMQ он будет подключаться.

source: The process will take less than a minute to complete. Instance creation is complete when the status is listed as active. Refresh the page to see the new active instance.
ru: Процесс займет меньше минуты. Создание инстанса завершено, когда статус отображается как активный. Обновите страницу, чтобы увидеть новый активный инстанс.

source: The remaining operational node becomes the primary node and begins processing SQL requests.
ru: Оставшийся рабочий узел становится основным узлом и начинает обработку SQL-запросов.

source: The same concepts apply to a multi-node cluster that exist in a single-node cluster. The only difference is that the various nodes will actually be running on different hosts. The key things to keep in mind when dealing with a multi-node cluster are:
ru: Те же концепции применимы к кластеру с несколькими узлами, которые существуют в кластере с одним узлом. Единственное отличие заключается в том, что различные узлы фактически будут работать на разных хостах. Ключевые моменты, которые следует иметь в виду при работе с кластером с несколькими узлами:

source: The steps detailed here match those performed by the ``run-upgrade.sh`` script. You can safely run these steps multiple times.
ru: Шаги, описанные здесь, совпадают с теми, которые выполняет сценарий ``run-upgrade.sh``. Вы можете смело выполнять эти шаги несколько раз.

source: The two most common modules used are the ``shell`` and ``copy`` modules. The ``shell`` module takes the command name followed by a list of space delimited arguments. It is almost like the command module, but runs the command through a shell (``/bin/sh``) on the remote node.
ru: Два наиболее часто используемых модуля — это модули ``shell`` и ``copy``. Модуль ``shell`` принимает имя команды, за которым следует список аргументов, разделенных пробелами. Он почти как модуль command, но запускает команду через оболочку (``/bin/sh``) на удаленном узле.

source: The type of container format, one of ``raw``, ``qcow2``, ``iso``, ``vmdk``,``vdi`` etc.
ru: Тип формата контейнера: один из следующих: ``raw``, ``qcow2``, ``iso``, ``vmdk``, ``vdi`` и т. д.

source: The user in the Secondary Region now has access to objects PUT in the Primary Region. The Secondary Region can PUT objects accessible by the user in the Primary Region.
ru: Пользователь во вторичном регионе теперь имеет доступ к объектам PUT в основном регионе. Вторичный регион может размещать объекты, доступные пользователю в основном регионе.

source: The user is ``admin`` in this example.
ru: В данном примере пользователем является ``admin``.

source: The utility container provides a CLI environment for additional configuration and management.
ru: Контейнер утилит предоставляет среду CLI для дополнительной настройки и управления.

source: The utility container provides a CLI environment for additional configuration and testing.
ru: Контейнер утилит предоставляет среду CLI для дополнительной настройки и тестирования.

source: The vCPU, Memory, and Disk configuration. Note that larger flavors can take a long time to create. If creating an instance for the first time and want something small with which to test, select ``m1.small``.
ru: Конфигурация vCPU, памяти и диска. Обратите внимание, что создание более крупных вариантов может занять много времени. Если вы создаете инстанс в первый раз и хотите что-то небольшое для тестирования, выберите ``m1.small``.

source: The |current_release_formal_name| release series of OpenStack-Ansible contains the code for migrating from |previous_release_formal_name| |previous_slurp_name| to |current_release_formal_name|.
ru: Серия релизов OpenStack-Ansible |current_release_formal_name| содержит код для миграции с |previous_release_formal_name| |previous_slurp_name| на |current_release_formal_name|.

source: Then update the neutron configuration.
ru: Затем обновите конфигурацию neutron.

source: Then update your compute nodes if necessary.
ru: Затем при необходимости обновите вычислительные узлы.

source: There are a number of different methodologies that can be used to improve the performance of RabbitMQ and MariaDB clusters. These methodologies include scaling up the clusters, using a different message broker or database, or optimizing the configuration of the clusters.
ru: Существует ряд различных методологий, которые можно использовать для повышения производительности кластеров RabbitMQ и MariaDB. Эти методологии включают в себя масштабирование кластеров, использование другого брокера сообщений или базы данных, а также оптимизацию конфигурации кластеров.

source: There are two types of nodes you can configure: disk and RAM nodes. Most commonly, you will use your nodes as disk nodes (preferred). Whereas RAM nodes are more of a special configuration used in performance clusters.
ru: Существует два типа узлов, которые вы можете настроить: дисковые и RAM-узлы. Чаще всего вы будете использовать свои узлы как дисковые узлы (предпочтительно). В то время как RAM-узлы — это скорее специальная конфигурация, используемая в кластерах высокой производительности.

source: These instructions assume an OpenStack-Ansible installation using LXC containers, VXLAN overlay, and the ML2/OVS driver.
ru: Эти инструкции предполагают установку OpenStack-Ansible с использованием контейнеров LXC, VXLAN и драйвера ML2/OVS.

source: This allows you to access and filter all service logs directly on the host using tools such as journalctl. This also allows log collectors running on the host to more seamlessly pick up and process journald log streams coming from all service containers.
ru: Это позволяет получать доступ ко всем журналам служб и фильтровать их непосредственно на хосте с помощью таких инструментов, как journalctl. Это также позволяет сборщикам логов, работающим на хосте, более эффективно собирать и обрабатывать потоки логов journald, поступающие из всех контейнеров служб.

source: This approach is not limited to Nova. You can apply the same method to any other OpenStack service managed by OpenStack-Ansible by overriding its corresponding ``<service>_git_install_branch`` variable.
ru: Этот подход применим не только к Nova. Вы можете применить тот же метод к любой другой службе OpenStack, управляемой OpenStack-Ansible, переопределив соответствующую переменную ``<service>_git_install_branch``.

source: This can also be done with the help of Ansible using the shell module:
ru: Это также можно сделать с помощью Ansible, используя модуль shell:

source: This can be accomplished with multiple commands:
ru: Это можно сделать с помощью нескольких команд:

source: This can lead to unexpected errors while running playbooks, and require cached facts to be regenerated.
ru: Это может привести к неожиданным ошибкам при запуске плейбуков и потребовать пересоздания кэшированных фактов.

source: This chapter describes how to create and access instances.
ru: В этой главе описывается, как создавать инстансы и получать к ним доступ.

source: This chapter goes through the verification steps for a basic operation of the OpenStack API and dashboard, as an administrator.
ru: В этой главе рассматриваются шаги проверки для базовой работы API и панели управления OpenStack в роли администратора.

source: This chapter is about scaling your environment using OpenStack-Ansible.
ru: Эта глава посвящена масштабированию вашего окружения с помощью OpenStack-Ansible.

source: This chapter is intended for OpenStack-Ansible specific maintenance tasks.
ru: Эта глава предназначена для конкретных задач по обслуживанию OpenStack-Ansible.

source: This chapter is intended to document OpenStack operations tasks that are integral to the operations support in an OpenStack-Ansible deployment.
ru: Эта глава предназначена для документирования операционных задач OpenStack, которые являются неотъемлемой частью операционной поддержки в развертывании OpenStack-Ansible.

source: This chapter is intended to document basic OpenStack operations to verify your OpenStack-Ansible deployment.
ru: В этой главе описываются основные операции OpenStack для проверки вашего развертывания OpenStack-Ansible.

source: This chapter is intended to help troubleshoot and resolve operational issues in an OpenStack-Ansible deployment.
ru: Эта глава предназначена для помощи в устранении неполадок и решении операционных проблем в развертывании OpenStack-Ansible.

source: This command calls on Ansible to run the ``example_group`` using the ``-m`` shell module with the ``-a`` argument which is the hostname command. You can substitute example_group for any groups you may have defined. For example, if you had ``compute_hosts`` in one group and ``infra_hosts`` in another, supply either group name and run the command. You can also use the ``*`` wild card if you only know the first part of the group name, for instance if you know the group name starts with compute you would use ``compute_h*``. The ``-m`` argument is for module.
ru: Эта команда вызывает Ansible для запуска ``example_group`` с помощью модуля оболочки ``-m`` с аргументом ``-a``, который является командой hostname. Вы можете заменить example_group на любые группы, которые вы могли определить. Например, если у вас есть ``compute_hosts`` в одной группе и ``infra_hosts`` в другой, укажите имя любой группы и выполните команду. Вы также можете использовать подстановочный знак ``*``, если знаете только первую часть имени группы, например, если вы знаете, что имя группы начинается с compute, вы должны использовать ``compute_h*``. Аргумент ``-m`` предназначен для module.

source: This command is similar to host evacuation but migrates all instances off the specified host while they are shutdown.
ru: Эта команда похожа на эвакуацию хоста, но переносит все инстансы с указанного хоста, пока они выключены.

source: This command is the same setting up hosts on a new installation. The ``galera_all`` and ``rabbitmq_all`` host groups are excluded to prevent reconfiguration and restarting of any of those containers as they need to be updated, but not restarted.
ru: Эта команда аналогична настройке хостов на новой установке. Группы хостов ``galera_all`` и ``rabbitmq_all`` исключены, чтобы предотвратить реконфигурацию и перезапуск этих контейнеров, поскольку их нужно обновить, но не перезапускать.

source: This command results in a cluster containing a single node. The ``wsrep_cluster_size`` value shows the number of nodes in the cluster.
ru: Эта команда создает кластер, содержащий один узел. Значение ``wsrep_cluster_size`` показывает количество узлов в кластере.

source: This does not cover any networking related to instance connectivity.
ru: Здесь не рассматриваются сетевые возможности, связанные с подключением инстансов.

source: This ensures that logs remain available for troubleshooting even after host restarts.
ru: Это гарантирует, что логи останутся доступными для устранения неполадок даже после перезапуска хоста.

source: This example limits journald's maximum disk usage to 20 GB and retains logs for 7 days.
ru: В этом примере максимальный размер используемого дискового пространства для journald ограничивается 20 ГБ, а журналы сохраняются в течение 7 дней.

source: This example will issue a reboot to the container named with ``neutron_agents_container_hostname_name`` from inside:
ru: В этом примере будет выполнена перезагрузка контейнера с именем ``neutron_agents_container_hostname_name`` изнутри:

source: This guide describes how to remove a compute node from an OpenStack-Ansible environment completely. Perform these steps with caution, as the compute node will no longer be in service after the steps have been completed. This guide assumes that all data and instances have been properly migrated.
ru: В этом руководстве описано, как полностью удалить вычислительный узел из окружения OpenStack-Ansible. Выполняйте эти шаги с осторожностью, так как после их завершения вычислительный узел больше не будет работать. В данном руководстве предполагается, что все данные и инстансы были перенесены должным образом.

source: This guide includes a suggested order for carrying out upgrades. This may need to be adapted dependent on the extent to which you have customised your OpenStack-Ansible deployment.
ru: В этом руководстве приведен предлагаемый порядок выполнения обновлений. Он может быть изменен в зависимости от степени настройки вашего развертывания OpenStack-Ansible.

source: This guide provides information about operating your OpenStack-Ansible deployment.
ru: В этом руководстве содержится информация об эксплуатации вашего развертывания OpenStack-Ansible.

source: This guide provides information about the upgrade process from |previous_release_formal_name| |previous_slurp_name| to |current_release_formal_name| for OpenStack-Ansible.
ru: В этом руководстве содержится информация о процессе обновления с |previous_release_formal_name| |previous_slurp_name| до |current_release_formal_name| для OpenStack-Ansible.

source: This guide provides information about upgrading from one distribution release to the next.
ru: В этом руководстве содержится информация о переходе с одного выпуска дистрибутива на другой.

source: This guide ranges from first operations to verify your deployment, to the major upgrades procedures.
ru: В этом руководстве описывается весь спектр действий: от первых операций по проверке развертывания до основных процедур обновления.

source: This guide was last updated when upgrading from Ubuntu 20.04 (Focal Fossa) to Ubuntu 22.04 (Jammy Jellyfish) during the Antelope (2023.1) release. For earlier releases please see other versions of the guide.
ru: Это руководство последний раз обновлялось при обновлении с Ubuntu 20.04 (Focal Fossa) до Ubuntu 22.04 (Jammy Jellyfish) во время релиза Antelope (2023.1). Для более ранних версий см. другие версии руководства.

source: This installs the ARA client and configures it as an Ansible callback.
ru: Это установит клиент ARA и настроит его как callback Ansible.

source: This is currently in-use by Keystone, Nova and Swift roles.
ru: В настоящее время эта функция используется в ролях Keystone, Nova и Swift.

source: This location is defined by the ``ANSIBLE_LOG_PATH`` environment variable.
ru: Это расположение определяется переменной среды ``ANSIBLE_LOG_PATH``.

source: This module transfers log files that might not be present, so a missing remote file will not be an error unless ``fail_on_missing`` is set to ``yes``.
ru: Этот модуль передает файлы журналов, которые могут отсутствовать, поэтому отсутствие удаленного файла не будет ошибкой, если только параметр ``fail_on_missing`` не установлен в ``yes``.

source: This option assigns security groups to an instance. The default security group activates when no customised group is specified here. Security Groups, similar to a cloud firewall, define which incoming network traffic is forwarded to instances.
ru: Эта опция назначает группы безопасности инстанса. Группа безопасности по умолчанию назначается в случае, если здесь не указана своя группа. Группы безопасности, подобно облачному файрволу, определяют, какой входящий сетевой трафик пересылается инстансам.

source: This option can be also recommended to improve deployment resilience – in case of cluster failure this will affect just one service rather than each and everyone in a common deployment use case. Another quite popular variation of this option can be having just standalone MariaDB/RabbitMQ instances per service, without any clusterization. The benefit of such a setup is very fast recovery, especially when talking about RabbitMQ.
ru: Этот вариант также можно рекомендовать для повышения отказоустойчивости развертывания — в случае сбоя кластера это повлияет только на одну службу, а не на все службы в общем случае развертывания. Другой довольно популярной вариацией этого варианта может быть наличие только автономных инстансов MariaDB/RabbitMQ для каждой службы без какой-либо кластеризации. Преимуществом такой настройки является очень быстрое восстановление, особенно когда речь идет о RabbitMQ.

source: This option is by far the least popular despite being very straightforward, as it has a pretty narrowed use case when it makes sense to scale this way.
ru: Этот вариант является наименее популярным, несмотря на свою простоту, поскольку его применение в случае, когда такой подход к масштабированию имеет смысл, довольно ограничено.

source: This option will describe how to move current MariaDB and RabbitMQ clusters to standalone nodes. This approach can be used to offload control-planes and provide dedicated resources for clusters.
ru: В этом разделе описывается, как перенести текущие кластеры MariaDB и RabbitMQ на отдельные узлы. Этот подход можно использовать для разгрузки плоскости управления (control plane) и предоставления выделенных ресурсов для кластеров.

source: This page contains compatability matrix of releases that are either in Extended Maintanence or already reached End of Life. We keep such matrix for historical reasons mainly and for deployments that forgot to get updated in time.
ru: Эта страница содержит матрицу совместимости релизов, которые либо находятся на расширенной поддержке, либо уже достигли конца срока службы. Мы храним такую матрицу в основном по историческим причинам, а также для развертываний, которые забыли вовремя обновить.

source: This section describes some of the more common commands to use your OpenStack cloud.
ru: В этом разделе описываются некоторые наиболее распространенные команды для использования облака OpenStack.

source: This section focuses on troubleshooting general host-to-host communication required for the OpenStack control plane to function properly.
ru: Этот раздел посвящен устранению неисправностей, связанных с обменом данными между хостами, необходимыми для правильной работы плоскости управления OpenStack.

source: This section will focus on troubleshooting general instance (VM) connectivity communication. This does not cover any networking related to instance connectivity. This is assuming a OpenStack-Ansible install using LXC containers, VXLAN overlay and the ML2/OVS driver.
ru: В этом разделе рассматривается устранение неисправностей связи между инстансами (ВМ) общего характера. Здесь не рассматриваются сетевые проблемы, связанные с подключением инстансов. Предполагается, что установка OpenStack-Ansible выполняется с использованием контейнеров LXC, VXLAN и драйвера ML2/OVS.

source: This step should be executed when you are re-configuring one of HAProxy hosts
ru: Этот шаг должен быть выполнен, когда вы переконфигурируете один из хостов HAProxy

source: This tag is used to generate and distribute SSH certificates, issued through ``openstack.osa.ssh_keypairs`` role.
ru: Этот тег используется для генерации и распространения сертификатов SSH, выдаваемых через роль ``openstack.osa.ssh_keypairs``.

source: This will serve as a shortcut for future operations and will make following the instruction more error-prone. For example:
ru: Это послужит кратчайшим путем для будущих операций и сделает выполнение инструкции более подверженным ошибкам. Например:

source: This work around is required for all Libvirt versions prior 1.2.17.
ru: Этот обходной путь необходим для всех версий Libvirt до 1.2.17.

source: Though usage of HA queues and even quorum queues makes all messages and queues to be mirrored to all or several cluster members. While quorum queues show way better performance, they still suffer from clustering traffic which still becomes a problem at a certain scale.
ru: Хотя использование HA-очередей и даже кворумных очередей приводит к тому, что все сообщения и очереди дублируются на всех или нескольких участников кластера. Несмотря на то, что кворумные очереди демонстрируют гораздо лучшую производительность, они по-прежнему страдают от кластерного трафика, который при определенном масштабе по-прежнему становится проблемой.

source: Though, to preserve quorum you should always have an odd number of cluster members or be prepared to provide extra configuration if using an even number of members.
ru: Однако, чтобы сохранить кворум, вы всегда должны иметь нечетное количество участников кластера или быть готовыми настроить дополнительную конфигурацию, если используете четное количество участников.

source: Thus, we also don’t care about the order of migration.
ru: Таким образом, нам также не важен порядок миграции.

source: To add a network to an instance, click the **Downwards Arrow** symbol in the **Networks field**.
ru: Чтобы добавить сеть к инстансу, нажмите на символ **стрелки вниз** в поле **Сети**.

source: To add more members to the RabbitMQ cluster execute the following steps:
ru: Чтобы добавить больше участников в кластер RabbitMQ, выполните следующие шаги:
