Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-reference.po
Languages: ru

source: The `LVMVolumeDriver`_ is designed as a reference driver implementation, which we do not recommend for production usage. The LVM storage back-end is a single-server solution that provides no high-availability options. If the server becomes unavailable, then all volumes managed by the ``cinder-volume`` service running on that server become unavailable. Upgrading the operating system packages (for example, kernel or iSCSI) on the server causes storage connectivity outages because the iSCSI service (or the host) restarts.
ru: `LVMVolumeDriver`_ разработан как реализация стандартного драйвера, которую мы не рекомендуем для использования в рабочем окружении. Серверная часть хранилища LVM представляет собой решение с одним сервером, которое не обеспечивает возможности высокой доступности. Если сервер становится недоступным, то все диски, управляемые службой ``cinder-volume``, работающей на этом сервере, становятся недоступными. Обновление пакетов операционной системы (например, ядра или iSCSI) на сервере приводит к сбоям в подключении к хранилищу, поскольку служба iSCSI (или хост) перезапускается.

source: The `Linux Security Modules`_ (LSM) framework allows administrators to set `mandatory access controls`_ (MAC) on a Linux system. MAC is different than `discretionary access controls`_ (DAC) because the kernel enforces strict policies that no user can bypass. Although any user might be able to change a DAC policy (such as ``chown bob secret.txt``), only the ``root`` user can alter a MAC policy.
ru: Фреймворк `Linux Security Modules`_ (LSM) позволяет администраторам устанавливать `обязательные элементы управления доступом`_ (MAC) в системе Linux. MAC отличается от `дискретных элементов управления доступом`_ (DAC), поскольку ядро ​​применяет строгие политики, которые ни один пользователь не может обойти. Хотя любой пользователь может изменить политику DAC (например, ``chown bob secret.txt``), только пользователь ``root`` может изменить политику MAC.

source: The ``--clear-ips`` parameter can be used to remove all container IP address information from the ``openstack_inventory.json`` file. Baremetal hosts will not be changed.
ru: Параметр ``--clear-ips`` можно использовать для удаления всей информации об IP-адресах контейнеров из файла ``openstack_inventory.json``. Хосты bare metal не будут изменены.

source: The ``--debug/-d`` parameter allows writing of a detailed log file for debugging the inventory script's behavior. The output is written to ``inventory.log`` in the current working directory.
ru: Параметр ``--debug/-d`` позволяет записывать подробный файл журнала для отладки поведения скрипта inventory. Вывод записывается в ``inventory.log`` в текущем рабочем каталоге.

source: The ``--environment/-e`` argument will take the path to a directory containing an ``env.d`` directory. This defaults to ``inventory/`` in the OpenStack-Ansible codebase.
ru: Аргумент ``--environment/-e`` укажет путь к каталогу, содержащему каталог ``env.d``. По умолчанию это ``inventory/`` в кодовой базе OpenStack-Ansible.

source: The ``/etc/openstack_deploy/env.d`` directory sources all YAML files into the deployed environment, allowing a deployer to define additional group mappings. This directory is used to extend the environment skeleton, or modify the defaults defined in the ``inventory/env.d`` directory.
ru: Каталог ``/etc/openstack_deploy/env.d`` содержит все файлы YAML в развернутой среде, позволяя оператору определять дополнительные сопоставления групп. Этот каталог используется для расширения скелета среды или изменения значений по умолчанию, определенных в каталоге ``inventory/env.d``.

source: The ``/etc/openstack_deploy/openstack_inventory.json`` file is read by default. An alternative file can be specified with ``--file``.
ru: Файл ``/etc/openstack_deploy/openstack_inventory.json`` считывается по умолчанию. Альтернативный файл можно указать с помощью ``--file``.

source: The ``all_containers`` group is automatically defined by OpenStack-Ansible. Any service component managed by OpenStack-Ansible maps to a subset of the ``all_containers`` inventory group, directly or indirectly through another intermediate container group.
ru: Группа ``all_containers`` автоматически определяется OpenStack-Ansible. Любой компонент службы, управляемый OpenStack-Ansible, сопоставляется с подмножеством группы инвентаризации ``all_containers``, напрямую или косвенно через другую промежуточную группу контейнеров.

source: The ``cinder-volume`` component is deployed directly on the host by default. See the ``env.d/cinder.yml`` file for this example.
ru: Компонент ``cinder-volume`` по умолчанию развертывается непосредственно на хосте. См. файл ``env.d/cinder.yml`` для этого примера.

source: The ``cinder-volume`` service does not run in a highly available configuration. When the ``cinder-volume`` service is configured to manage volumes on the same back end from multiple hosts or containers, one service is scheduled to manage the life cycle of the volume until an alternative service is assigned to do so. This assignment can be made through the `cinder-manage CLI tool`_. This configuration might change if `cinder volume active-active support spec`_ is implemented.
ru: Служба ``cinder-volume`` не работает в конфигурации высокой доступности. Когда служба ``cinder-volume`` настроена на управление дисками на одном и том же бекэнде с нескольких хостов или контейнеров, одна служба планируется для управления жизненным циклом диска, пока для этого не будет назначена альтернативная служба. Это назначение можно выполнить с помощью `cinder-manage CLI tool`_. Эта конфигурация может измениться, если будет реализована `cinder volume active-active support spec`_.

source: The ``haproxy.yml.example`` file in the ``conf.d/`` directory provides a simple example of defining a host group (``load_balancer_hosts``) with two hosts (``infra1`` and ``infra2``).
ru: Файл ``haproxy.yml.example`` в каталоге ``conf.d/`` содержит простой пример определения группы хостов (``load_balancer_hosts``) с двумя хостами (``infra1`` и ``infra2``).

source: The ``host_bind_override`` key is used to replace an LXC-related interface name with a physical interface name when a component is deployed on bare metal hosts. It will be used to populate ``network_mappings`` for Neutron.
ru: Ключ ``host_bind_override`` используется для замены имени интерфейса, связанного с LXC, на имя физического интерфейса при развертывании компонента на хостах bare metal. Он будет использоваться для заполнения ``network_mappings`` для Neutron.

source: The ``identity_hosts`` dictionary defines an Ansible inventory group named ``identity_hosts`` containing the three infra hosts. The configuration file ``inventory/env.d/keystone.yml`` defines additional Ansible inventory groups for the containers that are deployed onto the three hosts named with the prefix *infra*.
ru: Словарь ``identity_hosts`` определяет группу inventory Ansible с именем ``identity_hosts``, содержащую три хоста infra. Файл конфигурации ``inventory/env.d/keystone.yml`` определяет дополнительные группы inventory Ansible для контейнеров, которые развернуты на трех хостах, названных с префиксом *infra*.

source: The ``inventory.log`` file is appended to, not overwritten.
ru: Файл ``inventory.log`` добавляется, а не перезаписывается.

source: The ``network_interface`` override is used for Open vSwitch and OVN-based deployments, and requires a physical interface name which will be connected to the provider bridge (ie. br-ex) for flat and vlan-based provider and tenant network traffic.
ru: Переопределение ``network_interface`` используется для развертываний на основе Open vSwitch и OVN и требует имени физического интерфейса, который будет подключен к мосту провайдера (например, br-ex) для плоского и основанного на VLAN сетевого трафика провайдера и пользователя.

source: The ``nova-compute`` service configures the hypervisor to present the allocated instance disk as a device to the instance.
ru: Служба ``nova-compute`` настраивает гипервизор для представления выделенного инстансу диска в качестве устройства для инстанса.

source: The ``openstack-ansible-inventory`` takes the ``--config`` argument for the directory holding configuration from which to create the inventory. If not specified, the default is ``/etc/openstack_deploy/``.
ru: ``openstack-ansible-inventory`` принимает аргумент ``--config`` для каталога, содержащего конфигурацию, из которой создается inventory. Если не указано иное, по умолчанию используется ``/etc/openstack_deploy/``.

source: The ``openstack_inventory.json`` file is the source of truth for the environment. Deleting this in a production environment means that the UUID portion of container names will be regenerated, which then results in new containers being created. Containers generated under the previous version will no longer be recognized by Ansible, even if reachable via SSH.
ru: Файл ``openstack_inventory.json`` является источником истины для среды. Удаление этого в производственной среде означает, что часть UUID имен контейнеров будет сгенерирована заново, что затем приведет к созданию новых контейнеров. Контейнеры, сгенерированные в предыдущей версии, больше не будут распознаваться Ansible, даже если они доступны по SSH.

source: The ``openstack_user_config.yml.example`` file is heavily commented with the details of how to do more advanced container networking configuration. The contents of the file are shown here for reference.
ru: Файл ``openstack_user_config.yml.example`` подробно прокомментирован с подробностями о том, как сделать более расширенную конфигурацию сети контейнера. Содержимое файла показано здесь для справки.

source: The ``swift-proxy`` service is accessed by clients via the load balancer on the management network (``br-mgmt``). The ``swift-proxy`` service communicates with the Account, Container, and Object services on the Object Storage hosts via the storage network(``br-storage``). Replication between the Object Storage hosts is done via the replication network (``br-repl``).
ru: Клиенты получают доступ к сервису ``swift-proxy`` через балансировщик нагрузки в сети управления (``br-mgmt``). Сервис ``swift-proxy`` взаимодействует со сервисами Account, Container и Object на хостах Object Storage через сеть хранения (``br-storage``). Репликация между хостами Object Storage выполняется через сеть репликации (``br-repl``).

source: The ``swift.yml.example`` file provides a more complex example. Here, host variables for a target host are specified by using the ``container_vars`` key. OpenStack-Ansible applies all entries under this key as host-specific variables to any component containers on the specific host.
ru: Файл ``swift.yml.example`` предоставляет более сложный пример. Здесь переменные хоста для целевого хоста указываются с помощью ключа ``container_vars``. OpenStack-Ansible применяет все записи под этим ключом как переменные, специфичные для хоста, к любым контейнерам компонентов на определенном хосте.

source: The `principle of least privilege`_ is used throughout OpenStack-Ansible to limit the damage that could be caused if an attacker gains access to any credentials.
ru: `Принцип наименьших привилегий`_ используется во всем OpenStack-Ansible для ограничения ущерба, который может быть нанесен, если злоумышленник получит доступ к каким-либо учетным данным.

source: The ansible roles are stored under ``/etc/ansible/roles``.
ru: Роли Ansible хранятся в каталоге ``/etc/ansible/roles``.

source: The bridge ``lxcbr0`` is configured automatically and provides connectivity for the containers (via eth0) to the outside world, thanks to dnsmasq (dhcp/dns) + NAT.
ru: Мост ``lxcbr0`` настраивается автоматически и обеспечивает подключение контейнеров (через eth0) к внешнему миру благодаря dnsmasq (dhcp/dns) + NAT.

source: The code is generally located into ``/opt/openstack-ansible``.
ru: Код обычно располагается в ``/opt/openstack-ansible``.

source: The combination of containers and flexible deployment options requires implementation of advanced Linux networking features, such as bridges, switches, and namespaces.
ru: Сочетание контейнеров и гибких вариантов развертывания требует реализации расширенных сетевых функций Linux, таких как мосты, коммутаторы и пространства имен.

source: The containers are not a mean of securing a system. The containers were not chosen for any eventual security safe guards. The machine containers were chosen because of their practicality with regard to providing a more uniform OpenStack deployment. Even if the abstractions that the containers provides do improve overall deployment security these potential benefits are not the intention of the containerization of services.
ru: Цель контейнеров не в обеспечении дополнительной безопасности системы. Контейнеры были выбраны не для какой-то очевидной защиты. Контейнеры были выбраны из-за своей практичности с целью предоставления более универсальных развертываний OpenStack. Даже если абстракции, которые предоставляют контейнеры, улучшают общую безопасность развертывания, это потенциальные преимущества не были изначальной целью контейнеризации сервисов.

source: The default container architecture has been built in such a way to allow for scalability and highly available deployments.
ru: По умолчанию архитектура контейнеров была построена таким образом, что бы была возможность масштабируемости и высокодоступных развертываний.

source: The default layout does not rely exclusively on groups being subsets of other groups. The ``memcache`` component group is part of the ``memcache_container`` group, as well as the ``memcache_all`` group and also contains a ``memcached`` component group. If you review the ``playbooks/memcached-install.yml`` playbook, you see that the playbook applies to hosts in the ``memcached`` group. Other services might have more complex deployment needs. They define and consume inventory container groups differently. Mapping components to several groups in this way allows flexible targeting of roles and tasks.
ru: Макет по умолчанию не полагается исключительно на группы, являющиеся подмножествами других групп. Группа компонентов ``memcache`` является частью группы ``memcache_container``, а также группы ``memcache_all`` и также содержит группу компонентов ``memcached``. Если вы просмотрите сценарий ``playbooks/memcached-install.yml``, вы увидите, что сценарий применяется к хостам в группе ``memcached``. Другие службы могут иметь более сложные требования в развертывании. Они по-разному определяют и используют группы контейнеров inventory. Сопоставление компонентов с несколькими группами таким образом позволяет гибко нацеливать роли и задачи.

source: The default layout of containers and services in OpenStack-Ansible (OSA) is determined by the ``/etc/openstack_deploy/openstack_user_config.yml`` file and the contents of both the ``/etc/openstack_deploy/conf.d/`` and ``/etc/openstack_deploy/env.d/`` directories. You use these sources to define the *group* mappings that the playbooks use to target hosts and containers for roles used in the deploy.
ru: Макет контейнеров и служб по умолчанию в OpenStack-Ansible (OSA) определяется файлом ``/etc/openstack_deploy/openstack_user_config.yml`` и содержимым каталогов ``/etc/openstack_deploy/conf.d/`` и ``/etc/openstack_deploy/env.d/``. Вы используете эти источники для определения сопоставлений *групп*, которые плейбуки используют для определения хостов и контейнеров для ролей, используемых при развертывании.

source: The diagram shows a basic overview of the manila service (Shared Filesystems service).
ru: На схеме показан базовый обзор службы manila (служба общих файловых систем).

source: The diagram shows the following steps.
ru: На схеме показаны следующие шаги.

source: The dynamic inventory script does the following:
ru: Скрипт динамического inventory выполняет следующие действия:

source: The environment variables set would use ``../openstack-ansible/playbooks/<directory>``.
ru: Набор переменных среды будет использовать ``../openstack-ansible/playbooks/<directory>``.

source: The file ``scripts/inventory-manage.py`` is used to produce human readable output based on the ``/etc/openstack_deploy/openstack_inventory.json`` file.
ru: Файл ``scripts/inventory-manage.py`` используется для создания удобочитаемого вывода на основе файла ``/etc/openstack_deploy/openstack_inventory.json``.

source: The following are some useful commands to manage LXC:
ru: Ниже приведены некоторые полезные команды для управления LXC:

source: The following diagram illustrates how Block Storage is connected to instances.
ru: На следующей схеме показано, как блочное хранилище подключается к инстансам.

source: The following diagram illustrates how data is accessed and replicated.
ru: Следующая схема иллюстрирует, как осуществляется доступ к данным и их репликация.

source: The following diagram illustrates the interactions between the Image service, the storage device, and the ``nova-compute`` service when an instance is created.
ru: На следующей схеме показано взаимодействие между службой образов, устройством хранения и службой ``nova-compute`` при создании инстансов.

source: The following diagram shows how all of the interfaces and bridges interconnect to provide network connectivity to the OpenStack deployment:
ru: Следующая схема показывает, как все интерфейсы и мосты взаимосвязаны для предоставления соединения для развертывания OpenStack.

source: The following diagrams reflect the differences in the virtual network layout for supported network architectures.
ru: На следующих схемах отражены различия в компоновке виртуальной сети для поддерживаемых сетевых архитектур.

source: The following file must be present in the configuration directory:
ru: В каталоге конфигурации должен присутствовать следующий файл:

source: The following image demonstrates how the container network interfaces are connected to the host's bridges and physical network interfaces:
ru: Следующий рисунок отображает как сетевые интерфейсы контейнера соединены с мостами хоста и физическими сетевыми интерфейсами:

source: The following sections describe the services that OpenStack-Ansible deploys.
ru: В следующих разделах описываются службы, которые развертывает OpenStack-Ansible.

source: The general format for the variable names used for overrides is ``<service>_<filename>_<file extension>_overrides``. For example, the variable name used in these examples to add parameters to the ``nova.conf`` file is ``nova_nova_conf_overrides``.
ru: Общий формат имен переменных, используемых для переопределений, - ``<service>_<filename>_<file extension>_overrides``. Например, имя переменной, используемое в этих примерах для добавления параметров в файл ``nova.conf`` - ``nova_nova_conf_overrides``.

source: The general format for the variable names used for overrides is ``<service>_<filename>_<file extension>_overrides``. For example, the variable name used in this example to define a meter exclusion in the ``pipeline.yml`` file for the Telemetry service (ceilometer) is ``ceilometer_pipeline_yaml_overrides``.
ru: Общий формат имен переменных, используемых для переопределений, - ``<service>_<filename>_<file extension>_overrides``. Например, имя переменной, используемое в этом примере для определения исключения счетчика в файле ``pipeline.yml`` для службы телеметрии (ceilometer) - ``ceilometer_pipeline_yaml_overrides``.

source: The general format for the variable names used for overrides is ``<service>_policy_overrides``. For example, the variable name used in this example to add a policy to the Identity service (keystone) ``policy.json`` file is ``keystone_policy_overrides``.
ru: Общий формат для имен переменных, используемых для переопределений, - ``<service>_policy_overrides``. Например, имя переменной, используемое в этом примере для добавления политики в файл ``policy.json`` службы идентификации (keystone) - ``keystone_policy_overrides``.

source: The hook variables should be configured in a suitable ``user_variables.yml`` file. An example calling a playbook from a collection (installed using ``user-collection-requirements.yml``):
ru: Переменные хука должны быть настроены в подходящем файле ``user_variables.yml``. Пример вызова плейбука из коллекции (установленной с помощью ``user-collection-requirements.yml``):

source: The hypervisor presents the disk as a device to the instance.
ru: Гипервизор представляет диск как устройство для инстанса.

source: The list of overrides available may be found by executing:
ru: Список доступных переопределений можно найти, выполнив:

source: The lxc_hosts Group
ru: Группа lxc_hosts

source: The only exception to this process is for the ``master`` branch, which intentionally consumes the ``master`` branch from all roles between releases so that any changes are immediately integration tested.
ru: Единственное исключение из этого процесса — ветка ``master``, которая намеренно использует ветку ``master`` из всех ролей между выпусками, чтобы любые изменения немедленно подвергались интеграционному тестированию.

source: The path to this file can be changed by setting the ``OSA_USER_RC`` variable, but the ``OSA_CONFIG_DIR`` and ``OSA_USER_RC`` variables cannot re-defined or controlled through the ``user.rc`` file.
ru: Путь к этому файлу можно изменить, установив переменную ``OSA_USER_RC``, но переменные ``OSA_CONFIG_DIR`` и ``OSA_USER_RC`` нельзя переопределить или контролировать через файл ``user.rc``.

source: The paths to the ``openstack-ansible`` top level directory can be relative in this file.
ru: Пути к каталогу верхнего уровня ``openstack-ansible`` в этом файле могут быть относительными.

source: The points where a hook exists to call an external playbook are as follows:
ru: Точки, в которых существует возможность вызова внешнего сценария, следующие:

source: The relevant environment variables for OpenStack-Ansible are as follows:
ru: Соответствующие переменные среды для OpenStack-Ansible следующие:

source: The rendered file on disk, namely ``/tmp/test.ini`` looks like this:
ru: Готовый файл на диске, а именно ``/tmp/test.ini``, выглядит следующим образом:

source: The repository holds the reference set of artifacts that are used for the installation of the environment. The artifacts include:
ru: Репозиторий содержит стандартный набор артефактов, которые используются для установки среды. Артефакты включают:

source: The roles will be fetched into the standard ``ANSIBLE_ROLES_PATH``, which defaults to ``/etc/ansible/roles``.
ru: Роли будут загружены в стандартный ``ANSIBLE_ROLES_PATH``, который по умолчанию равен ``/etc/ansible/roles``.

source: The same JSON structure is printed to stdout, which is consumed by Ansible as the inventory for the playbooks.
ru: Та же структура JSON выводится в stdout, который используется Ansible в качестве inventory для плейбуков.

source: The same script can be used to safely remove hosts from the inventory, export the inventory based on hosts, and clear IP addresses from containers within the inventory files.
ru: Этот же скрипт можно использовать для безопасного удаления хостов из inventory, экспорта inventory на основе хостов и очистки IP-адресов из контейнеров в файлах inventory.

source: The same way you can apply overrides to the uwsgi services. For example:
ru: Таким же образом можно применить переопределения к службам uwsgi. Например:

source: The script that creates the inventory is located at ``inventory/dynamic_inventory.py`` and installed into the ansible-runtime virtualenv as ``openstack-ansible-inventory``.
ru: Скрипт, который создает inventory, находится в ``inventory/dynamic_inventory.py`` и устанавливается в ansible-runtime virtualenv как ``openstack-ansible-inventory``.
