Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: ru

source: In the example below we assume that only Neutron is being reconfigured to use the new standalone cluster, while other services remain sharing the already existing one. So Neutron connectivity will look like this:
ru: В приведенном ниже примере мы предполагаем, что только Neutron переконфигурируется для использования нового автономного кластера, в то время как другие службы продолжают использовать уже существующий кластер. Таким образом, подключение Neutron будет выглядеть следующим образом:

source: In the same way as OpenStack-Ansible major (and some minor) upgrades, there will be brief interruptions to the entire Galera and RabbitMQ clusters during the upgrade which will result in brief service interruptions.
ru: Так же, как и при крупных (и некоторых мелких) обновлениях OpenStack-Ansible, во время обновления будут наблюдаться кратковременные перерывы в работе всех кластеров Galera и RabbitMQ, что приведет к кратковременным перебоям в обслуживании.

source: In this example, ``galera_container`` has a container value of one. In practice, any containers that do not need adjustment can remain at the default value of one, and should not be adjusted above or below the value of one.
ru: В этом примере ``galera_container`` имеет значение контейнера, равное единице. На практике любые контейнеры, которые не требуют корректировки, могут оставаться со значением по умолчанию, равным единице, и не должны корректироваться выше или ниже значения единицы.

source: In this example, all nodes in the cluster contain the same positive ``seqno`` values as they were synchronized just prior to graceful shutdown. If all ``seqno`` values are equal, any node can start the new cluster.
ru: В этом примере все узлы в кластере содержат одинаковые положительные значения ``seqno``, поскольку они были синхронизированы непосредственно перед корректным завершением работы. Если все значения ``seqno`` равны, любой узел может запустить новый кластер.

source: In this example, node 3 failed.
ru: В этом примере узел 3 вышел из строя.

source: In this example, node 3 has failed.
ru: В этом примере узел 3 вышел из строя.

source: In this example, nodes 2 and 3 have failed. The remaining operational server indicates ``non-Primary`` because it cannot achieve quorum.
ru: В этом примере отказали узлы 2 и 3. Оставшийся рабочий сервер имеет статус ``non-Primary``, поскольку он не может достичь кворума.

source: In this example, only one node responded.
ru: В этом примере ответил только один узел.

source: In this series of articles, will be discussed the potential bottlenecks that can occur in large OpenStack deployments and ways to scale up deployments to improve the performance of RabbitMQ and MariaDB clusters.
ru: В этой серии статей будут рассмотрены потенциальные узкие места, которые могут возникнуть при развертывании крупных инсталляций OpenStack, а также способы масштабирования для повышения производительности кластеров RabbitMQ и MariaDB.

source: Individual OpenStack services, and other open source project services, run within containers. It is possible to scale out these services by modifying the ``/etc/openstack_deploy/openstack_user_config.yml`` file.
ru: Отдельные службы OpenStack и другие службы проектов с открытым исходным кодом работают в контейнерах. Масштабировать эти службы можно, изменив файл ``/etc/openstack_deploy/openstack_user_config.yml``.

source: Infrastructure services (Galera, RabbitMQ, APIs, HAProxy)
ru: Инфраструктурные сервисы (Galera, RabbitMQ, API, HAProxy)

source: Install MariaDB to this new container and add it to the cluster:
ru: Установите MariaDB в этот новый контейнер и добавьте его в кластер:

source: Installs a specific OpenStack service (replace ``<service>`` with the service name). A tag including the word ``install`` handles only software installation tasks — it deploys the necessary packages and binaries on the target host. Use this tag when you only need to install or reinstall service software without changing its configuration or running it.
ru: Устанавливает определенную службу OpenStack (замените ``<service>`` на имя службы). Тег, содержащий слово ``install``, обрабатывает только задачи установки программного обеспечения — он развертывает необходимые пакеты и бинарные файлы на целевом хосте. Используйте этот тег, когда вам нужно только установить или переустановить служебное программное обеспечение, не изменяя его конфигурацию и не запуская его.

source: Instances live migration
ru: Живая миграция инстансов

source: Introduction
ru: Введение

source: Invariably due to something in your environment, you are likely to lose a node in your cluster. In this scenario, multiple LXC containers on the same host are running RabbitMQ and are in a single RabbitMQ cluster.
ru: В любом случае по какой-либо причине в вашем окружении вы, скорее всего, потеряете узел в своем кластере. В этом сценарии несколько контейнеров LXC на одном хосте запускают RabbitMQ и находятся в одном кластере RabbitMQ.

source: Invoke the MariaDB command line tool.
ru: Вызовите командную строку MariaDB.

source: Is there a Neutron Router in play?
ru: Работает ли маршрутизатор Neutron?

source: Is there connectivity issue egress from the instance?
ru: Есть ли проблемы с подключением с инстанса?

source: Is there connectivity issue ingress to the instance?
ru: Есть ли проблемы с подключением к инстансу?

source: Issue the **openstack server create** command with a name for the instance, along with the name of the image and flavor to use:
ru: Введите команду **openstack server create**, указав имя инстанса, а также имя образа и шаблон конфигурации, которые следует использовать:

source: It explains how CLIs can be used as an admin and a user, to ensure the well-behavior of your cloud.
ru: В нем объясняется, как можно использовать CLI как администратору, так и пользователю, чтобы обеспечить бесперебойную работу вашего облака.

source: It explains operations such as managing images, instances, or networks.
ru: В нем объясняются такие действия, как управление образами, инстансами или сетями.

source: It is essential to plan and know how to replace failed hardware in your cluster without compromising your cloud environment.
ru: Очень важно спланировать и знать, как заменить вышедшее из строя оборудование в кластере без ущерба для вашего облачного окружения.

source: It is possible to do mass pruning of the inventory backup. The following example will prune all but the last 15 inventories from the running archive.
ru: Можно выполнить массовую очистку резервных копии inventory. Следующий пример очистит все, кроме последних 15 inventory из текущего архива.

source: It is recommended to perform the following steps before a failure occurs to avoid having to dump and restore the database.
ru: Рекомендуется выполнить следующие действия до того, как произойдет сбой, чтобы избежать необходимости делать дамп и восстанавливать базу данных.

source: It will not only tell Neutron to use the new database but also will switch it to using the new RabbitMQ cluster as well and re-enable the service in HAProxy.
ru: Это не только укажет Neutron использовать новую базу данных, но и переключит его на использование нового кластера RabbitMQ, а также повторно включит службу в HAProxy.

source: Join the cluster, and restart the application on the third node.
ru: Присоедините к кластеру и перезапустите приложение на третьем узле.

source: Join the cluster, then restart the application:
ru: Присоединитесь к кластеру, затем перезапустите приложение:

source: Kernel version
ru: Версия ядра

source: Libvirt TCP port to transfer the data to migrate.
ru: TCP-порт Libvirt для передачи данных для миграции.

source: Lines starting with ``WSREP_SST`` will appear during the sync process and you should see a line with ``WSREP: SST complete, seqno: <NUMBER>`` if the sync was successful.
ru: В процессе синхронизации появятся строки, начинающиеся с ``WSREP_SST``, а если синхронизация прошла успешно, вы должны увидеть строку ``WSREP: SST complete, seqno: <NUMBER>``.

source: Linux distribution
ru: Дистрибутив Linux

source: List all instances with Block Storage volumes attached:
ru: Отобразите все инстансы с подключенными дисками блочного хранилища:

source: List all running instances on the Compute host:
ru: Список всех запущенных инстансов на вычислительном узле:

source: Live migrate all instances of the specified host to other hosts if resource utilzation allows. It is best to use shared storage like Ceph or NFS for host evacuation.
ru: Живая миграция всех инстансов указанного хоста на другие хосты, если позволяют ресурсы. Лучше всего использовать общее хранилище, например Ceph или NFS, для эвакуации хоста.

source: Local versus shared storage
ru: Локальное и общее хранилище

source: Log Locations
ru: Расположение логов

source: Log in to any utility container or install the OpenStack client on your machine, and run the following commands:
ru: Войдите в любой контейнер утилит или установите клиент OpenStack на своем компьютере и выполните следующие команды:

source: Log in to any utility container.
ru: Войдите в любой контейнер утилит.

source: Log in to the Dashboard.
ru: Войдите в панель управления.

source: Log in to the Dashboard. Select one of the projects, and click :guilabel:`Instances`.
ru: Войдите в панель управления. Выберите один из проектов и нажмите :guilabel:`Инстансы`.

source: Log into the Dashboard, and select the :guilabel:`admin` project from the drop down list.
ru: Войдите в панель управления и выберите проект :guilabel:`admin` из выпадающего списка.

source: Log into your primary HAProxy/Keepalived and run something similar to
ru: Войдите в свой основной HAProxy/Keepalived и запустите что-то похожее на

source: Logging Services in OpenStack-Ansible
ru: Логирование служб в OpenStack-Ansible

source: Login to the 2nd and 3rd node and stop the RabbitMQ application.
ru: Авторизуйтесь во 2-й и 3-й узлы и остановите приложение RabbitMQ.

source: Maintenance tasks
ru: Задачи по техническому обслуживанию

source: Major upgrades
ru: Основные обновления

source: Make a backup of the configuration of the environment:
ru: Создайте резервную копию конфигурации окружения:

source: Make sure that containers from new infra host *does not* appear in inventory as first one for groups ``galera_all``, ``rabbitmq_all`` and ``repo_all``. You can verify that with ad-hoc commands:
ru: Убедитесь, что контейнеры с нового инфраcтруктурного хоста *не* появляются в inventory как первые для групп ``galera_all``, ``rabbitmq_all`` и ``repo_all``. Вы можете проверить это с помощью ad-hoc команд:

source: Make sure you back up your current OpenStack environment before adding any new nodes. See :ref:`backup-restore` for more information.
ru: Убедитесь, что вы сделали резервную копию текущего окружения OpenStack перед добавлением новых узлов. См. :ref:`backup-restore` для получения дополнительной информации.

source: Manages certificates and public key infrastructure. Use it when renewing, replacing, or troubleshooting SSL/TLS certificates.
ru: Управляет сертификатами и инфраструктурой открытых ключей. Используйте его при обновлении, замене или устранении неполадок SSL/TLS-сертификатов.

source: Manages service configuration inside Keystone, such as service catalog entries, service user existence, and user privileges.
ru: Управляет конфигурацией служб внутри Keystone, такой как записи каталога служб, существование пользователя службы и привилегии пользователя.

source: Manages systemd unit components, ensuring they are configured as expected and allowing overrides to be applied. Use this tag when you need to adjust unit files or restart services in a controlled way.
ru: Управляет компонентами юнита systemd, обеспечивая их правильную настройку и позволяя применять переопределения. Используйте этот тег, когда вам нужно настроить файлы юнита или перезапустить службы контролируемым образом.

source: Managing an instance
ru: Управление инстансом

source: Managing images
ru: Управление образами

source: Managing instances
ru: Управление инстансами

source: Managing networks
ru: Управление сетями

source: Managing volumes for persistent storage
ru: Управление дисками постоянного хранилища

source: Managing your cloud
ru: Управление вашим облаком

source: Manual upgrades are useful for scoping the changes in the upgrade process (for example, in very large deployments with strict SLA requirements), or performing other upgrade automation beyond that provided by OpenStack-Ansible.
ru: Ручное обновление полезно для определения масштаба изменений в процессе обновления (например, в очень крупных развертываниях со строгими требованиями к SLA) или для автоматизации других обновлений, помимо тех, что предоставляет OpenStack-Ansible.

source: Manually with ``rabbitmqctl``
ru: Вручную с помощью ``rabbitmqctl``

source: Map your new neutron-infra hosts to these new groups. To add to your ``openstack_user_config.yml`` the following content:
ru: Сопоставьте ваши новые хосты neutron-infra с этими новыми группами. Добавьте в файл ``openstack_user_config.yml`` следующее содержимое:

source: MariaDB data is available on the infrastructure nodes. You can recover databases, and rebuild the Galera cluster. For more information, see :ref:`galera-cluster-recovery`.
ru: Данные MariaDB доступны на узлах инфраструктуры. Вы можете восстановить базы данных и перестроить кластер Galera. Дополнительную информацию см. в :ref:`galera-cluster-recovery`.

source: MariaDB instances are restarted when creating a cluster, when adding a node, when the service is not running, or when changes are made to the ``/etc/mysql/my.cnf`` configuration file.
ru: Инстансы MariaDB перезапускаются при создании кластера, добавлении узла, когда служба не работает или когда вносятся изменения в конфигурационный файл ``/etc/mysql/my.cnf``.

source: Migrate between HA and Quorum queues
ru: Миграция между очередями HA и Quorum

source: Migrating MariaDB to the new hardware
ru: Перенос MariaDB на новое оборудование

source: Migrating RabbitMQ to the new hardware
ru: Перенос RabbitMQ на новое оборудование

source: Migrating the service to use new clusters
ru: Перенос службы для использования новых кластеров

source: Minor version upgrade
ru: Незначительное обновление версии

source: Mnesia is a distributed database that RabbitMQ uses to store information about users, exchanges, queues, and bindings. Messages, however are not stored in the database.
ru: Mnesia — это распределенная база данных, которую RabbitMQ использует для хранения информации о пользователях, обменах, очередях и привязках. Однако сообщения не хранятся в базе данных.

source: Modules can be used to control system resources or handle the execution of system commands. For more information about modules, see `Module Index <https://docs.ansible.com/ansible/modules_by_category.html>`_ and `About Modules <https://docs.ansible.com/ansible/modules.html>`_.
ru: Модули могут использоваться для управления системными ресурсами или обработки выполнения системных команд. Для получения дополнительной информации о модулях см. `Cправочник модулей <https://docs.ansible.com/ansible/modules_by_category.html>`_ и `О модулях <https://docs.ansible.com/ansible/modules.html>`_.

source: Monitoring the status
ru: Мониторинг статуса

source: Most Common Deployment
ru: Наиболее распространенное развертывание

source: Move `galera_root_password` from ``/etc/openstack_deploy/user_secrets.yml`` to ``/etc/openstack_deploy/group_vars/galera.yml``
ru: Переместите `galera_root_password` из ``/etc/openstack_deploy/user_secrets.yml`` в ``/etc/openstack_deploy/group_vars/galera.yml``

source: Navigate into the ``/etc/openstack_deploy/openstack_user_config.yml`` file.
ru: Перейдите в файл ``/etc/openstack_deploy/openstack_user_config.yml``.

source: Navigate to the ``openstack-ansible`` directory.
ru: Перейдите в каталог ``openstack-ansible``.

source: Network List
ru: Список сетей

source: Network interfaces
ru: Сетевые интерфейсы

source: Network nodes
ru: Сетевые узлы

source: Networking
ru: Сеть

source: Networking service
ru: Сетевая служба

source: Networking service (compute node)
ru: Сетевая служба (вычислительный узел)

source: New facts will be gathered and cached during the next playbook run.
ru: Новые факты будут собраны и занесены в кэш при следующем запуске плейбука.

source: New infra hosts should be prepared before this step (i.e., by running ``setup-hosts.yml`` playbook against them).
ru: Перед этим шагом необходимо подготовить новые инфраструктурные узлы (т. е. запустить на них плейбук ``setup-hosts.yml``).

source: Next we need to expand Galera/RabbitMQ clusters, which is done during ``setup-infrastructure.yml``. So we will run this playbook without limits:
ru: Далее нам нужно расширить кластеры Galera/RabbitMQ, что делается в файле ``setup-infrastructure.yml``. Поэтому мы запустим этот плейбук без ограничений:

source: Next, we will describe how to configure such a stack and execute the service transition to this new layout.
ru: Далее мы опишем, как настроить такой стек и выполнить переход службы на эту новую структуру.

source: No, we can stop the API service for Neutron:
ru: Нет, мы можем остановить службу API для Neutron:

source: No:
ru: Нет:

source: Note that more than 10 forks will cause issues for any playbooks which use ``delegate_to`` or ``local_action`` in the tasks. It is recommended that the number of forks are not raised when executing against the control plane, as this is where delegation is most often used.
ru: Обратите внимание, что более 10 forks вызовут проблемы для любых плейбуков, которые используют ``delegate_to`` или ``local_action`` в задачах. Рекомендуется не увеличивать количество forks при выполнении в плоскости управления, поскольку именно здесь делегирование используется чаще всего.

source: Nova configuration drive implication
ru: Использование конфигурационного привода Nova

source: Nova is capable of live migration instances from one host to a different host to support various operational tasks including:
ru: Nova способна осуществлять динамическую миграцию инстансов с одного хоста на другой хост для поддержки различных операционных задач, включая:

source: Now delete the targeted inventory archive.
ru: Теперь удалите целевой архив inventory.

source: Now let’s prepare the destination database: create the database itself along with required users and provide them permissions to interact with the database. For that, we will run the neutron role with a common-db tag and limit execution to the neutron_server group only. You can use the following command for that:
ru: Теперь давайте подготовим базу данных назначения: создадим саму базу данных вместе с необходимыми пользователями и предоставим им права на взаимодействие с базой данных. Для этого мы запустим роль neutron с тегом common-db и ограничим выполнение только группой neutron_server. Для этого можно использовать следующую команду:

source: Now let’s run the playbook we’ve just created:
ru: Теперь запустим только что созданный плейбук:

source: Now the repo host primary
ru: Теперь основной хост репозитория

source: Now we can proceed with container removal:
ru: Теперь мы можем приступить к удалению контейнера:

source: Now we need to manually re-generate the inventory and ensure that a new record was mapped to our infra01:
ru: Теперь нам нужно вручную пересоздать inventory и убедиться, что новая запись была связана с нашей инфраструктурой infra01:

source: Now you can proceed with container creation:
ru: Теперь можно приступить к созданию контейнера:

source: Now you need to re-configure ``openstack_user_config`` similar to how it was done for MariaDB. The resulting record at this stage for RabbitMQ should look like this:
ru: Теперь вам нужно перенастроить ``openstack_user_config`` аналогично тому, как это было сделано для MariaDB. Итоговая запись на этом этапе для RabbitMQ должна выглядеть следующим образом:

source: Object Storage service
ru: Служба объектного хранилища

source: On the :guilabel:`Project` tab, open the :guilabel:`Instances` tab and click the :guilabel:`Launch Instance` button.
ru: На вкладке :guilabel:`Проект` откройте вкладку :guilabel:`Инстансы` и нажмите кнопку :guilabel:`Запустить инстанс`.

source: On the RabbitMQ second node, execute:
ru: На втором узле RabbitMQ выполните:

source: On the command line, instance creation is managed with the **openstack server create** command. Before launching an instance, determine what images and flavors are available to create a new instance using the **openstack image list** and **openstack flavor list** commands.
ru: В командной строке создание инстанса выполняется командой **openstack server create**. Перед запуском инстанса определите, какие образы и шаблоны конфигураций доступны для создания нового инстанса с помощью команд **openstack image list** и **openstack flavor list**.

source: On the deployment host, configure the client with:
ru: На хосте развертывания настройте клиент с помощью:

source: On the host, all virtual Ethernet devices are named based on their container as well as the name of the interface inside the container:
ru: На хосте все виртуальные Ethernet-устройства именуются на основе их контейнера, а также имени интерфейса внутри контейнера:

source: Once MariaDB cluster is healthy you can remove the file that disables backend from being used by HAProxy.
ru: Когда кластер MariaDB будет здоров, вы можете удалить файл, который запрещает бекэнду использовать HAProxy.

source: Once a new RabbitMQ container is deployed, you need to make all services aware of its existence by re-configuring them. For that, you can either run individual service playbooks, like this:
ru: После развертывания нового контейнера RabbitMQ необходимо перенастроить все службы, чтобы они распознавали его существование. Для этого можно запустить отдельные плейбуки для служб, например так:

source: Once infrastructure playboks are done, it's turn of OpenStack services to be deployed. Most of the services are fine to be ran with limits, but some, like keystone, are not. So we run keystone playbook separately from all others:
ru: После того, как инфраструктурные плейбуки завершили работу, очередь за развертыванием служб OpenStack. Большинство служб можно запускать с ограничениями, но некоторые, например, keystone — нет. Поэтому мы запускаем плейбук keystone отдельно от всех остальных:

source: Once it's done you can run playbook to install MariaDB to the destination
ru: Когда все готово, вы можете запустить плейбук для установки MariaDB в место назначения

source: Once that is complete, upgrade the final host groups with the flag to prevent container restarts.
ru: После этого обновите последние группы хостов, установив флаг для предотвращения перезапуска контейнеров.

source: Once the Compute host comes back online, confirm everything is in working order and start the instances on the host. For example:
ru: Как только вычислительный узел вернется в сеть, убедитесь, что все работает, и запустите инстансы на нем. Например:

source: Once the cluster is re-established, it’s worth to clean-up cluster status with regards to the old container name still being considered as “Disk Node”, since the container name has changed:
ru: После восстановления кластера стоит очистить статус кластера в отношении старого имени контейнера, которое по-прежнему считается "дисковым узлом", поскольку имя контейнера изменилось:

source: Once the database content is in place, we can now re-configure the service using the playbook.
ru: После того, как содержимое базы данных находится на месте, мы можем перенастроить службу с помощью плейбука.
