Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc-admin.po
Languages: ru

source: Run the following command to `rebootstrap <https://galeracluster.com/library/documentation/quorum-reset.html>`_ the operational node into the cluster:
ru: Выполните следующую команду для `загрузки <https://galeracluster.com/library/documentation/quorum-reset.html>`_ рабочего узла в кластер:

source: Run the following command to remove all currently cached facts for all hosts:
ru: Выполните следующую команду, чтобы удалить все текущие кэшированные факты для всех хостов:

source: Run the following commands to add the host. Replace ``NEW_HOST_NAME`` with the name of the new host.
ru: Запустите следующие команды, чтобы добавить хост. Замените ``new_host_name`` на имя нового хоста.

source: Run the following commands:
ru: Выполните следующие команды:

source: Run the host setup playbook to rebuild the container on node 3:
ru: Запустите плейбук настройки хоста, чтобы перестроить контейнер на узле 3:

source: Run the infrastructure playbook to configure the container specifically on node 3:
ru: Запустите инфраструктурный плейбук для настройки контейнера специально на узле 3:

source: Run the playbook openstack.osa.openstack_resources with the tag network-resources:
ru: Запустите плейбук openstack.osa.openstack_resources с тегом network-resources:

source: Running ad-hoc Ansible plays
ru: Запуск ad-hoc команд Ansible

source: Running the copy module
ru: Запуск модуля copy

source: Running the shell module
ru: Запуск shell модуля

source: Running the upgrade script
ru: Запуск скрипта обновления

source: Runs tasks after the main installation and configuration are complete. This tag is used for final adjustments, applying changes in configuration files, and validation checks. Run this tag when you’ve made changes that require only applying updated configuration.
ru: Запускает задачи после завершения основной установки и настройки. Этот тег используется для финальной настройки, применения изменений в файлах конфигурации и проверки корректности. Запускайте этот тег после внесения изменений, требующих только применения обновленной конфигурации.

source: Scale individual services
ru: Масштабирование отдельных служб

source: Scaling MariaDB and RabbitMQ
ru: Масштабирование MariaDB и RabbitMQ

source: Scaling your environment
ru: Масштабирование вашего окружения

source: See the following links for additional information to verify OpenStack services:
ru: Дополнительные сведения о проверке служб OpenStack см. по следующим ссылкам:

source: See the hosts in the ``nova_compute`` group that a playbook runs against:
ru: Посмотрите список хостов в группе ``nova_compute``, на которых работает плейбук:

source: See the tasks that are executed on hosts in the ``nova_compute`` group:
ru: Посмотрите задания, которые выполняются на хостах в группе ``nova_compute``:

source: Select an instance from the list of available instances.
ru: Выберите инстанс из списка доступных инстансов.

source: Select the :guilabel:`Admin` tab in the navigation pane and click :guilabel:`Images`.
ru: Выберите вкладку :guilabel:`Администратор` в панели навигации и нажмите :guilabel:`Образы`.

source: Selective Pruning
ru: Выборочная очистка

source: Set instances on the failed node to be hosted on a different node:
ru: Определите инстансы на отказавшем узле для размещения на другом узле:

source: Sets up and configures uWSGI processes. Useful when adjusting process counts, sockets, or performance tuning.
ru: Устанавливает и настраивает процессы uWSGI. Полезно при настройке количества процессов, сокетов или производительности.

source: Setup of new MariaDB and RabbitMQ clusters
ru: Настройка новых кластеров MariaDB и RabbitMQ

source: Shared Filesystems service
ru: Служба общих файловых систем

source: Show all groups and which hosts belong to them:
ru: Посмотрите все группы и хосты, принадлежащие к ним:

source: Show all hosts and the groups to which they belong:
ru: Посмотрите все хосты и группы, к которым они принадлежат:

source: Shut down the Block Storage host:
ru: Выключите узел блочного хранилища:

source: Shut down the Compute host:
ru: Выключите вычислительный узел:

source: Shut down the instances:
ru: Выключите все инстансы с подключенными дисками блочного хранилища:

source: Shutting down the Block Storage host
ru: Выключение узла блочного хранилища

source: Shutting down the Compute host
ru: Выключение вычислительного узла

source: Similar to adding a provider network, the removal process uses the same procedure but in a reversed order. The Neutron ports will need to be removed, prior to the removal of the OpenStack-Ansible configuration.
ru: Подобно добавлению сети провайдера, процесс удаления использует ту же процедуру, но в обратном порядке. Порты Neutron необходимо будет удалить перед удалением конфигурации OpenStack-Ansible.

source: Since configuration of HAProxy backends happens during individual service provisioning, we need to ensure that all backends are configured before enabling Keepalived to select this host.
ru: Поскольку настройка бекэндов HAProxy происходит во время предоставления отдельных служб, нам нужно убедиться, что все бекэнды настроены, прежде чем разрешить Keepalived выбирать этот хост.

source: Since the Train release, OpenStack-Ansible services have been configured to save logs in ``systemd-journald`` instead of traditional log files. Journald logs from containers are passed through to the physical host, so you can read and manipulate all service logs directly from the metal hosts using tools like ``journalctl``.
ru: Начиная с релиза Train, службы OpenStack-Ansible настроены на сохранение логов в ``systemd-journald`` вместо традиционных файлов лога. Логи Journald из контейнеров передаются на физический хост, поэтому вы можете читать и изменять все журналы служб непосредственно с выделенных хостов, используя такие инструменты, как ``journalctl``.

source: Since we need to preserve an IP address, let’s collect this data before taking any actions against the current setup:
ru: Поскольку нам необходимо сохранить IP-адрес, давайте соберем эти данные, прежде чем предпринимать какие-либо действия в отношении текущей настройки:

source: Skipping the ``nova-key`` tag is necessary so that the keys on all Compute hosts are not gathered.
ru: Игнорирование метки ``nova-key`` необходимо для того, чтобы не собирать ключи на всех вычислительных хостах.

source: So the recommended practice is to take the HEAD commit SHA of the desired stable branch and set it explicitly. To find the latest SHA of the ``stable/2025.1`` branch, you can run (e.g. for Nova):
ru: Поэтому рекомендуется взять SHA-хэш HEAD-коммита нужной стабильной ветки и задать его явно. Чтобы найти последний SHA-хэш ветки ``stable/2025.1``, выполните (например, для Nova):

source: Soft or hard reset the instance
ru: Мягкая или жесткая перезагрузка инстанса

source: Some containers, such as ``cinder``, ``glance``, ``neutron_agents``, and ``swift_proxy`` have more than two interfaces to support their functions.
ru: Некоторые контейнеры, такие как ``cinder``, ``glance``, ``neutron_agents`` и ``swift_proxy``, имеют более двух интерфейсов для поддержки своих функций.

source: Sometimes you may need to apply the latest security patches or bug fixes for a service while remaining on the same stable branch. This can be done by overriding the Git installation branch for that service, which instructs OpenStack-Ansible to pull the most recent code from the branch you are already tracking. But using branches directly as ``<service>_git_install_branch`` is highly discouraged. Every time the playbook is re-run, the service may be upgraded to a newer commit, which can lead to inconsistent versions between hosts (for example, when adding a new compute node later).
ru: Иногда может потребоваться установить последние обновления безопасности или исправления ошибок для службы, оставаясь на той же стабильной ветке. Это можно сделать, переопределив ветку установки Git для этой службы, которая предписывает OpenStack-Ansible извлечь самый последний код из ветки, которую вы уже отслеживаете. Однако, использование веток напрямую, как ``<service>_git_install_branch``, крайне не рекомендуется. При каждом повторном запуске плейбука служба может обновляться до более нового коммита, что может привести к несогласованности версий между хостами (например, при последующем добавлении нового вычислительного узла).

source: Source the ``admin`` tenant credentials:
ru: Получите учетные данные пользователя ``admin``:

source: Specify a customisation script. This script runs after the instance launches and becomes active.
ru: Укажите скрипт настройки. Этот скрипт запускается после запуска инстанса и становится активным.

source: Specify a key pair with this option. If the image uses a static key set (not recommended), a key pair is not needed.
ru: Укажите ключевую пару с помощью этой опции. Если образ использует статический набор ключей (не рекомендуется), ключевая пара не нужна.

source: Specify whether the instance will be based on an image or a snapshot. If it is the first time creating an instance, there will not yet be any snapshots available.
ru: Укажите, будет ли инстанс основан на образе или снимке. Если инстанс создается впервые, то пока не будет доступных снимков.

source: Start a cluster
ru: Запуск кластера

source: Start a new cluster on the most advanced node. Change to the ``playbooks`` directory and check the ``seqno`` value in the ``grastate.dat`` file on all of the nodes:
ru: Запустите новый кластер на самом производительном узле. Перейдите в каталог ``playbooks`` и проверьте значение ``seqno`` в файле ``grastate.dat`` на всех узлах:

source: Start your instances and confirm all of the instances are started:
ru: Запустите инстансы и убедитесь, что все инстансы запущены:

source: Stop and restart a RabbitMQ cluster
ru: Остановка и перезапуск кластера RabbitMQ

source: Tags are similar to the limit flag for groups, except tags are used to only run specific tasks within a playbook. For more information on tags, see `Tags <https://docs.ansible.com/ansible/latest/playbook_guide/playbooks_tags.html>`_.
ru: Теги похожи на флаг ограничения для групп, за исключением того, что теги используются только для запуска определенных задач в плейбуке. Для получения дополнительной информации о тегах см. `Теги <https://docs.ansible.com/ansible/latest/playbook_guide/playbooks_tags.html>`_.

source: Temporarily set your primary Galera in 'MAINT' in HAProxy.
ru: Временно установите вашу основную Galera в 'MAINT' в HAProxy.

source: Test new compute nodes
ru: Проверка новых вычислительных узлов

source: Test new infra nodes
ru: Тестирование новых узлов инфраструктуры

source: The 'primary' will be the LAST box you'll want to reinstall.
ru: 'Основной' будет ПОСЛЕДНИМ блоком, который вы захотите переустановить.

source: The **Actions** column includes the following options:
ru: Столбец **Действия** включает в себя следующие параметры:

source: The **openstack flavor list** command lists the *flavors* that are available. These are different disk sizes that can be assigned to images:
ru: Команда **openstack flavor list** выводит список доступных *шаблонов конфигурации*. Это различные размеры дисков, которые могут быть назначены образам:

source: The **openstack floating ip list** command lists the currently available floating IP addresses and the instances they are associated with:
ru: Команда **openstack floating ip list** выводит список доступных в данный момент плавающих IP-адресов и инстансов, к которым они привязаны:

source: The `OpenStack-Ansible Operator Tooling <https://opendev.org/openstack/openstack-ansible-ops>`_ repository contains a playbook for removing a compute host from an OpenStack-Ansible environment. To remove a compute host, follow the below procedure.
ru: Репозиторий `OpenStack-Ansible Operator Tooling <https://opendev.org/openstack/openstack-ansible-ops>`_ содержит плейбук по удалению вычислительного узла из окружения OpenStack-Ansible. Чтобы удалить вычислительный узел, выполните следующую процедуру.

source: The ``/etc/openstack_deploy/`` directory contains a live inventory, host structure, network information, passwords, and options that are applied to the configuration files for each service in your OpenStack deployment. Backup the ``/etc/openstack_deploy/`` directory to a remote location.
ru: Каталог ``/etc/openstack_deploy/`` содержит текущий inventory, структуру хоста, сетевую информацию, пароли и параметры, которые применяются к файлам конфигурации для каждой службы в вашем развертывании OpenStack. Сделайте резервную копию каталога ``/etc/openstack_deploy/`` в удаленном месте.

source: The ``Link:`` lines will show the network interfaces that are attached to the utility container.
ru: Строки ``Link:`` будут показывать сетевые интерфейсы, подключенные к контейнеру утилит.

source: The ``container_bridge`` setting defines the physical network bridge used to connect the veth pair from the physical host to the container. Inside the container, the ``container_interface`` setting defines the name at which the physical network will be made available. The ``container_interface`` setting is not required when Neutron agents are deployed on bare metal. Make sure that both settings are uniquely defined across their provider networks and that the network interface is correctly configured inside your operating system. ``group_binds`` define where this network need to attached to, to either containers or physical hosts and is ultimately dependent on the network stack in use. For example, Linuxbridge versus OVS. The configuration ``range`` defines Neutron physical segmentation IDs which are automatically used by end users when creating networks via mainly horizon and the Neutron API. Similar is true for the ``net_name`` configuration which defines the addressable name inside the Neutron configuration. This configuration also need to be unique across other provider networks.
ru: Параметр ``container_bridge`` определяет физический сетевой мост, используемый для соединения пары veth от физического хоста к контейнеру. Внутри контейнера параметр ``container_interface`` определяет имя, по которому будет доступна физическая сеть. Параметр ``container_interface`` не требуется, когда агенты Neutron развертываются на "голом" железе. Убедитесь, что оба параметра определены уникально в сетях их провайдеров и что сетевой интерфейс правильно настроен в вашей операционной системе. ``group_binds`` определяет, к чему должна быть подключена эта сеть, к контейнерам или физическим хостам, и в конечном итоге зависит от используемого сетевого стека. Например, Linuxbridge или OVS. Конфигурация ``range`` определяет ID физической сегментации Neutron, которые автоматически используются пользователями при создании сетей в основном через Horizon и API Neutron. То же самое справедливо и для конфигурации ``net_name``, которая определяет адресуемое имя внутри конфигурации Neutron. Эта конфигурация также должна быть уникальной в сетях других провайдеров.

source: The ``glance-api`` handles the API interactions and image store.
ru: ``glance-api`` управляет взаимодействием с API и хранилищем образов.

source: The ``openstack_hosts`` role allows control over the behavior of ``systemd-journald`` on the host. There are following variable to configure journald settings:
ru: Роль ``openstack_hosts`` позволяет управлять поведением ``systemd-journald`` на хосте. Для настройки параметров journald используются следующие переменные:

source: The affinity value for each container is set at one by default. Adjust the affinity value to zero for situations where the OpenStack services housed within a specific container will not be needed when scaling out other required services.
ru: Значение affinity для каждого контейнера по умолчанию установлено на единицу. Установите значение affinity на ноль для ситуаций, когда службы OpenStack, размещенные в определенном контейнере, не понадобятся при масштабировании других требуемых служб.

source: The availability zone in which the image service creates the instance. If no availability zones is defined, no instances will be found. The cloud provider sets the availability zone to a specific value.
ru: Зона доступности, в которой служба образов создает инстанс. Если зоны доступности не определены, инстансы не будут найдены. Провайдер облачных услуг устанавливает зону доступности в виде определенного значения.

source: The client requires an ARA server to store data. The server is not included in OpenStack-Ansible and must be deployed by the operator. The recommended method is to use the ``recordsansible.ara`` collection.
ru: Для хранения данных клиенту требуется сервер ARA. Сервер не входит в OpenStack-Ansible и должен быть развернут оператором. Рекомендуемый метод — использовать коллекцию ``recordsansible.ara``.

source: The cluster comes back online after completion of this command. If this fails, please review `restarting the cluster`_ and `recovering the primary component`_ in the Galera documentation as they're invaluable for a full cluster recovery.
ru: Кластер возвращается в рабочий режим после завершения этой команды. Если это не удается, пожалуйста, ознакомьтесь с разделами `перезапуск кластера`_ и `восстановление основного компонента`_ в документации Galera, поскольку они бесценны для полного восстановления кластера.

source: The cookie value is a shared secret and should be protected and kept private.
ru: Значение cookie-файла является общим секретом и должно быть защищено и сохранено в тайне.

source: The copy module copies a file on a local machine to remote locations. To copy files from remote locations to the local machine you would use the fetch module. If you need variable interpolation in copied files, use the template module. For more information, see `copy - Copies files to remote locations <https://docs.ansible.com/ansible/latest/collections/ansible/builtin/copy_module.html>`_.
ru: Модуль копирования копирует файл с локальной машины на удаленные расположения. Чтобы скопировать файлы из удаленных расположений на локальную машину, используйте модуль fetch. Если вам нужна интерполяция переменных в скопированных файлах, используйте модуль template. Для получения дополнительной информации см. `copy - Копирует файлы на удаленные расположения <https://docs.ansible.com/ansible/latest/collections/ansible/builtin/copy_module.html>`_.

source: The default ``MaxSessions`` setting for the OpenSSH Daemon is 10. Each Ansible fork makes use of a session. By default, Ansible sets the number of forks to 5. However, you can increase the number of forks used in order to improve deployment performance in large environments.
ru: Значение по умолчанию ``MaxSessions`` для OpenSSH Daemon равно 10. Каждый fork Ansible использует сессию. По умолчанию Ansible устанавливает количество forks равным 5. Однако вы можете увеличить количество используемых forks, чтобы улучшить производительность развертывания в больших окружениях.

source: The default location of the cookie on ``*nix`` environments is ``/var/lib/rabbitmq/.erlang.cookie`` or in ``$HOME/.erlang.cookie``.
ru: Расположение cookie по умолчанию в средах ``*nix`` - ``/var/lib/rabbitmq/.erlang.cookie`` или ``$HOME/.erlang.cookie``.

source: The difference is that the cluster status section of the output, both nodes are now grouped together:
ru: Разница заключается в том, что в разделе состояния кластера в выводе оба узла теперь сгруппированы вместе:

source: The fetch module gathers files from remote machines and stores the files locally in a file tree, organized by the hostname.
ru: Модуль fetch собирает файлы с удаленных машин и сохраняет их локально в файловом дереве, организованном по имени хоста.

source: The first thing to do is to list current members of the MariaDB cluster. For that, you can issue the following ad-hoc command:
ru: Первое, что нужно сделать, это перечислить текущих участников кластера MariaDB. Для этого можно выполнить следующую ad-hoc команду:

source: The first will just remove the container but leave the data in the bind mounts and logs. The second will remove the data in the bind mounts and logs too.
ru: Первый вариант просто удалит контейнер, но оставит данные в точках монтирования и логах. Второй удалит данные в точках монтирования и логах.

source: The following example shows how to move a file from your deployment host to the ``/tmp`` directory on a set of remote machines:
ru: В следующем примере показано, как переместить файл с хоста развертывания в каталог ``/tmp`` на наборе удаленных машин:

source: The following examples shows the :file:`nova-compute.log` file being pulled from a single Compute host:
ru: В следующих примерах показано, как файл :file:`nova-compute.log` извлекается из одного вычислительного хоста:

source: The following nova client commands are provided:
ru: Предусмотрены следующие команды клиента nova:

source: The following procedure addresses Compute node failure if shared storage is used.
ru: В следующей процедуре рассматривается отказ вычислительного узла при использовании общего хранилища.

source: The following services are known to lack support for '--limit':
ru: Известно, что следующие службы не поддерживают "--limit":

source: The following table lists the commands to restart an OpenStack service.
ru: В следующей таблице перечислены команды для перезапуска службы OpenStack.

source: The following tags are available in OpenStack Ansible:
ru: В OpenStack Ansible доступны следующие теги:

source: The instance will boot from the selected image. This option will be pre-populated with the instance selected from the table. However, choose ``Boot from Snapshot`` in **Instance Boot Source**, and it will default to ``Snapshot`` instead.
ru: Инстанс загрузится с выбранного образа. В параметре будет предварительно указан инстанс, выбранный из таблицы. Однако, если выберите ``Загрузка с снимка`` в **Источнике загрузки**, то вместо этого по умолчанию будет ``Снимок``.

source: The inventory backup archive will require maintenance over a long enough period of time.
ru: Резервный архив inventory потребует обслуживания в течение достаточно длительного периода времени.

source: The live migration is accessible via the nova client.
ru: Живая миграция доступна через клиента nova.

source: The most common OpenStack-Ansible deployment design is three control nodes, each one is running all OpenStack API services along with supporting infrastructure, like MariaDB and RabbitMQ clusters. This is a good starting point for small to medium-sized deployments. However, as the deployment grows, you may start to experience performance problems. Typically communication between services and MariaDB/RabbitMQ looks like this:
ru: Наиболее распространенная схема развертывания OpenStack-Ansible представляет собой три управляющих узла, на каждом из которых запущены все службы OpenStack API вместе со вспомогательной инфраструктурой, такой как кластеры MariaDB и RabbitMQ. Это хорошая отправная точка для развертываний малого и среднего размера. Однако, по мере роста развертывания могут возникнуть проблемы с производительностью. Обычно взаимодействие между службами и MariaDB/RabbitMQ выглядит следующим образом:

source: The name of the new instance, which becomes the initial host name of the server. If the server name is changed in the API or directly changed, the Dashboard names remain unchanged
ru: Имя нового инстанса, которое становится исходным именем хоста сервера. Если имя сервера изменяется в API или напрямую, имена в панели управления остаются неизменными.
