Repository: MrLiukang/openstack-ansible
Catalog: doc/source/locale/*/LC_MESSAGES/doc.po
Languages: id

source: 2023.1 (Antelope): EOM (end-of-maintenance)
id: 2023.1 (Antelope): EOM (akhir pemeliharaan)

source: 2023.2 (Bobcat): Maintained
id: 2023.2 (Bobcat): Dipertahankan

source: 2024.1 (Caracal): Maintained
id: 2024.1 (Caracal): Dipertahankan

source: 2024.2 (Dalmatian): Maintained
id: 2024.2 (Dalmatian): Dipertahankan

source: 2025.1 (Epoxy): Under development
id: 2025.1 (Epoxy): Dalam pengembangan

source: Deployment guide
id: Panduan penerapan

source: Documentation is available for each of the following releases.
id: Dokumentasi tersedia untuk setiap rilis berikut.

source: Introduction
id: Perkenalan

source: Ocata: EOL (end-of-life)
id: Ocata: EOL (akhir kehidupan)

source: OpenStack-Ansible 2023.1 (Antelope) was EOM-ed on January 31, 2025.
id: OpenStack-Ansible 2023.1 (Antelope) disahkan EOM pada 31 January 2025.

source: OpenStack-Ansible 2023.2 (Bobcat) was first released with the 28.0.0 tag on December 7, 2023.
id: OpenStack-Ansible 2023.2 (Bobcat) pertama kali dirilis dengan tag 28.0.0 pada 7 Desember 2023.

source: OpenStack-Ansible 2024.1 (Caracal) was first released with the 29.0.0 tag on June 6, 2024.
id: Seri OpenStack-Ansible 2024.1 (Caracal) pertama kali dirilis dengan tag 29.0.0 pada 9 Juni 2024.

source: OpenStack-Ansible 2024.2 (Dalmatian) was first released with the 30.0.0 tag on November 28, 2024.
id: Seri OpenStack-Ansible 2024.2 (Dalmatian) pertama kali dirilis dengan tag 30.0.0 pada 14 November 2024.

source: OpenStack-Ansible 2025.1 (Epoxy) is currently Under Development.
id: OpenStack-Ansible 2025.1 (Epoxy) sedang dalam pengembangan.

source: OpenStack-Ansible Documentation
id: Dokumentasi OpenStack-Ansible

source: OpenStack-Ansible Train series was EOL'd on 3 January 2024.
id: OpenStack-Ansible Train adalah EOL'd pada 3 Januari 2024.

source: OpenStack-Ansible Ussuri series was EOL'd on 3 January 2024.
id: OpenStack-Ansible Ussuri adalah EOL'd pada 3 Januari 2024.

source: OpenStack-Ansible Victoria series was EOM-ed on April 12, 2024.
id: OpenStack-Ansible Victoria disahkan EOM pada 12 April 2024.

source: OpenStack-Ansible Wallaby series was EOM-ed on April 12, 2024.
id: OpenStack-Ansible Wallaby disahkan EOM pada 12 April 2024.

source: OpenStack-Ansible Xena series was EOM-ed on April 12, 2024.
id: OpenStack-Ansible Xena disahkan EOM pada 12 April 2024.

source: OpenStack-Ansible Yoga series was EOM-ed on February 8, 2024.
id: OpenStack-Ansible Yoga disahkan EOM pada 8 Februari 2024.

source: OpenStack-Ansible Zed series was EOM-ed on June 6, 2024.
id: OpenStack-Ansible Zed disahkan EOM pada 6 Juni 2024.

source: OpenStack-Ansible provides Ansible playbooks and roles for deploying and configuring an OpenStack environment.
id: OpenStack-Ansible menyediakan playbook dan peran Ansible untuk menyebarkan dan mengonfigurasi lingkungan OpenStack.

source: OpenStack-Ansible's Mitaka series was EOL'd on 10 April 2017.
id: OpenStack-Ansible's Mitaka series EOL'd pada 10 April 2017.

source: OpenStack-Ansible's Newton series was EOL'd on 3 April 2018.
id: OpenStack-Ansible's Newton series adalah EOL'd pada 3 April 2018.

source: OpenStack-Ansible's Ocata series was EOL'd on 21 December 2022.
id: OpenStack-Ansible Ocata adalah EOL'd pada 21 Desember 2022.

source: OpenStack-Ansible's Pike series was EOL'd on 17 June 2022.
id: OpenStack-Ansible Pike adalah EOL'd pada 17 Juni 2022.

source: OpenStack-Ansible's Queens series was EOL'd on 19 October 2022.
id: OpenStack-Ansible Queens adalah EOL'd pada 19 Oktober 2022.

source: OpenStack-Ansible's Rocky series was EOL'd on 11 July 2023.
id: OpenStack-Ansible Rocky adalah EOL'd pada 11 Juli 2023.

source: OpenStack-Ansible's Stein series was EOL'd on 14 December 2023.
id: OpenStack-Ansible Stein adalah EOL'd pada 14 Desember 2023.

source: Pike: EOL (end-of-life)
id: Pike: EOL (akhir kehidupan)

source: Queens: EOL (end-of-life)
id: Queens: EOL (akhir kehidupan)

source: Release notes
id: Catatan rilis

source: Rocky: EOL (end-of-life)
id: Rocky: EOL (akhir kehidupan)

source: Stein: EOL (end-of-life)
id: Stein: EOL (akhir kehidupan)

source: To view the documentation only, see the `OpenStack-Ansible Mitaka Documentation <https://docs.openstack.org/openstack-ansible/mitaka/>`_.
id: Untuk melihat dokumentasi saja, lihat `OpenStack-Ansible Mitaka Documentation <https://docs.openstack.org/openstack-ansible/mitaka/>`_.

source: To view the documentation only, see the `OpenStack-Ansible Newton Documentation <https://docs.openstack.org/openstack-ansible/newton/>`_.
id: Untuk melihat dokumentasi saja, lihat `OpenStack-Ansible Newton Documentation <https://docs.openstack.org/openstack-ansible/newton/>`_.

source: Train: EOL (end-of-life)
id: Train: EOL (akhir kehidupan)

source: Ussuri: EOL (end-of-life)
id: Ussuri: EOL (akhir kehidupan)

source: Victoria: EOM (end-of-maintenance)
id: Victoria: EOM (akhir pemeliharaan)

source: Wallaby: EOM (end-of-maintenance)
id: Wallaby: EOM (akhir pemeliharaan)

source: Xena: EOM (end-of-maintenance)
id: Xena: EOM (akhir pemeliharaan)

source: Yoga: EOM (end-of-maintenance)
id: Yoga: EOM (akhir pemeliharaan)

source: Zed: EOM (end-of-maintenance)
id: Zed: EOM (akhir pemeliharaan)

source: `OpenStack-Ansible 2023.1 series release notes`_
id: `Catatan Rilis Seri OpenStack-Ansible 2023.1`_

source: `OpenStack-Ansible 2023.2 series release notes`_
id: `Catatan Rilis Seri OpenStack-Ansible 2023.2`_

source: `OpenStack-Ansible 2024.1 series release notes`_
id: `Catatan Rilis Seri OpenStack-Ansible 2024.1`_

source: `OpenStack-Ansible 2024.2 series release notes`_
id: `Catatan Rilis Seri OpenStack-Ansible 2024.2`_

source: `OpenStack-Ansible Victoria series release notes`_
id: `Catatan Rilis Seri OpenStack-Ansible Victoria`_

source: `OpenStack-Ansible Wallaby series release notes`_
id: `Catatan Rilis Seri OpenStack-Ansible Wallaby`_

source: `OpenStack-Ansible Xena series release notes`_
id: `Catatan Rilis Seri OpenStack-Ansible Xena`_

source: `OpenStack-Ansible Yoga series release notes`_
id: `Catatan Rilis Seri OpenStack-Ansible Yoga`_

source: `OpenStack-Ansible Zed series release notes`_
id: `Catatan Rilis Seri OpenStack-Ansible Zed`_
